<!DOCTYPE html>
<html lang="en" id="wrapper">
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Render-функции и JSX</title>

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <link href="./style.css" rel="stylesheet" type="text/css">

    <!-- версия для разработки, отображает полезные предупреждения в консоли -->
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>

    <!-- production-версия, оптимизированная для размера и скорости -->
    <!--    <script src="https://cdn.jsdelivr.net/npm/vue"></script>-->

</head>
<body id="main">
<p>Спаршено с: <a href="https://ru.vuejs.org/v2/guide/render-function.html">https://ru.vuejs.org/v2/guide/render-function.html</a></p>

    
      
        

      
    
    
      <h1>Render-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x438; JSX</h1>
    
    
      <h2 id="&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;"><a href="#&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;" class="headerlink" title="&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;"></a>&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;</h2><p>&#x412; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x432; &#x434;&#x43B;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; HTML &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; Vue &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;. &#x412;&#x43F;&#x440;&#x43E;&#x447;&#x435;&#x43C;, &#x438;&#x43D;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x43E;&#x437;&#x43D;&#x438;&#x43A;&#x430;&#x435;&#x442; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x44C; &#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x432;&#x441;&#x435;&#x445; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; JavaScript. &#x412; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; <strong><code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;</strong> &#x2014; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43D;&#x438;&#x437;&#x43A;&#x43E;&#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x432;&#x443;&#x44E; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;&#x43C;.</p>
<p>&#x414;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x440;&#x430;&#x437;&#x431;&#x435;&#x440;&#x451;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x446;&#x435;&#x43B;&#x435;&#x441;&#x43E;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43D;&#x44B;&#x43C;. &#x41F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x438;&#x43C;, &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x441;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x438; &#x441; &#xAB;&#x44F;&#x43A;&#x43E;&#x440;&#x44F;&#x43C;&#x438;&#xBB;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">h1</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">a</span> <span class="hljs-attr">name</span>=<span class="hljs-string">&quot;hello-world&quot;</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;#hello-world&quot;</span>&gt;</span>
    &#x41F;&#x440;&#x438;&#x432;&#x435;&#x442;, &#x43C;&#x438;&#x440;!
  <span class="hljs-tag">&lt;/<span class="hljs-name">a</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">h1</span>&gt;</span></code></pre>
<p>&#x414;&#x43B;&#x44F; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x44B;&#x448;&#x435; HTML &#x432;&#x44B; &#x440;&#x435;&#x448;&#x430;&#x435;&#x442;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">anchored-heading</span> <span class="hljs-attr">:level</span>=<span class="hljs-string">&quot;1&quot;</span>&gt;</span>&#x41F;&#x440;&#x438;&#x432;&#x435;&#x442;, &#x43C;&#x438;&#x440;!<span class="hljs-tag">&lt;/<span class="hljs-name">anchored-heading</span>&gt;</span></code></pre>
<p>&#x41F;&#x440;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A;, &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43D;&#x430; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x435; <code>level</code>, &#x432;&#x44B; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E; &#x441;&#x442;&#x43E;&#x43B;&#x43A;&#x43D;&#x451;&#x442;&#x435;&#x441;&#x44C; &#x441;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x435;&#x439; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x435;&#x439;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;text/x-template&quot;</span> <span class="hljs-attr">id</span>=<span class="hljs-string">&quot;anchored-heading-template&quot;</span>&gt;</span><span class="xml">
  <span class="hljs-tag">&lt;<span class="hljs-name">h1</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;level === 1&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">slot</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">slot</span>&gt;</span>
  <span class="hljs-tag">&lt;/<span class="hljs-name">h1</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">h2</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;level === 2&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">slot</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">slot</span>&gt;</span>
  <span class="hljs-tag">&lt;/<span class="hljs-name">h2</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">h3</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;level === 3&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">slot</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">slot</span>&gt;</span>
  <span class="hljs-tag">&lt;/<span class="hljs-name">h3</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">h4</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;level === 4&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">slot</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">slot</span>&gt;</span>
  <span class="hljs-tag">&lt;/<span class="hljs-name">h4</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">h5</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;level === 5&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">slot</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">slot</span>&gt;</span>
  <span class="hljs-tag">&lt;/<span class="hljs-name">h5</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">h6</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;level === 6&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">slot</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">slot</span>&gt;</span>
  <span class="hljs-tag">&lt;/<span class="hljs-name">h6</span>&gt;</span>
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span></code></pre>
<pre><code class="hljs js">Vue.component(<span class="hljs-string">&apos;anchored-heading&apos;</span>, {
  <span class="hljs-attr">template</span>: <span class="hljs-string">&apos;#anchored-heading-template&apos;</span>,
  <span class="hljs-attr">props</span>: {
    <span class="hljs-attr">level</span>: {
      <span class="hljs-attr">type</span>: <span class="hljs-built_in">Number</span>,
      <span class="hljs-attr">required</span>: <span class="hljs-literal">true</span>
    }
  }
})</code></pre>
<p>&#x412;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x43D;&#x435; &#x43E;&#x447;&#x435;&#x43D;&#x44C;. &#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B;&#x441;&#x44F; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43C; &#x2014; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x435;&#x449;&#x451; &#x438; <code>&lt;slot&gt;&lt;/slot&gt;</code> &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x44F;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x44F; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x430;.</p>
<p>&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x44F;&#x442; &#x434;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x43D;&#x43E; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x439; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x2014; &#x44F;&#x432;&#x43D;&#x43E; &#x43D;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x438;&#x437; &#x43D;&#x438;&#x445;. &#x414;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x435;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E;:</p>
<pre><code class="hljs js">Vue.component(<span class="hljs-string">&apos;anchored-heading&apos;</span>, {
  <span class="hljs-attr">render</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
    <span class="hljs-keyword">return</span> createElement(
      <span class="hljs-string">&apos;h&apos;</span> + <span class="hljs-keyword">this</span>.level,   <span class="hljs-comment">// &#x438;&#x43C;&#x44F; &#x442;&#x435;&#x433;&#x430;</span>
      <span class="hljs-keyword">this</span>.$slots.default <span class="hljs-comment">// &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;</span>
    )
  },
  <span class="hljs-attr">props</span>: {
    <span class="hljs-attr">level</span>: {
      <span class="hljs-attr">type</span>: <span class="hljs-built_in">Number</span>,
      <span class="hljs-attr">required</span>: <span class="hljs-literal">true</span>
    }
  }
})</code></pre>
<p>&#x422;&#x430;&#x43A;-&#x442;&#x43E; &#x43B;&#x443;&#x447;&#x448;&#x435;, &#x43D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435;? &#x41A;&#x43E;&#x434; &#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;, &#x43D;&#x43E; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x441;&#x442;&#x432;&#x430; &#x441;&#x43E; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;&#x43C;&#x438; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; Vue. &#x412; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;, &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x437;&#x43D;&#x430;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x431;&#x435;&#x437; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; <code>v-slot</code>, &#x43A;&#x430;&#x43A; &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; <code>&#x41F;&#x440;&#x438;&#x432;&#x435;&#x442;, &#x43C;&#x438;&#x440;!</code> &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; <code>anchored-heading</code>, &#x43E;&#x43D;&#x438; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x432; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; &#x43A;&#x430;&#x43A; <code>$slots.default</code>. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x435;&#x449;&#x451; &#x43D;&#x435; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B;&#x438;, <strong>&#x441;&#x43E;&#x432;&#x435;&#x442;&#x443;&#x435;&#x43C; &#x432;&#x430;&#x43C; &#x43F;&#x440;&#x43E;&#x431;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x433;&#x43B;&#x430;&#x437;&#x430;&#x43C;&#x438; <a href="../api/#&#x421;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;-&#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;">API-&#x441;&#x43F;&#x440;&#x430;&#x432;&#x43E;&#x447;&#x43D;&#x438;&#x43A; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;</a>, &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x435;&#x43C; &#x43A;&#x430;&#x43A; &#x443;&#x433;&#x43B;&#x443;&#x431;&#x43B;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x43D;&#x438;&#x435; render-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x439;.</strong></p>
<h2 id="&#x423;&#x437;&#x43B;&#x44B;-&#x434;&#x435;&#x440;&#x435;&#x432;&#x44C;&#x44F;-&#x438;-&#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439;-DOM"><a href="#&#x423;&#x437;&#x43B;&#x44B;-&#x434;&#x435;&#x440;&#x435;&#x432;&#x44C;&#x44F;-&#x438;-&#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439;-DOM" class="headerlink" title="&#x423;&#x437;&#x43B;&#x44B;, &#x434;&#x435;&#x440;&#x435;&#x432;&#x44C;&#x44F;, &#x438; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; DOM"></a>&#x423;&#x437;&#x43B;&#x44B;, &#x434;&#x435;&#x440;&#x435;&#x432;&#x44C;&#x44F;, &#x438; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; DOM</h2><p>&#x41F;&#x440;&#x435;&#x436;&#x434;&#x435; &#x447;&#x435;&#x43C; &#x43F;&#x43E;&#x433;&#x440;&#x443;&#x437;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;, &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C;, &#x43A;&#x430;&#x43A; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x442; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x44B;. &#x412;&#x43E;&#x437;&#x44C;&#x43C;&#x451;&#x43C;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x44D;&#x442;&#x43E;&#x442; HTML-&#x43A;&#x43E;&#x434;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">div</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">h1</span>&gt;</span>My title<span class="hljs-tag">&lt;/<span class="hljs-name">h1</span>&gt;</span>
  Some text content
  <span class="hljs-comment">&lt;!-- <span class="hljs-doctag">TODO:</span> Add tagline --&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span></code></pre>
<p>&#x41A;&#x43E;&#x433;&#x434;&#x430; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x44D;&#x442;&#x43E;&#x442; &#x43A;&#x43E;&#x434;, &#x43E;&#x43D; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x451;&#x442; <a href="https://learn.javascript.ru/dom-nodes" target="_blank" rel="noopener">&#x434;&#x435;&#x440;&#x435;&#x432;&#x43E; &#xAB;&#x443;&#x437;&#x43B;&#x43E;&#x432; DOM&#xBB;</a>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x431;&#x43B;&#x435;&#x433;&#x447;&#x438;&#x442;&#x44C; &#x435;&#x43C;&#x443; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E;, &#x43A;&#x430;&#x43A;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432;&#x44B; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x431;&#x44B; &#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x44C; &#x433;&#x435;&#x43D;&#x435;&#x430;&#x43B;&#x43E;&#x433;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x435; &#x434;&#x435;&#x440;&#x435;&#x432;&#x43E; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x430;&#x448;&#x435;&#x439; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x432;&#x430;&#x44E;&#x449;&#x435;&#x439;&#x441;&#x44F; &#x441;&#x435;&#x43C;&#x44C;&#x438;.</p>
<p>&#x414;&#x435;&#x440;&#x435;&#x432;&#x43E; &#x443;&#x437;&#x43B;&#x43E;&#x432; DOM &#x434;&#x43B;&#x44F; HTML &#x438;&#x437; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430; &#x432;&#x44B;&#x448;&#x435; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;:</p>
<p><img src="/images/dom-tree.png" alt="&#x412;&#x438;&#x437;&#x443;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x434;&#x435;&#x440;&#x435;&#x432;&#x430; DOM"></p>
<p>&#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x443;&#x437;&#x43B;&#x43E;&#x43C;. &#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x444;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x443;&#x437;&#x43B;&#x43E;&#x43C;. &#x414;&#x430;&#x436;&#x435; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x438; &#x44D;&#x442;&#x43E; &#x443;&#x437;&#x43B;&#x44B;! &#x423;&#x437;&#x435;&#x43B; &#x2014; &#x44D;&#x442;&#x43E; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43B;&#x438;&#x448;&#x44C; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B;. &#x418; &#x442;&#x430;&#x43A; &#x436;&#x435;, &#x43A;&#x430;&#x43A; &#x438; &#x432; &#x433;&#x435;&#x43D;&#x435;&#x430;&#x43B;&#x43E;&#x433;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x43C; &#x434;&#x435;&#x440;&#x435;&#x432;&#x435;, &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x443;&#x437;&#x435;&#x43B; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x438;&#x43C;&#x435;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x438;&#x445; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x43A;&#x43E;&#x432; (&#x442;.&#x435;. &#x43A;&#x430;&#x436;&#x434;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x44C; &#x432; &#x441;&#x435;&#x431;&#x435; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438;).</p>
<p>&#x41E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x441;&#x435;&#x445; &#x44D;&#x442;&#x438;&#x445; &#x443;&#x437;&#x43B;&#x43E;&#x432; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x437;&#x430;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;, &#x43D;&#x43E;, &#x43A; &#x441;&#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E;, &#x432;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E; &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E;. &#x412;&#x44B; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x435; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x439; HTML-&#x43A;&#x43E;&#x434;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x438;&#x442;&#x44C; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">h1</span>&gt;</span>{{ blogTitle }}<span class="hljs-tag">&lt;/<span class="hljs-name">h1</span>&gt;</span></code></pre>
<p>&#x418;&#x43B;&#x438; &#x442;&#x43E; &#x436;&#x435;, &#x43D;&#x43E; &#x441; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;&#x43C; render-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;:</p>
<pre><code class="hljs js">render: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
  <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;h1&apos;</span>, <span class="hljs-keyword">this</span>.blogTitle)
}</code></pre>
<p>&#x412; &#x43E;&#x431;&#x43E;&#x438;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445; Vue &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43F;&#x440;&#x438; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F;&#x445; <code>blogTitle</code>.</p>
<h3 id="&#x412;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439;-DOM"><a href="#&#x412;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439;-DOM" class="headerlink" title="&#x412;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; DOM"></a>&#x412;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; DOM</h3><p>Vue &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x443;&#x435;&#x442; &#x44D;&#x442;&#x43E; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435;&#x43C; <strong>&#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; DOM</strong>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x435;&#x43C;&#x443; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x43D;&#x435;&#x441;&#x442;&#x438; &#x432; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; DOM. &#x420;&#x430;&#x441;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x43C; &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x435;&#x435; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x443;&#x44E; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x443;:</p>
<pre><code class="hljs js"><span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;h1&apos;</span>, <span class="hljs-keyword">this</span>.blogTitle)</code></pre>
<p>&#x427;&#x442;&#x43E; &#x432; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442; <code>createElement</code>? &#x42D;&#x442;&#x43E; &#x43D;&#x435; <em>&#x432; &#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x438;</em> &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; DOM-&#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x442;&#x44C; <code>createNodeDescription</code>, &#x435;&#x441;&#x43B;&#x438; &#x431;&#x44B;&#x442;&#x44C; &#x442;&#x43E;&#x447;&#x43D;&#x44B;&#x43C;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E;, &#x43E;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x44E;&#x449;&#x443;&#x44E; Vue, &#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x443;&#x437;&#x435;&#x43B; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x451;&#x43D; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44F; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x43B;&#x44E;&#x431;&#x44B;&#x445; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x443;&#x437;&#x43B;&#x43E;&#x432;. &#x41C;&#x44B; &#x43D;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x44D;&#x442;&#x43E; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; &#x443;&#x437;&#x43B;&#x430; &#xAB;&#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x443;&#x437;&#x43B;&#x43E;&#x43C;&#xBB;, &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x441;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x430;&#x44F; &#x434;&#x43E; &#x430;&#x431;&#x431;&#x440;&#x435;&#x432;&#x438;&#x430;&#x442;&#x443;&#x440;&#x44B; <strong>VNode</strong>. &#xAB;&#x412;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; DOM&#xBB; &#x2014; &#x44D;&#x442;&#x43E; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43C;&#x44B; &#x43D;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x432;&#x441;&#x435;&#x43C; &#x434;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x43C; VNodes, &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x438;&#x437; &#x434;&#x435;&#x440;&#x435;&#x432;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432; Vue.</p>
<h2 id="&#x410;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;-createElement"><a href="#&#x410;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;-createElement" class="headerlink" title="&#x410;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; createElement"></a>&#x410;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; <code>createElement</code></h2><p>&#x421;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;, &#x441; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x2014; &#x44D;&#x442;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x435;&#x439; <code>createElement</code>. &#x412;&#x43E;&#x442; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; <code>createElement</code>:</p>
<pre><code class="hljs js"><span class="hljs-comment">// @returns {VNode}</span>
createElement(
  <span class="hljs-comment">// {String | Object | Function}</span>
  <span class="hljs-comment">// &#x41D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x442;&#x435;&#x433;&#x430; HTML, &#x43E;&#x43F;&#x446;&#x438;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; &#x438;&#x43B;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x430;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;,</span>
  <span class="hljs-comment">// &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x44E;&#x449;&#x430;&#x44F; &#x43E;&#x434;&#x438;&#x43D; &#x438;&#x437; &#x434;&#x432;&#x443;&#x445; &#x43D;&#x438;&#x445;. &#x41E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;.</span>
  <span class="hljs-string">&apos;div&apos;</span>,

  <span class="hljs-comment">// {Object}</span>
  <span class="hljs-comment">// &#x41E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;, &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x438;&#x439; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B;,</span>
  <span class="hljs-comment">// &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432;&#x44B; &#x431;&#x44B; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x438; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x435;. &#x41E;&#x43F;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;.</span>
  {
    <span class="hljs-comment">// (&#x441;&#x43C;. &#x434;&#x435;&#x442;&#x430;&#x43B;&#x438; &#x432; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x438; &#x43D;&#x438;&#x436;&#x435;)</span>
  },

  <span class="hljs-comment">// {String | Array}</span>
  <span class="hljs-comment">// &#x414;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x435; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x443;&#x437;&#x43B;&#x44B; (VNode), &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; `createElement()`</span>
  <span class="hljs-comment">// &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &apos;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x44B;&#x445; VNode&apos;. &#x41E;&#x43F;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;.</span>
  [
    <span class="hljs-string">&apos;&#x41A;&#x430;&#x43A;&#x43E;&#x439;-&#x442;&#x43E; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x43F;&#x440;&#x435;&#x436;&#x434;&#x435; &#x432;&#x441;&#x435;&#x445; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;.&apos;</span>,
    createElement(<span class="hljs-string">&apos;h1&apos;</span>, <span class="hljs-string">&apos;&#x417;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A;&apos;</span>),
    createElement(MyComponent, {
      <span class="hljs-attr">props</span>: {
        <span class="hljs-attr">someProp</span>: <span class="hljs-string">&apos;foobar&apos;</span>
      }
    })
  ]
)</code></pre>
<h3 id="&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E;-&#x43E;&#x431;-&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x435;-&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;"><a href="#&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E;-&#x43E;&#x431;-&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x435;-&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;" class="headerlink" title="&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E; &#x43E;&#x431; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;"></a>&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E; &#x43E;&#x431; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;</h3><p>&#x41E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;: &#x43E;&#x441;&#x43E;&#x431;&#x44B;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;&#x445; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B; <code>v-bind:class</code> &#x438; <code>v-bind:style</code>, &#x438; &#x432; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x430;&#x445; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x443;&#x437;&#x43B;&#x43E;&#x432; &#x438;&#x43C;&#x435;&#x44E;&#x442; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x43E;&#x43B;&#x44F; &#x43D;&#x430; &#x432;&#x435;&#x440;&#x445;&#x43D;&#x435;&#x43C; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;. &#x42D;&#x442;&#x43E;&#x442; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x432;&#x430;&#x43C; &#x441;&#x432;&#x44F;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x435; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B; HTML, &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; DOM, &#x442;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x430;&#x43A; <code>innerHTML</code> (&#x44D;&#x442;&#x43E; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x443; <code>v-html</code>):</p>
<pre><code class="hljs js">{
  // &#x422;&#x43E; &#x436;&#x435; API, &#x447;&#x442;&#x43E; &#x438; &#x443; `v-bind:class`, &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x44E;&#x449;&#x438;&#x439;
  // &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x443;, &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;, &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432; &#x441;&#x442;&#x440;&#x43E;&#x43A; &#x438;&#x43B;&#x438; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432;
  class: {
    foo: true,
    bar: false
  },
  // &#x422;&#x43E; &#x436;&#x435; API, &#x447;&#x442;&#x43E; &#x438; &#x443; `v-bind:style`, &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x44E;&#x449;&#x438;&#x439;
  // &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x443;, &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;, &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432; &#x441;&#x442;&#x440;&#x43E;&#x43A; &#x438;&#x43B;&#x438; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432;
  style: {
    color: &apos;red&apos;,
    fontSize: &apos;14px&apos;
  },
  // &#x41E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x435; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B; HTML
  attrs: {
    id: &apos;foo&apos;
  },
  // &#x412;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x44B; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;
  props: {
    myProp: &apos;bar&apos;
  },
  // &#x421;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; DOM
  domProps: {
    innerHTML: &apos;baz&apos;
  },
  // &#x41E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x438; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; &#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x434; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x43C; `on`,
  // &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x44B;, &#x432;&#x440;&#x43E;&#x434;&#x435; &#x43A;&#x430;&#x43A; `v-on:keyup.enter`, &#x43D;&#x435;
  // &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F;. &#x41F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x442;&#x44C; keyCode &#x43F;&#x440;&#x438;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E;.
  on: {
    click: this.clickHandler
  },
  // &#x422;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x41F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x435; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F;,
  // &#x430; &#x43D;&#x435; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x43C;&#x44B;&#x435; &#x432; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; `vm.$emit`.
  nativeOn: {
    click: this.nativeClickHandler
  },
  // &#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x435; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B;. &#x41E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;, &#x447;&#x442;&#x43E; `oldValue`
  // &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; Vue &#x441;&#x430;&#x43C; &#x435;&#x433;&#x43E; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;
  directives: [
    {
      name: &apos;my-custom-directive&apos;,
      value: &apos;2&apos;,
      expression: &apos;1 + 1&apos;,
      arg: &apos;foo&apos;,
      modifiers: {
        bar: true
      }
    }
  ],
  // &#x421;&#x43B;&#x43E;&#x442;&#x44B; &#x441; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C;&#x44E; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x432; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x435;
  // { name: props =&gt; VNode | Array&lt;VNode&gt; }
  scopedSlots: {
    default: props =&gt; createElement(&apos;span&apos;, props.text)
  },
  // &#x418;&#x43C;&#x44F; &#x441;&#x43B;&#x43E;&#x442;&#x430;, &#x435;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E;&#x442; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;
  // &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x43A;&#x43E;&#x43C; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;
  slot: &apos;name-of-slot&apos;,
  // &#x41F;&#x440;&#x43E;&#x447;&#x438;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x432;&#x435;&#x440;&#x445;&#x43D;&#x435;&#x433;&#x43E; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x44F;
  key: &apos;myKey&apos;,
  ref: &apos;myRef&apos;,
  // &#x415;&#x441;&#x43B;&#x438; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x435; &#x43E;&#x434;&#x43D;&#x43E; &#x438;&#x43C;&#x44F; &#x432; ref &#x43A; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x43C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;
  // &#x432; render-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x2014; &#x44D;&#x442;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; `$refs.myRef` &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43E;&#x43C;
  refInFor: true
}</code></pre>
<h3 id="&#x41F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439;-&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;"><a href="#&#x41F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439;-&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;" class="headerlink" title="&#x41F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;"></a>&#x41F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;</h3><p>&#x423;&#x437;&#x43D;&#x430;&#x432; &#x432;&#x441;&#x451; &#x44D;&#x442;&#x43E;, &#x43C;&#x44B; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44B;&#x439; &#x440;&#x430;&#x43D;&#x435;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;:</p>
<pre><code class="hljs js"><span class="hljs-keyword">var</span> getChildrenTextContent = <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">children</span>) </span>{
  <span class="hljs-keyword">return</span> children.map(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">node</span>) </span>{
    <span class="hljs-keyword">return</span> node.children
      ? getChildrenTextContent(node.children)
      : node.text
  }).join(<span class="hljs-string">&apos;&apos;</span>)
}

Vue.component(<span class="hljs-string">&apos;anchored-heading&apos;</span>, {
  <span class="hljs-attr">render</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
    <span class="hljs-comment">// &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; id &#x432; kebab-case</span>
    <span class="hljs-keyword">var</span> headingId = getChildrenTextContent(<span class="hljs-keyword">this</span>.$slots.default)
      .toLowerCase()
      .replace(<span class="hljs-regexp">/\W+/g</span>, <span class="hljs-string">&apos;-&apos;</span>)
      .replace(<span class="hljs-regexp">/(^-|-$)/g</span>, <span class="hljs-string">&apos;&apos;</span>)

    <span class="hljs-keyword">return</span> createElement(
      <span class="hljs-string">&apos;h&apos;</span> + <span class="hljs-keyword">this</span>.level,
      [
        createElement(<span class="hljs-string">&apos;a&apos;</span>, {
          <span class="hljs-attr">attrs</span>: {
            <span class="hljs-attr">name</span>: headingId,
            <span class="hljs-attr">href</span>: <span class="hljs-string">&apos;#&apos;</span> + headingId
          }
        }, <span class="hljs-keyword">this</span>.$slots.default)
      ]
    )
  },
  <span class="hljs-attr">props</span>: {
    <span class="hljs-attr">level</span>: {
      <span class="hljs-attr">type</span>: <span class="hljs-built_in">Number</span>,
      <span class="hljs-attr">required</span>: <span class="hljs-literal">true</span>
    }
  }
})</code></pre>
<h3 id="&#x41E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x44F;"><a href="#&#x41E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x44F;" class="headerlink" title="&#x41E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x44F;"></a>&#x41E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x44F;</h3><h4 id="&#x412;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435;-&#x443;&#x437;&#x43B;&#x44B;-&#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B;-&#x431;&#x44B;&#x442;&#x44C;-&#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438;"><a href="#&#x412;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435;-&#x443;&#x437;&#x43B;&#x44B;-&#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B;-&#x431;&#x44B;&#x442;&#x44C;-&#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438;" class="headerlink" title="&#x412;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x443;&#x437;&#x43B;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x431;&#x44B;&#x442;&#x44C; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438;"></a>&#x412;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x443;&#x437;&#x43B;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x431;&#x44B;&#x442;&#x44C; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438;</h4><p>&#x412;&#x441;&#x435; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x443;&#x437;&#x43B;&#x44B; &#x432; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x431;&#x44B;&#x442;&#x44C; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438;. &#x42D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x447;&#x442;&#x43E; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; &#x43D;&#x438;&#x436;&#x435; &#x43D;&#x435;&#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x430;:</p>
<pre><code class="hljs js">render: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
  <span class="hljs-keyword">var</span> myParagraphVNode = createElement(<span class="hljs-string">&apos;p&apos;</span>, <span class="hljs-string">&apos;hi&apos;</span>)
  <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;div&apos;</span>, [
    <span class="hljs-comment">// &#x423;&#x43F;&#x441; &#x2014; &#x434;&#x443;&#x431;&#x43B;&#x438;&#x440;&#x443;&#x44E;&#x449;&#x438;&#x435;&#x441;&#x44F; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x443;&#x437;&#x43B;&#x44B;!</span>
    myParagraphVNode, myParagraphVNode
  ])
}</code></pre>
<p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x43A;&#x440;&#x430;&#x442;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x438; &#x442;&#x43E;&#x442; &#x436;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;/&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;, &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E;-&#x444;&#x430;&#x431;&#x440;&#x438;&#x43A;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x430;&#x44F; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x44B;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; 20 &#x43E;&#x434;&#x438;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x44B;&#x445; &#x430;&#x431;&#x437;&#x430;&#x446;&#x435;&#x432;:</p>
<pre><code class="hljs js">render: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
  <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;div&apos;</span>,
    <span class="hljs-built_in">Array</span>.apply(<span class="hljs-literal">null</span>, { <span class="hljs-attr">length</span>: <span class="hljs-number">20</span> }).map(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
      <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;p&apos;</span>, <span class="hljs-string">&apos;&#x41F;&#x440;&#x438;&#x432;&#x435;&#x442;&apos;</span>)
    })
  )
}</code></pre>
<h2 id="&#x420;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;-&#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439;-&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;-&#x441;-&#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E;-JavaScript"><a href="#&#x420;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;-&#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439;-&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;-&#x441;-&#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E;-JavaScript" class="headerlink" title="&#x420;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; JavaScript"></a>&#x420;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; JavaScript</h2><h3 id="v-if-&#x438;-v-for"><a href="#v-if-&#x438;-v-for" class="headerlink" title="v-if &#x438; v-for"></a><code>v-if</code> &#x438; <code>v-for</code></h3><p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x443;&#x435;&#x43C;&#x430;&#x44F; &#x432; JavaScript, &#x43D;&#x435; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x43E;&#x442; Vue &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x43B;&#x438;&#x431;&#x43E; &#x43F;&#x440;&#x43E;&#x43F;&#x440;&#x438;&#x435;&#x442;&#x430;&#x440;&#x43D;&#x43E;&#x439; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x44B;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x435; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;&#x445; <code>v-if</code> &#x438; <code>v-for</code>:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">ul</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;items.length&quot;</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">li</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;item in items&quot;</span>&gt;</span>{{ item.name }}<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">ul</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-else</span>&gt;</span>&#x41D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43E;.<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>&#x41F;&#x440;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <code>if</code>/<code>else</code> &#x438; <code>map</code>:</p>
<pre><code class="hljs js">props: [<span class="hljs-string">&apos;items&apos;</span>],
<span class="hljs-attr">render</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
  <span class="hljs-keyword">if</span> (<span class="hljs-keyword">this</span>.items.length) {
    <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;ul&apos;</span>, <span class="hljs-keyword">this</span>.items.map(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">item</span>) </span>{
      <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;li&apos;</span>, item.name)
    }))
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;p&apos;</span>, <span class="hljs-string">&apos;&#x41D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43E;.&apos;</span>)
  }
}</code></pre>
<h3 id="v-model"><a href="#v-model" class="headerlink" title="v-model"></a><code>v-model</code></h3><p>&#x412; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x43D;&#x435;&#x442; &#x43F;&#x440;&#x44F;&#x43C;&#x43E;&#x433;&#x43E; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x430; <code>v-model</code> &#x2014; &#x432;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x443; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;:</p>
<pre><code class="hljs js">props: [<span class="hljs-string">&apos;value&apos;</span>],
<span class="hljs-attr">render</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
  <span class="hljs-keyword">var</span> self = <span class="hljs-keyword">this</span>
  <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;input&apos;</span>, {
    <span class="hljs-attr">domProps</span>: {
      <span class="hljs-attr">value</span>: self.value
    },
    <span class="hljs-attr">on</span>: {
      <span class="hljs-attr">input</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">event</span>) </span>{
        self.$emit(<span class="hljs-string">&apos;input&apos;</span>, event.target.value)
      }
    }
  })
}</code></pre>
<p>&#x42D;&#x442;&#x43E; &#x446;&#x435;&#x43D;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43D;&#x438;&#x437;&#x43A;&#x43E;&#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x432;&#x43E;&#x439; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x432; &#x442;&#x43E; &#x436;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x432;&#x430;&#x43C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44F; &#x43D;&#x430;&#x434; &#x432;&#x437;&#x430;&#x438;&#x43C;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;&#x43C;, &#x447;&#x435;&#x43C; <code>v-model</code>.</p>
<h3 id="&#x421;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F;-&#x438;-&#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x44B;-&#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;"><a href="#&#x421;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F;-&#x438;-&#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x44B;-&#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;" class="headerlink" title="&#x421;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F; &#x438; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x44B; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;"></a>&#x421;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F; &#x438; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x44B; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;</h3><p>&#x414;&#x43B;&#x44F; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x432; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; <code>.passive</code>, <code>.capture</code> &#x438; <code>.once</code>, Vue &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x43F;&#x440;&#x435;&#x444;&#x438;&#x43A;&#x441;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x44B; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; <code>on</code>:</p>
<table>
<thead>
<tr>
<th>&#x41C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x44B;</th>
<th>&#x41F;&#x440;&#x435;&#x444;&#x438;&#x43A;&#x441;</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>.passive</code></td>
<td><code>&amp;</code></td>
</tr>
<tr>
<td><code>.capture</code></td>
<td><code>!</code></td>
</tr>
<tr>
<td><code>.once</code></td>
<td><code>~</code></td>
</tr>
<tr>
<td><code>.capture.once</code> &#x438;&#x43B;&#x438;<br><code>.once.capture</code></td>
<td><code>~!</code></td>
</tr>
</tbody>
</table>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p>
<pre><code class="hljs javascript">on: {
  <span class="hljs-string">&apos;!click&apos;</span>: <span class="hljs-keyword">this</span>.doThisInCapturingMode,
  <span class="hljs-string">&apos;~keyup&apos;</span>: <span class="hljs-keyword">this</span>.doThisOnce,
  <span class="hljs-string">&apos;~!mouseover&apos;</span>: <span class="hljs-keyword">this</span>.doThisOnceInCapturingMode
}</code></pre>
<p>&#x414;&#x43B;&#x44F; &#x432;&#x441;&#x435;&#x445; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; &#x438; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x432; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448; &#x43D;&#x435;&#x442; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x432; &#x43F;&#x440;&#x435;&#x444;&#x438;&#x43A;&#x441;&#x435;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F; &#x432; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x435;:</p>
<table>
<thead>
<tr>
<th>&#x41C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x44B;</th>
<th>&#x42D;&#x43A;&#x432;&#x438;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x432; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x435;</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>.stop</code></td>
<td><code>event.stopPropagation()</code></td>
</tr>
<tr>
<td><code>.prevent</code></td>
<td><code>event.preventDefault()</code></td>
</tr>
<tr>
<td><code>.self</code></td>
<td><code>if (event.target !== event.currentTarget) return</code></td>
</tr>
<tr>
<td>&#x41A;&#x43B;&#x430;&#x432;&#x438;&#x448;&#x438;:<br><code>.enter</code>, <code>.13</code></td>
<td><code>if (event.keyCode !== 13) return</code> (&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x435; <code>13</code> &#x43D;&#x430; <a href="http://keycode.info/" target="_blank" rel="noopener">&#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x43A;&#x43E;&#x434; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;&#x438;</a> &#x434;&#x43B;&#x44F; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x432; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;)</td>
</tr>
<tr>
<td>&#x41C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x44B; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;:<br><code>.ctrl</code>, <code>.alt</code>, <code>.shift</code>, <code>.meta</code></td>
<td><code>if (!event.ctrlKey) return</code> (&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x435; <code>ctrlKey</code> &#x43D;&#x430; <code>altKey</code>, <code>shiftKey</code> &#x438;&#x43B;&#x438; <code>metaKey</code> &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;)</td>
</tr>
</tbody>
</table>
<p>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x441;&#x435;&#x445; &#x44D;&#x442;&#x438;&#x445; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x432; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435;:</p>
<pre><code class="hljs javascript">on: {
  <span class="hljs-attr">keyup</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">event</span>) </span>{
    <span class="hljs-comment">// &#x41D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x43C;, &#x435;&#x441;&#x43B;&#x438; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x43E;&#x448;&#x43B;&#x43E;</span>
    <span class="hljs-comment">// &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x435; &#x43D;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x44B; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x435;&#x43C;</span>
    <span class="hljs-keyword">if</span> (event.target !== event.currentTarget) <span class="hljs-keyword">return</span>

    <span class="hljs-comment">// &#x41D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x43C;, &#x435;&#x441;&#x43B;&#x438; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;&#x430; &#x43D;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; Enter (13)</span>
    <span class="hljs-comment">// &#x438; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448;&#x430; SHIFT &#x43D;&#x435; &#x431;&#x44B;&#x43B;&#x430; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x430; &#x432; &#x442;&#x43E; &#x436;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F;</span>
    <span class="hljs-keyword">if</span> (!event.shiftKey || event.keyCode !== <span class="hljs-number">13</span>) <span class="hljs-keyword">return</span>

    <span class="hljs-comment">// &#x41E;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x435;&#x43C; &#x432;&#x441;&#x43F;&#x43B;&#x44B;&#x442;&#x438;&#x435; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F;</span>
    event.stopPropagation()

    <span class="hljs-comment">// &#x41E;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x435;&#x43C; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x439; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A; keyup &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;</span>
    event.preventDefault()
    <span class="hljs-comment">// ...</span>
  }
}</code></pre>
<h3 id="&#x421;&#x43B;&#x43E;&#x442;&#x44B;"><a href="#&#x421;&#x43B;&#x43E;&#x442;&#x44B;" class="headerlink" title="&#x421;&#x43B;&#x43E;&#x442;&#x44B;"></a>&#x421;&#x43B;&#x43E;&#x442;&#x44B;</h3><p>&#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x43C;&#x443; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x43C;&#x443; &#x441;&#x43B;&#x43E;&#x442;&#x43E;&#x432; &#x432; &#x432;&#x438;&#x434;&#x435; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43E;&#x432; VNode, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; <a href="../api/#vm-slots"><code>this.$slots</code></a>:</p>
<pre><code class="hljs js">render: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
  <span class="hljs-comment">// `&lt;div&gt;&lt;slot&gt;&lt;/slot&gt;&lt;/div&gt;`</span>
  <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;div&apos;</span>, <span class="hljs-keyword">this</span>.$slots.default)
}</code></pre>
<p>&#x418; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; &#x441;&#x43B;&#x43E;&#x442;&#x430;&#x43C; &#x441;&#x43E; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C;&#x44E; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43A;&#x430;&#x43A; &#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;&#x43C;, &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x44E;&#x449;&#x438;&#x43C; VNode, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; <a href="../api/#vm-scopedSlots"><code>this.$scopedSlots</code></a>:</p>
<pre><code class="hljs js">props: [<span class="hljs-string">&apos;message&apos;</span>],
<span class="hljs-attr">render</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
  <span class="hljs-comment">// `&lt;div&gt;&lt;slot :text=&quot;message&quot;&gt;&lt;/slot&gt;&lt;/div&gt;`</span>
  <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;div&apos;</span>, [
    <span class="hljs-keyword">this</span>.$scopedSlots.default({
      <span class="hljs-attr">text</span>: <span class="hljs-keyword">this</span>.message
    })
  ])
}</code></pre>
<p>&#x427;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x44C; &#x441;&#x43B;&#x43E;&#x442;&#x44B; &#x441;&#x43E; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C;&#x44E; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x432; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x438; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;, &#x434;&#x43E;&#x431;&#x430;&#x432;&#x44C;&#x442;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E; <code>scopedSlots</code> &#x432; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; VNode:</p>
<pre><code class="hljs js">render: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement</span>) </span>{
  <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;div&apos;</span>, [
    createElement(<span class="hljs-string">&apos;child&apos;</span>, {
      <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x43C; `scopedSlots` &#x432; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442; data</span>
      <span class="hljs-comment">// &#x432; &#x432;&#x438;&#x434;&#x435; { name: props =&gt; VNode | Array&lt;VNode&gt; }</span>
      scopedSlots: {
        <span class="hljs-attr">default</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">props</span>) </span>{
          <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;span&apos;</span>, props.text)
        }
      }
    })
  ])
}</code></pre>
<h2 id="JSX"><a href="#JSX" class="headerlink" title="JSX"></a>JSX</h2><p>&#x415;&#x441;&#x43B;&#x438; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x439;, &#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x43A;&#x43E;&#x434; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x443;&#x442;&#x43E;&#x43C;&#x43B;&#x44F;&#x442;&#x44C;:</p>
<pre><code class="hljs js">createElement(
  <span class="hljs-string">&apos;anchored-heading&apos;</span>, {
    <span class="hljs-attr">props</span>: {
      <span class="hljs-attr">level</span>: <span class="hljs-number">1</span>
    }
  }, [
    createElement(<span class="hljs-string">&apos;span&apos;</span>, <span class="hljs-string">&apos;&#x41F;&#x440;&#x438;&#x432;&#x435;&#x442;&apos;</span>),
    <span class="hljs-string">&apos;, &#x43C;&#x438;&#x440;!&apos;</span>
  ]
)</code></pre>
<p>&#x41E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E; &#x432; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x441; &#x43A;&#x43E;&#x434;&#x43E;&#x43C; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">anchored-heading</span> <span class="hljs-attr">:level</span>=<span class="hljs-string">&quot;1&quot;</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">span</span>&gt;</span>&#x41F;&#x440;&#x438;&#x432;&#x435;&#x442;<span class="hljs-tag">&lt;/<span class="hljs-name">span</span>&gt;</span>, &#x43C;&#x438;&#x440;!
<span class="hljs-tag">&lt;/<span class="hljs-name">anchored-heading</span>&gt;</span></code></pre>
<p>&#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x435;&#x441;&#x442;&#x44C; <a href="https://github.com/vuejs/jsx" target="_blank" rel="noopener">&#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D; &#x434;&#x43B;&#x44F; Babel</a>, &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x439; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; JSX &#x432;&#x43E; Vue, &#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;, &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;:</p>
<pre><code class="hljs js"><span class="hljs-keyword">import</span> AnchoredHeading <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;./AnchoredHeading.vue&apos;</span>

<span class="hljs-keyword">new</span> Vue({
  <span class="hljs-attr">el</span>: <span class="hljs-string">&apos;#demo&apos;</span>,
  <span class="hljs-attr">render</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">h</span>) </span>{
    <span class="hljs-keyword">return</span> (
      <span class="xml"><span class="hljs-tag">&lt;<span class="hljs-name">AnchoredHeading</span> <span class="hljs-attr">level</span>=<span class="hljs-string">{1}</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">span</span>&gt;</span>&#x41F;&#x440;&#x438;&#x432;&#x435;&#x442;<span class="hljs-tag">&lt;/<span class="hljs-name">span</span>&gt;</span>, &#x43C;&#x438;&#x440;!
      <span class="hljs-tag">&lt;/<span class="hljs-name">AnchoredHeading</span>&gt;</span></span>
    )
  }
})</code></pre>
<p class="tip">&#x421;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x438;&#x435; <code>createElement</code> &#x434;&#x43E; <code>h</code> &#x2014; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x451;&#x43D;&#x43D;&#x43E;&#x435; &#x441;&#x43E;&#x433;&#x43B;&#x430;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435; Vue &#x438; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x434;&#x43B;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; JSX. &#x41D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44F; &#x441; <a href="https://github.com/vuejs/babel-plugin-transform-vue-jsx#h-auto-injection" target="_blank" rel="noopener">&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; 3.4.0</a> &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x430; Babel &#x434;&#x43B;&#x44F; Vue, &#x43C;&#x44B; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x432;&#x43D;&#x435;&#x434;&#x440;&#x44F;&#x435;&#x43C; <code>const h = this.$createElement</code> &#x432; &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x438; &#x433;&#x435;&#x442;&#x442;&#x435;&#x440; (&#x43D;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;&#x445; &#x438;&#x43B;&#x438; &#x441;&#x442;&#x440;&#x435;&#x43B;&#x43E;&#x447;&#x43D;&#x44B;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;&#x445;), &#x43E;&#x431;&#x44A;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x432; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x435; ES2015 &#x441; JSX, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x434;&#x430;&#x43B;&#x438;&#x442;&#x44C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; <code>(h)</code>. &#x412; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x438;&#x445; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F;&#x445; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x430;, &#x432;&#x430;&#x448;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44B;&#x43A;&#x438;&#x434;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443;, &#x435;&#x441;&#x43B;&#x438; <code>h</code> &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;.</p>

<p>&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x443;&#x44E; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E; &#x43E; &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; JSX &#x432; JavaScript &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x432; <a href="https://github.com/vuejs/jsx#installation" target="_blank" rel="noopener">&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x430;</a>.</p>
<h2 id="&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;"><a href="#&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;" class="headerlink" title="&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;"></a>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;</h2><p>&#x41A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x43E;&#x432; &#x441; &#xAB;&#x44F;&#x43A;&#x43E;&#x440;&#x44F;&#x43C;&#x438;&#xBB;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x44B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43B;&#x438; &#x432;&#x44B;&#x448;&#x435;, &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;. &#x423; &#x43D;&#x435;&#x433;&#x43E; &#x43D;&#x435;&#x442; &#x43A;&#x430;&#x43A;&#x43E;&#x433;&#x43E;-&#x43B;&#x438;&#x431;&#x43E; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F;, &#x445;&#x443;&#x43A;&#x43E;&#x432; &#x438;&#x43B;&#x438; &#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x449;&#x438;&#x445; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;. &#x41F;&#x43E; &#x441;&#x443;&#x442;&#x438;, &#x44D;&#x442;&#x43E; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43B;&#x438;&#x448;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; &#x441; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C;.</p>
<p>&#x412; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x43E;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x43A;&#x430;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; (&#x43E;&#x43F;&#x446;&#x438;&#x44F; <code>functional</code>), &#x447;&#x442;&#x43E; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x435;&#x442; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; &#x443; &#x43D;&#x438;&#x445; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F; (&#x43D;&#x435;&#x442; <a href="../api/#&#x41E;&#x43F;&#x446;&#x438;&#x438;-&#x2014;-&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435;">&#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x445; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;</a>) &#x438; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; (&#x43D;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; <code>this</code>). <strong>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;</strong> &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x442;&#x430;&#x43A;:</p>
<pre><code class="hljs js">Vue.component(<span class="hljs-string">&apos;my-component&apos;</span>, {
  <span class="hljs-attr">functional</span>: <span class="hljs-literal">true</span>,
  <span class="hljs-comment">// &#x432;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x44B; &#x43E;&#x43F;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;</span>
  props: {
    <span class="hljs-comment">// ...</span>
  },
  <span class="hljs-comment">// &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43A;&#x43E;&#x43C;&#x43F;&#x435;&#x43D;&#x441;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;</span>
  <span class="hljs-comment">// &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x43C; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442; &#x432;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C;</span>
  render: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement, context</span>) </span>{
    <span class="hljs-comment">// ...</span>
  }
})</code></pre>
<blockquote>
<p>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x447;&#x430;&#x43D;&#x438;&#x435;: &#x432; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F;&#x445; &#x434;&#x43E; 2.3.0 &#x43E;&#x43F;&#x446;&#x438;&#x44F; <code>props</code> &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x430;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x44B; &#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x435;. &#x421; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; 2.3.0 &#x438; &#x432;&#x44B;&#x448;&#x435; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43E;&#x43F;&#x446;&#x438;&#x44E; <code>props</code> &#x438; &#x432;&#x441;&#x435; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B;, &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43D;&#x430; &#x443;&#x437;&#x43B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;, &#x431;&#x443;&#x434;&#x443;&#x442; &#x43D;&#x435;&#x44F;&#x432;&#x43D;&#x43E; &#x438;&#x437;&#x432;&#x43B;&#x435;&#x447;&#x435;&#x43D;&#x44B; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x432;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x445; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;.</p>
<p>&#x421;&#x441;&#x44B;&#x43B;&#x43A;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x430; HTMLElement &#x43F;&#x440;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x441; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; &#x443; &#x43D;&#x438;&#x445; &#x43D;&#x435;&#x442; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F; &#x438; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;.</p>
</blockquote>
<p>&#x421; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; 2.5.0+, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x435; <a href="single-file-components.html">&#x43E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;</a>, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x431;&#x44A;&#x44F;&#x432;&#x438;&#x442;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;, &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43D;&#x430; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">template</span> <span class="hljs-attr">functional</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">template</span>&gt;</span></code></pre>
<p>&#x412;&#x441;&#x451; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x442;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; <code>context</code> &#x2014; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;, &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x438;&#x439; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x43F;&#x43E;&#x43B;&#x44F;:</p>
<ul>
<li><code>props</code>: &#x41E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x441;&#x43E; &#x432;&#x441;&#x435;&#x43C;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x432;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x43C;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430;&#x43C;&#x438;</li>
<li><code>children</code>: &#x41C;&#x430;&#x441;&#x441;&#x438;&#x432; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x443;&#x437;&#x43B;&#x43E;&#x432;</li>
<li><code>slots</code>: &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;, &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x44E;&#x449;&#x430;&#x44F; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x441;&#x43E; &#x441;&#x43B;&#x43E;&#x442;&#x430;&#x43C;&#x438;</li>
<li><code>scopedSlots</code>: (2.6.0+) &#x41E;&#x431;&#x44A;&#x435;&#x43A;&#x442;, &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x438;&#x439; &#x432;&#x441;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x441;&#x43B;&#x43E;&#x442;&#x44B; &#x441; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C;&#x44E; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;. &#x422;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x43C; &#x441;&#x43B;&#x43E;&#x442;&#x430;&#x43C; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x439;</li>
<li><code>data</code>: <a href="#&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E;-&#x43E;&#x431;-&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x435;-&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;">&#x41E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;</a> &#x446;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x43C;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x443; &#x432;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; <code>createElement</code></li>
<li><code>parent</code>: &#x421;&#x441;&#x44B;&#x43B;&#x43A;&#x430; &#x43D;&#x430; &#x440;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;</li>
<li><code>listeners</code>: (2.3.0+) &#x41E;&#x431;&#x44A;&#x435;&#x43A;&#x442;, &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x438;&#x439; &#x432;&#x441;&#x435; &#x437;&#x430;&#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x432; &#x440;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x43B;&#x443;&#x448;&#x438;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x438; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439;. &#x42D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; <code>data.on</code></li>
<li><code>injections</code>: (2.3.0+) &#x415;&#x441;&#x43B;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x43F;&#x446;&#x438;&#x44F; <a href="../api/#provide-inject"><code>inject</code></a>, &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x451;&#x43D;&#x43D;&#x44B;&#x435; &#x438;&#x43D;&#x44A;&#x435;&#x43A;&#x446;&#x438;&#x438;.</li>
</ul>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; <code>functional: true</code>, &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x43D;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x43E;&#x432; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430; <code>context</code>, &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; <code>this.$slots.default</code> &#x43D;&#x430; <code>context.children</code> &#x438; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x44B; <code>this.level</code> &#x43D;&#x430; <code>context.props.level</code>.</p>
<p>&#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x2014; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;, &#x438;&#x445; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x435;&#x435;.</p>
<p>&#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43E;&#x43D;&#x438; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x44B; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x43E;&#x431;&#x451;&#x440;&#x442;&#x43E;&#x43A;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E;:</p>
<ul>
<li>&#x412;&#x44B;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x438;&#x437; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x435;&#x439; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438; &#x432; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x442;&#x43E;&#x447;&#x43A;&#x435;</li>
<li>&#x41F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43C;&#x430;&#x43D;&#x438;&#x43F;&#x443;&#x43B;&#x44F;&#x446;&#x438;&#x438; &#x43D;&#x430;&#x434; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x43C;&#x438; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;, &#x432;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x43C;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430;&#x43C;&#x438; &#x438;&#x43B;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438;, &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x435;&#x43C; &#x43A;&#x430;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x44C; &#x438;&#x445; &#x432; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;</li>
</ul>
<p>&#x412;&#x43E;&#x442; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; <code>smart-list</code>, &#x434;&#x435;&#x43B;&#x435;&#x433;&#x438;&#x440;&#x443;&#x44E;&#x449;&#x435;&#x433;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x443; &#x43A; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;, &#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x432; &#x43D;&#x435;&#x433;&#x43E; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;:</p>
<pre><code class="hljs js"><span class="hljs-keyword">var</span> EmptyList = { <span class="hljs-comment">/* ... */</span> }
<span class="hljs-keyword">var</span> TableList = { <span class="hljs-comment">/* ... */</span> }
<span class="hljs-keyword">var</span> OrderedList = { <span class="hljs-comment">/* ... */</span> }
<span class="hljs-keyword">var</span> UnorderedList = { <span class="hljs-comment">/* ... */</span> }

Vue.component(<span class="hljs-string">&apos;smart-list&apos;</span>, {
  <span class="hljs-attr">functional</span>: <span class="hljs-literal">true</span>,
  <span class="hljs-attr">props</span>: {
    <span class="hljs-attr">items</span>: {
      <span class="hljs-attr">type</span>: <span class="hljs-built_in">Array</span>,
      <span class="hljs-attr">required</span>: <span class="hljs-literal">true</span>
    },
    <span class="hljs-attr">isOrdered</span>: <span class="hljs-built_in">Boolean</span>
  },
  <span class="hljs-attr">render</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement, context</span>) </span>{
    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">appropriateListComponent</span> (<span class="hljs-params"></span>) </span>{
      <span class="hljs-keyword">var</span> items = context.props.items

      <span class="hljs-keyword">if</span> (items.length === <span class="hljs-number">0</span>)           <span class="hljs-keyword">return</span> EmptyList
      <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> items[<span class="hljs-number">0</span>] === <span class="hljs-string">&apos;object&apos;</span>) <span class="hljs-keyword">return</span> TableList
      <span class="hljs-keyword">if</span> (context.props.isOrdered)      <span class="hljs-keyword">return</span> OrderedList

      <span class="hljs-keyword">return</span> UnorderedList
    }

    <span class="hljs-keyword">return</span> createElement(
      appropriateListComponent(),
      context.data,
      context.children
    )
  }
})</code></pre>
<h3 id="&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430;-&#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x43E;&#x432;-&#x438;-&#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439;-&#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x43C;-&#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;"><a href="#&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430;-&#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x43E;&#x432;-&#x438;-&#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439;-&#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x43C;-&#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;" class="headerlink" title="&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x43E;&#x432; &#x438; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x43C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;/&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;"></a>&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x43E;&#x432; &#x438; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x43C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;/&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;</h3><p>&#x412; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x445;, &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B; &#x43D;&#x435; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x435; &#x43A;&#x430;&#x43A; &#x432;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x44B;, &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x43A; &#x43A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x43E;&#x43C;&#x443; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;, &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x44F;&#x44F; &#x438;&#x43B;&#x438; <a href="class-and-style.html">&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x431;&#x44A;&#x435;&#x434;&#x438;&#x43D;&#x44F;&#x44F;</a> &#x43B;&#x44E;&#x431;&#x44B;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B; &#x441; &#x442;&#x435;&#x43C; &#x436;&#x435; &#x438;&#x43C;&#x435;&#x43D;&#x435;&#x43C;.</p>
<p>&#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x442; &#x44F;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F;:</p>
<pre><code class="hljs js">Vue.component(<span class="hljs-string">&apos;my-functional-button&apos;</span>, {
  <span class="hljs-attr">functional</span>: <span class="hljs-literal">true</span>,
  <span class="hljs-attr">render</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">createElement, context</span>) </span>{
    <span class="hljs-comment">// &#x42F;&#x432;&#x43D;&#x430;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x43B;&#x44E;&#x431;&#x44B;&#x445; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x43E;&#x432;, &#x441;&#x43B;&#x443;&#x448;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439;, &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x438; &#x442;.&#x434;.</span>
    <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;button&apos;</span>, context.data, context.children)
  }
})</code></pre>
<p>&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x44F; <code>context.data</code> &#x432;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x432; <code>createElement</code>, &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x43C; &#x43B;&#x44E;&#x431;&#x44B;&#x435; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B; &#x438;&#x43B;&#x438; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x442;&#x435;&#x43B;&#x438; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x435; &#x432; <code>my-functional-button</code>. &#x41D;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x434;&#x435;&#x43B;&#x435; &#x44D;&#x442;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x43E;, &#x447;&#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; &#x43D;&#x435; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440; <code>.native</code>.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x435; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;, &#x432;&#x430;&#x43C; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x440;&#x438;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B; &#x438; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x442;&#x435;&#x43B;&#x438;. &#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x443; &#x43D;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; &#x438;&#x43D;&#x434;&#x438;&#x432;&#x438;&#x434;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x430;, &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; <code>data.attrs</code> &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; &#x43B;&#x44E;&#x431;&#x44B;&#x445; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x43E;&#x432; HTML &#x438; <code>listeners</code> <em>(&#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; <code>data.on</code>)</em> &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; &#x43B;&#x44E;&#x431;&#x44B;&#x445; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439;.</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">template</span> <span class="hljs-attr">functional</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">button</span>
    <span class="hljs-attr">class</span>=<span class="hljs-string">&quot;btn btn-primary&quot;</span>
    <span class="hljs-attr">v-bind</span>=<span class="hljs-string">&quot;data.attrs&quot;</span>
    <span class="hljs-attr">v-on</span>=<span class="hljs-string">&quot;listeners&quot;</span>
  &gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">slot</span>/&gt;</span>
  <span class="hljs-tag">&lt;/<span class="hljs-name">button</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">template</span>&gt;</span></code></pre>
<h3 id="slots-vs-children"><a href="#slots-vs-children" class="headerlink" title="slots() vs children"></a><code>slots()</code> vs <code>children</code></h3><p>&#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x434;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x43C; &#x437;&#x430;&#x447;&#x435;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x44B; <code>slots()</code> &#x438; <code>children</code> &#x43E;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;. &#x420;&#x430;&#x437;&#x432;&#x435; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; <code>slots().default</code> &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x442;&#x44C; &#x442;&#x43E;&#x442; &#x436;&#x435; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;, &#x447;&#x442;&#x43E; &#x438; <code>children</code>? &#x412; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445; &#x2014; &#x434;&#x430;, &#x43D;&#x43E; &#x447;&#x442;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x443; &#x43D;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; &#x431;&#x443;&#x434;&#x443;&#x442; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B;?</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">my-functional-component</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-slot:foo</span>&gt;</span>
    &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439;
  <span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>&#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439;<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">my-functional-component</span>&gt;</span></code></pre>
<p>&#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;, <code>children</code> &#x434;&#x430;&#x441;&#x442; &#x432;&#x430;&#x43C; &#x43E;&#x431;&#x430; &#x430;&#x431;&#x437;&#x430;&#x446;&#x430;, <code>slots().default</code> &#x2014; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439;, &#x430; <code>slots().foo</code> &#x2014; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x43D;&#x430;&#x43B;&#x438;&#x447;&#x438;&#x435; &#x438; <code>children</code>, &#x438; <code>slots()</code> &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x442;&#x44C;, &#x437;&#x43D;&#x430;&#x435;&#x442; &#x43B;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442; &#x43E; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435; &#x441;&#x43B;&#x43E;&#x442;&#x43E;&#x432; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x435;&#x43B;&#x435;&#x433;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x443;, &#x43F;&#x443;&#x442;&#x451;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; <code>children</code>.</p>
<h2 id="&#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x44F;-&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;"><a href="#&#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x44F;-&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;" class="headerlink" title="&#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x44F; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;"></a>&#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x44F; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;</h2><p>&#x412;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;, &#x432;&#x430;&#x43C; &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C;, &#x447;&#x442;&#x43E; Vue-&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x432; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x432; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E;. &#x41E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x43D;&#x435;&#x442; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x435; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x438; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;, &#x43D;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x43E;&#x43F;&#x44B;&#x442;&#x43D;&#x44B;&#x43C; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x43D;&#x430; &#x442;&#x43E;, &#x43A;&#x430;&#x43A; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x442;&#x435; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x44B;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;. &#x41D;&#x438;&#x436;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x430; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x430;&#x44F; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; <code>Vue.compile</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x435; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x443;&#x435;&#x442; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;:</p>

<script async src="https://jsfiddle.net/phanan/5h0wx9np/embed/result,js,html/"></script>


    
    
      <div class="guide-links">
        
        
          <span>&#x2190; <a href="/v2/guide/custom-directive.html">&#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x435; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B;</a></span>
        
        
        
          <span style="float: right;"><a href="/v2/guide/plugins.html">&#x41F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x44B;</a> &#x2192;</span>
        
      </div>
    
    <div class="footer">
        <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
<div class="bsa-cpc"></div>
<script>
  (function(){
    if(typeof _bsa !== 'undefined' && _bsa) {
    _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
      target: '.bsa-cpc',
      align: 'horizontal',
      disable_css: 'true'
    });
      }
  })();
</script>

      &#x41E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x451; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;?
      <a href="https://github.com/translation-gang/ru.vuejs.org/blob/master/src/v2/guide/render-function.md" target="_blank">
        &#x41E;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43D;&#x430; GitHub!
      </a>
    </div>

</body>
</html>