<!DOCTYPE html>
<html lang="en" id="wrapper">
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Миграция с Vue 1.x</title>

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <link href="./style.css" rel="stylesheet" type="text/css">

    <!-- версия для разработки, отображает полезные предупреждения в консоли -->
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>

    <!-- production-версия, оптимизированная для размера и скорости -->
    <!--    <script src="https://cdn.jsdelivr.net/npm/vue"></script>-->

</head>
<body id="main">
<p>Спаршено с: <a href="https://ru.vuejs.org/v2/guide/migration.html">https://ru.vuejs.org/v2/guide/migration.html</a></p>

    
      
        

      
    
    
      <h1>&#x41C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441; Vue 1.x</h1>
    
    
      <h2 id="&#x427;&#x410;&#x412;&#x41E;"><a href="#&#x427;&#x410;&#x412;&#x41E;" class="headerlink" title="&#x427;&#x410;&#x412;&#x41E;"></a>&#x427;&#x410;&#x412;&#x41E;</h2><blockquote>
<p>&#x41E;&#x433;&#x43E;! - &#x44D;&#x442;&#x43E; &#x434;&#x43B;&#x438;&#x438;&#x438;&#x438;&#x438;&#x438;&#x43D;&#x43D;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430;! &#x417;&#x43D;&#x430;&#x447;&#x438;&#x442; &#x43B;&#x438; &#x44D;&#x442;&#x43E;, &#x447;&#x442;&#x43E; 2.0 - &#x441;&#x43E;&#x432;&#x441;&#x435;&#x43C; &#x434;&#x440;&#x443;&#x433;&#x430;&#x44F;, &#x441;&#x43D;&#x43E;&#x432;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x432;&#x441;&#x435;&#x43C;&#x443; &#x443;&#x447;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x430; &#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43D;&#x435;&#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x439;?</p>
</blockquote>
<p>&#x425;&#x43E;&#x440;&#x43E;&#x448;&#x43E;, &#x447;&#x442;&#x43E; &#x441;&#x43F;&#x440;&#x43E;&#x441;&#x438;&#x43B;&#x438;! &#x41E;&#x442;&#x432;&#x435;&#x442; &#x2014; &#x43D;&#x435;&#x442;. &#x41E;&#x43A;&#x43E;&#x43B;&#x43E; 90% API &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x442;&#x435;&#x43C; &#x436;&#x435;, &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x438;&#x438; &#x43D;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x43B;&#x438;&#x441;&#x44C;. &#x410; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443;, &#x447;&#x442;&#x43E; &#x43C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E; &#x43E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x438;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x438; &#x438; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x432;. &#x418; &#x443;&#x436; &#x442;&#x43E;&#x447;&#x43D;&#x43E; <strong>&#x43D;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x447;&#x442;&#x43E; &#x43A;&#x442;&#x43E;-&#x442;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43E;&#x442; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x446;&#x430;!</strong></p>
<blockquote>
<p>&#x413;&#x434;&#x435; &#x44F; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44E;?</p>
</blockquote>
<ol>
<li><p>&#x41D;&#x430;&#x447;&#x43D;&#x438;&#x442;&#x435; &#x441; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> &#x432; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;. &#x41C;&#x44B; &#x442;&#x449;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x438; &#x438; &#x441;&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x438; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x435; Vue &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x432; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438;. &#x412;&#x441;&#x44F;&#x43A;&#x438;&#x439; &#x440;&#x430;&#x437;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43E;&#x43D;&#x438; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x44E;&#x442; &#x443;&#x441;&#x442;&#x430;&#x440;&#x435;&#x432;&#x448;&#x443;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E;, &#x43E;&#x43D;&#x438; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x430;&#x442; &#x432;&#x430;&#x43C;, &#x432;&#x44B;&#x434;&#x430;&#x434;&#x443;&#x442; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x438; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x44F;&#x442; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x438; &#x43D;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E;.</p>
</li>
<li><p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43E;&#x433;&#x43B;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x44D;&#x442;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; &#x43D;&#x430; &#x431;&#x43E;&#x43A;&#x43E;&#x432;&#x43E;&#x439; &#x43F;&#x430;&#x43D;&#x435;&#x43B;&#x438;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x432;&#x438;&#x434;&#x438;&#x442;&#x435; &#x442;&#x435;&#x43C;&#x443;, &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x432;&#x43B;&#x438;&#x44F;&#x442;&#x44C; &#x43D;&#x430; &#x432;&#x430;&#x441;, &#x43D;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A; &#x43F;&#x43E; &#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x435; &#x43F;&#x43E;&#x439;&#x43C;&#x430;&#x43B; &#x435;&#x451; - &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44C;&#x442;&#x435; &#x435;&#x451;.</p>
</li>
<li><p>&#x415;&#x441;&#x43B;&#x438; &#x443; &#x432;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; &#x43A;&#x430;&#x43A;&#x438;&#x435;-&#x43B;&#x438;&#x431;&#x43E; &#x442;&#x435;&#x441;&#x442;&#x44B;, &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; &#x438;&#x445; &#x438; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x442;&#x435;, &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x438;&#x437; &#x43D;&#x438;&#x445; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x44F;&#x442;. &#x415;&#x441;&#x43B;&#x438; &#x443; &#x432;&#x430;&#x441; &#x43D;&#x435;&#x442; &#x442;&#x435;&#x441;&#x442;&#x43E;&#x432;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x442;&#x43A;&#x440;&#x43E;&#x439;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x441;&#x432;&#x43E;&#x451;&#x43C; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435; &#x438; &#x441;&#x43B;&#x435;&#x434;&#x438;&#x442;&#x435; &#x437;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x43E; &#x43D;&#x435;&#x43C;&#x443;.</p>
</li>
<li><p>&#x41A; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x435;&#x43C;&#x443; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x432;&#x430;&#x448;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43F;&#x435;&#x440;&#x435;&#x43D;&#x435;&#x441;&#x435;&#x43D;&#x43E;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x432;&#x441;&#x451; &#x435;&#x449;&#x451; &#x433;&#x43E;&#x43B;&#x43E;&#x434;&#x43D;&#x44B; &#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;, &#x442;&#x43E; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x44D;&#x442;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; - &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x433;&#x440;&#x443;&#x437;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43D;&#x43E;&#x432;&#x43E;&#x435; &#x438; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x43E; <a href="index.html">&#x441; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430;</a>. &#x41C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x447;&#x435;&#x441;&#x442;&#x44C; &#x431;&#x435;&#x433;&#x43B;&#x43E;, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x432;&#x44B; &#x443;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x44B; &#x441; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x43C;&#x438; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x438;&#x44F;&#x43C;&#x438;.</p>
</li>
</ol>
<blockquote>
<p>&#x421;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x43D;&#x435;&#x441;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; Vue 1.x &#x43D;&#x430; 2.0?</p>
</blockquote>
<p>&#x42D;&#x442;&#x43E; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x442; &#x43E;&#x442; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x445; &#x444;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x432;:</p>
<ul>
<li><p>&#x420;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; (&#x434;&#x43B;&#x44F; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x438; &#x441;&#x440;&#x435;&#x434;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; - &#x432;&#x435;&#x440;&#x43E;&#x44F;&#x442;&#x43D;&#x43E;, &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x43D;&#x44F;)</p>
</li>
<li><p>&#x41A;&#x430;&#x43A; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x432;&#x44B; &#x43E;&#x442;&#x432;&#x43B;&#x435;&#x43A;&#x430;&#x435;&#x442;&#x435;&#x441;&#x44C; &#x438; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442;&#x435; &#x438;&#x433;&#x440;&#x430;&#x442;&#x44C; &#x441; &#x43D;&#x43E;&#x432;&#x43E;&#x439; &#x437;&#x430;&#x43C;&#x435;&#x447;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x435;&#x439;. &#x1F609; &#xA0;&#x411;&#x435;&#x437; &#x448;&#x443;&#x442;&#x43E;&#x43A;, &#x44D;&#x442;&#x43E; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x438; &#x441; &#x43D;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x435; 2.0!</p>
</li>
<li><p>&#x41A;&#x430;&#x43A;&#x438;&#x435; &#x443;&#x441;&#x442;&#x430;&#x440;&#x435;&#x432;&#x448;&#x438;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x432;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x435;. &#x411;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43E; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43D;&#x430;&#x439;&#x442;&#x438;-&#x438;-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C;, &#x43D;&#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x443;&#x439;&#x442;&#x438; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43C;&#x438;&#x43D;&#x443;&#x442;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x432; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x435;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;&#x435;&#x441;&#x44C; &#x43B;&#x443;&#x447;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x43A;, Vue 2.0 &#x442;&#x430;&#x43A;&#x436;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x442;&#x430;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x441; &#x438;&#x43C; &#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x44C;. &#x42D;&#x442;&#x43E; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E; &#x432; &#x434;&#x43E;&#x43B;&#x433;&#x43E;&#x441;&#x440;&#x43E;&#x447;&#x43D;&#x43E;&#x439; &#x43F;&#x435;&#x440;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x435;, &#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; (&#x445;&#x43E;&#x442;&#x44F;, &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;, &#x438; &#x437;&#x430;&#x43F;&#x43E;&#x437;&#x434;&#x430;&#x43B;&#x44B;&#x439;) &#x440;&#x435;&#x444;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x438;&#x43D;&#x433;.</p>
</li>
</ul>
<blockquote>
<p>&#x415;&#x441;&#x43B;&#x438; &#x44F; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x434;&#x443; &#x43D;&#x430; Vue 2, &#x43F;&#x440;&#x438;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x43B;&#x438; &#x43C;&#x43D;&#x435; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C; Vuex &#x438; Vue Router?</p>
</blockquote>
<p>&#x422;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; Vue Router 2 &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C; &#x441; Vue 2, &#x442;&#x430;&#x43A; &#x447;&#x442;&#x43E; &#x434;&#x430;, &#x432;&#x430;&#x43C; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x440;&#x438;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E; &#x43F;&#x443;&#x442;&#x438; <a href="migration-vue-router.html">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x438; &#x434;&#x43B;&#x44F; Vue Router</a>. &#x41A; &#x441;&#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E;, &#x432; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x43D;&#x435; &#x442;&#x430;&#x43A; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x43C;&#x430;&#x440;&#x448;&#x440;&#x443;&#x442;&#x438;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x44D;&#x442;&#x43E;, &#x441;&#x43A;&#x43E;&#x440;&#x435;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E;, &#x43D;&#x435; &#x437;&#x430;&#x439;&#x43C;&#x451;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x447;&#x430;&#x441;&#x430;.</p>
<p>&#x427;&#x442;&#x43E; &#x43A;&#x430;&#x441;&#x430;&#x435;&#x442;&#x441;&#x44F; Vuex, &#x442;&#x43E; &#x434;&#x430;&#x436;&#x435; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; 0.8 &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x430; &#x441; Vue 2, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x432;&#x44B; &#x43D;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;&#x441;&#x44F;. &#x415;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x430;, &#x43F;&#x43E; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x432;&#x44B;, &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;, &#x437;&#x430;&#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x43D;&#x435;&#x43C;&#x435;&#x434;&#x43B;&#x435;&#x43D;&#x43D;&#x43E; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; - &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x44B;&#x43C;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;&#x43C;&#x438; Vuex 2, &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x43A;&#x430;&#x43A; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x438; &#x438; &#x443;&#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;.</p>
<h2 id="&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;"><a href="#&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;" class="headerlink" title="&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;"></a>&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;</h2><h3 id="&#x424;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435;-&#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x44B;-&#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x44B;"><a href="#&#x424;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435;-&#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x44B;-&#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x44B;" class="headerlink" title="&#x424;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x44B; &#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x44B;"></a>&#x424;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x44B; <sup>&#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x44B;</sup></h3><p>&#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x44C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x434;&#x438;&#x43D; &#x43A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x43E;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;. &#x424;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x44B; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x448; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>foo<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>bar<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>&#x420;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x434;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x431;&#x435;&#x440;&#x43D;&#x443;&#x432; &#x432;&#x441;&#x451; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x435; &#x432; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432;&#x43E;&#x442; &#x442;&#x430;&#x43A;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">div</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>foo<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>bar<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; &#x432;&#x430;&#x448;&#x435; end-to-end &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x438; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44C;&#x442;&#x435; <strong>&#x43F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x438;</strong> &#x43E; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x435; &#x43A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x44B;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x435;.</p>
</div>

<h2 id="&#x425;&#x443;&#x43A;&#x438;-&#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;-&#x446;&#x438;&#x43A;&#x43B;&#x430;"><a href="#&#x425;&#x443;&#x43A;&#x438;-&#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;-&#x446;&#x438;&#x43A;&#x43B;&#x430;" class="headerlink" title="&#x425;&#x443;&#x43A;&#x438; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430;"></a>&#x425;&#x443;&#x43A;&#x438; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430;</h2><h3 id="beforeCompile-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#beforeCompile-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="beforeCompile &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>beforeCompile</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>&#x412;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; <code>created</code> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x435;.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x445;&#x443;&#x43A;&#x430;.</p>
</div>

<h3 id="compiled-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#compiled-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="compiled &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>compiled</code> <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>&#x412;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x445;&#x443;&#x43A; <code>mounted</code>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x445;&#x443;&#x43A;&#x430;.</p>
</div>

<h3 id="attached-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#attached-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="attached &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>attached</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x443;&#x44E; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x443; DOM &#x432; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x445;&#x443;&#x43A;&#x430;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C;:</p>
<pre><code class="hljs js">attached: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
  doSomething()
}</code></pre>
<p>&#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;:</p>
<pre><code class="hljs js">mounted: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">this</span>.$nextTick(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    doSomething()
  })
}</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x445;&#x443;&#x43A;&#x430;.</p>
</div>

<h3 id="detached-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#detached-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="detached &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>detached</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x443;&#x44E; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x443; DOM &#x432; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x445;&#x443;&#x43A;&#x430;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C;:</p>
<pre><code class="hljs js">detached: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
  doSomething()
}</code></pre>
<p>&#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;:</p>
<pre><code class="hljs js">destroyed: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">this</span>.$nextTick(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    doSomething()
  })
}</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x445;&#x443;&#x43A;&#x430;.</p>
</div>

<h3 id="init-&#x43F;&#x435;&#x440;&#x435;&#x438;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;"><a href="#init-&#x43F;&#x435;&#x440;&#x435;&#x438;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;" class="headerlink" title="init &#x43F;&#x435;&#x440;&#x435;&#x438;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;"></a><code>init</code> <sup>&#x43F;&#x435;&#x440;&#x435;&#x438;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;</sup></h3><p>&#x412;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x445;&#x443;&#x43A; <code>beforeCreate</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43D;&#x438;&#x447;&#x435;&#x43C; &#x43D;&#x435; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F;. &#x414;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x445;&#x443;&#x43A; &#x431;&#x44B;&#x43B; &#x43F;&#x435;&#x440;&#x435;&#x438;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D; &#x434;&#x43B;&#x44F; &#x43B;&#x43E;&#x433;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x439; &#x432;&#x437;&#x430;&#x438;&#x43C;&#x43E;&#x441;&#x432;&#x44F;&#x437;&#x438; &#x441; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430;.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x445;&#x443;&#x43A;&#x430;.</p>
</div>

<h3 id="ready-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#ready-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="ready &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>ready</code> <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>&#x412;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x445;&#x443;&#x43A; <code>mounted</code>. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;, &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x43E;&#x442;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x445;&#x443;&#x43A;&#x430; <code>mounted</code> &#x43D;&#x435; &#x434;&#x430;&#x451;&#x442; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x438;&#x438; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x435;. &#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; <code>Vue.nextTick</code>/<code>vm.$nextTick</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p>
<pre><code class="hljs js">mounted: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">this</span>.$nextTick(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-comment">// &#x43A;&#x43E;&#x434;, &#x443;&#x436;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x44E;&#x449;&#x438;&#x439; &#x43D;&#x430;&#x43B;&#x438;&#x447;&#x438;&#x435; this.$el &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x435;</span>
  })
}</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x445;&#x443;&#x43A;&#x430;.</p>
</div>

<h2 id="v-for"><a href="#v-for" class="headerlink" title="v-for"></a><code>v-for</code></h2><h3 id="&#x41E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C;-&#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;-&#x434;&#x43B;&#x44F;-&#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43E;&#x432;-&#x432;-v-for-&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"><a href="#&#x41E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C;-&#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;-&#x434;&#x43B;&#x44F;-&#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43E;&#x432;-&#x432;-v-for-&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;" class="headerlink" title="&#x41E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43E;&#x432; &#x432; v-for &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"></a>&#x41E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43E;&#x432; &#x432; <code>v-for</code> <sup>&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;</sup></h3><p>&#x41F;&#x440;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; <code>index</code> &#x43E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43E;&#x432; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x435;&#x43B;&#x430; &#x442;&#x430;&#x43A; <code>(index, value)</code>. &#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43E;&#x43D;&#x430; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x432;&#x438;&#x434; <code>(value, index)</code>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x432;&#x43E;&#x440;&#x435;&#x447;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43E;&#x432; JavaScript, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43A;&#x430;&#x43A; <code>forEach</code> &#x438; <code>map</code>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x443;&#x441;&#x442;&#x430;&#x440;&#x435;&#x432;&#x448;&#x438;&#x445; &#x43E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x41E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;: &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x434;&#x430;&#x43B;&#x438; &#x43D;&#x435;&#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x435; &#x43D;&#x430;&#x438;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x438;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x43A;&#x430;&#x43A;  <code>position</code> &#x438;&#x43B;&#x438; <code>num</code>, &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A; &#x43D;&#x435; &#x432;&#x44B;&#x434;&#x435;&#x43B;&#x438;&#x442; &#x438;&#x445;.</p>
</div>

<h3 id="&#x41E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C;-&#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;-&#x434;&#x43B;&#x44F;-&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432;-&#x432;-v-for-&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"><a href="#&#x41E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C;-&#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;-&#x434;&#x43B;&#x44F;-&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432;-&#x432;-v-for-&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;" class="headerlink" title="&#x41E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432; &#x432; v-for &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"></a>&#x41E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432; &#x432; <code>v-for</code> <sup>&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;</sup></h3><p>&#x41F;&#x440;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x438;&#x43C;&#x435;&#x43D;&#x438; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;/&#x43A;&#x43B;&#x44E;&#x447;&#x430; &#x43E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x435;&#x43B;&#x430; &#x442;&#x430;&#x43A; <code>(name, value)</code>. &#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43E;&#x43D;&#x430; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x432;&#x438;&#x434; <code>(value, name)</code>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x432;&#x43E;&#x440;&#x435;&#x447;&#x438;&#x442;&#x44C; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x451;&#x43D;&#x43D;&#x44B;&#x43C; &#x438;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x430;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43A;&#x430;&#x43A; lodash.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x443;&#x441;&#x442;&#x430;&#x440;&#x435;&#x432;&#x448;&#x438;&#x445; &#x43E;&#x447;&#x435;&#x440;&#x451;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x41E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;: &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x434;&#x430;&#x43B;&#x438; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43A;&#x43B;&#x44E;&#x447;&#x443; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x43A;&#x430;&#x43A; <code>name</code> &#x438;&#x43B;&#x438; <code>property</code>, &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A; &#x43D;&#x435; &#x432;&#x44B;&#x434;&#x435;&#x43B;&#x438;&#x442; &#x438;&#x445;.</p>
</div>

<h3 id="index-&#x438;-key-&#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x44B;"><a href="#index-&#x438;-key-&#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x44B;" class="headerlink" title="$index &#x438; $key &#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x44B;"></a><code>$index</code> &#x438; <code>$key</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x44B;</sup></h3><p>&#x41D;&#x435;&#x44F;&#x432;&#x43D;&#x43E; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x435; <code>$index</code> &#x438; <code>$key</code> &#x431;&#x44B;&#x43B;&#x438; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x44B; &#x43D;&#x430; &#x44F;&#x432;&#x43D;&#x43E; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x435; &#x432; <code>v-for</code>. &#x42D;&#x442;&#x43E; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43A;&#x43E;&#x434;&#x443; &#x431;&#x44B;&#x442;&#x44C; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x447;&#x438;&#x442;&#x430;&#x435;&#x43C;&#x44B;&#x43C; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x43E;&#x43F;&#x44B;&#x442;&#x43D;&#x44B; &#x432;&#x43E; Vue, &#x438; &#x43A; &#x442;&#x43E;&#x43C;&#x443; &#x436;&#x435; &#x43A;&#x430;&#x43A; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442; &#x43A; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44E; &#x43F;&#x440;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x435; &#x441; &#x432;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x43C;&#x438;.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x44D;&#x442;&#x438;&#x445; &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43B;&#x438; &#x43A;&#x430;&#x43A;&#x443;&#x44E;-&#x442;&#x43E;, &#x442;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C; <strong>&#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x438;</strong>, &#x442;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x430;&#x43A;: <code>Uncaught ReferenceError: $index is not defined</code></p>
</div>

<h3 id="track-by-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#track-by-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="track-by &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>track-by</code> <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p><code>track-by</code> &#x431;&#x44B;&#x43B; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D; &#x43D;&#x430; <code>key</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43A;&#x430;&#x43A; &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;: &#x431;&#x435;&#x437; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; <code>v-bind:</code> &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x435;&#x444;&#x438;&#x43A;&#x441;&#x430; <code>:</code> &#x43E;&#x43D; &#x432;&#x43E;&#x441;&#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x431;&#x443;&#x43A;&#x432;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x430;. &#x412; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435; &#x436;&#x435; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x432; &#x432;&#x430;&#x43C; &#x437;&#x430;&#x445;&#x43E;&#x447;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x438;&#x447;&#x43D;&#x443;&#x44E; &#x43F;&#x440;&#x438;&#x432;&#x44F;&#x437;&#x43A;&#x443;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x430; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43A;&#x43B;&#x44E;&#x447;&#x430;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">div</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;item in items&quot;</span> <span class="hljs-attr">track-by</span>=<span class="hljs-string">&quot;id&quot;</span>&gt;</span></code></pre>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">div</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;item in items&quot;</span> <span class="hljs-attr">v-bind:key</span>=<span class="hljs-string">&quot;item.id&quot;</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;&#x430;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; <code>track-by</code>.</p>
</div>

<h3 id="&#x414;&#x438;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D;-&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439;-&#x432;-v-for-&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"><a href="#&#x414;&#x438;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D;-&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439;-&#x432;-v-for-&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;" class="headerlink" title="&#x414;&#x438;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439;  &#x432; v-for &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"></a>&#x414;&#x438;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439;  &#x432; <code>v-for</code> <sup>&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;</sup></h3><p>&#x420;&#x430;&#x43D;&#x44C;&#x448;&#x435; &#x432; <code>v-for=&quot;number in 10&quot;</code> &#x43C;&#x44B; &#x438;&#x43C;&#x435;&#x43B;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; <code>number</code>, &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44F; &#x43E;&#x442; 0 &#x438; &#x437;&#x430;&#x43A;&#x430;&#x43D;&#x447;&#x438;&#x432;&#x430;&#x44F; 9. &#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x44D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441; 1 &#x438; &#x437;&#x430;&#x43A;&#x430;&#x43D;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; 10.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x421;&#x434;&#x435;&#x43B;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x438;&#x441;&#x43A; &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43A;&#x43E;&#x434;&#x435; &#x43D;&#x430; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x435; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x435; <code>/\w+ in \d+/</code>. &#x412;&#x435;&#x437;&#x434;&#x435;, &#x433;&#x434;&#x435; &#x43D;&#x430;&#x439;&#x434;&#x451;&#x442;&#x441;&#x44F; <code>v-for</code>, &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44C;&#x442;&#x435;, &#x437;&#x430;&#x442;&#x440;&#x43E;&#x43D;&#x443;&#x43B;&#x43E; &#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x432;&#x430;&#x448; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;.</p>
</div>

<h2 id="Props"><a href="#Props" class="headerlink" title="Props"></a>Props</h2><h3 id="coerce-Prop-Option-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#coerce-Prop-Option-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="coerce Prop Option &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>coerce</code> Prop Option <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>If you want to coerce a prop, setup a local computed value based on it instead. For example, instead of:</p>
<pre><code class="hljs js">props: {
  <span class="hljs-attr">username</span>: {
    <span class="hljs-attr">type</span>: <span class="hljs-built_in">String</span>,
    <span class="hljs-attr">coerce</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">value</span>) </span>{
      <span class="hljs-keyword">return</span> value
        .toLowerCase()
        .replace(<span class="hljs-regexp">/\s+/</span>, <span class="hljs-string">&apos;-&apos;</span>)
    }
  }
}</code></pre>
<p>You could write:</p>
<pre><code class="hljs js">props: {
  <span class="hljs-attr">username</span>: <span class="hljs-built_in">String</span>,
},
<span class="hljs-attr">computed</span>: {
  <span class="hljs-attr">normalizedUsername</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.username
      .toLowerCase()
      .replace(<span class="hljs-regexp">/\s+/</span>, <span class="hljs-string">&apos;-&apos;</span>)
  }
}</code></pre>
<p>There are a few advantages:</p>
<ul>
<li>You still have access to the original value of the prop.</li>
<li>You are forced to be more explicit, by giving your coerced value a name that differentiates it from the value passed in the prop.</li>
</ul>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the <code>coerce</code> option.</p>
</div>

<h3 id="twoWay-Prop-Option-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#twoWay-Prop-Option-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="twoWay Prop Option &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>twoWay</code> Prop Option <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Props are now always one-way down. To produce side effects in the parent scope, a component needs to explicitly emit an event instead of relying on implicit binding. For more information, see:</p>
<ul>
<li><a href="components.html#Custom-Events">Custom component events</a></li>
<li><a href="components.html#Form-Input-Components-using-Custom-Events">Custom input components</a> (using component events)</li>
<li><a href="state-management.html">Global state management</a></li>
</ul>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the <code>twoWay</code> option.</p>
</div>

<h3 id="once-and-sync-Modifiers-on-v-bind-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#once-and-sync-Modifiers-on-v-bind-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title=".once and .sync Modifiers on v-bind &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>.once</code> and <code>.sync</code> Modifiers on <code>v-bind</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Props are now always one-way down. To produce side effects in the parent scope, a component needs to explicitly emit an event instead of relying on implicit binding. For more information, see:</p>
<ul>
<li><a href="components.html#Custom-Events">Custom component events</a></li>
<li><a href="components.html#Form-Input-Components-using-Custom-Events">Custom input components</a> (using component events)</li>
<li><a href="state-management.html">Global state management</a></li>
</ul>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the <code>.once</code> and <code>.sync</code> modifiers.</p>
</div>

<h3 id="Prop-Mutation-deprecated"><a href="#Prop-Mutation-deprecated" class="headerlink" title="Prop Mutation deprecated"></a>Prop Mutation <sup>deprecated</sup></h3><p>Mutating a prop locally is now considered an anti-pattern, e.g. declaring a prop and then setting <code>this.myProp = &apos;someOtherValue&apos;</code> in the component. Due to the new rendering mechanism, whenever the parent component re-renders, the child component&#x2019;s local changes will be overwritten.</p>
<p>Most use cases of mutating a prop can be replaced by one of these options:</p>
<ul>
<li>a data property, with the prop used to set its default value</li>
<li>a computed property</li>
</ul>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>Run your end-to-end test suite or app after upgrading and look for <strong>console warnings</strong> about prop mutations.</p>
</div>

<h3 id="Props-on-a-Root-Instance-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#Props-on-a-Root-Instance-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="Props on a Root Instance &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a>Props on a Root Instance <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>On root Vue instances (i.e. instances created with <code>new Vue({ ... })</code>), you must use <code>propsData</code> instead of <code>props</code>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>Run your end-to-end test suite, if you have one. The <strong>failed tests</strong> should alert to you to the fact that props passed to root instances are no longer working.</p>
</div>

<h2 id="Computed-properties"><a href="#Computed-properties" class="headerlink" title="Computed properties"></a>Computed properties</h2><h3 id="cache-false-deprecated"><a href="#cache-false-deprecated" class="headerlink" title="cache: false deprecated"></a><code>cache: false</code> <sup>deprecated</sup></h3><p>Caching invalidation of computed properties will be removed in future major versions of Vue. Replace any uncached computed properties with methods, which will have the same result.</p>
<p>For example:</p>
<pre><code class="hljs js">template: <span class="hljs-string">&apos;&lt;p&gt;message: {{ timeMessage }}&lt;/p&gt;&apos;</span>,
<span class="hljs-attr">computed</span>: {
  <span class="hljs-attr">timeMessage</span>: {
    <span class="hljs-attr">cache</span>: <span class="hljs-literal">false</span>,
    <span class="hljs-attr">get</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
      <span class="hljs-keyword">return</span> <span class="hljs-built_in">Date</span>.now() + <span class="hljs-keyword">this</span>.message
    }
  }
}</code></pre>
<p>Or with component methods:</p>
<pre><code class="hljs js">template: <span class="hljs-string">&apos;&lt;p&gt;message: {{ getTimeMessage() }}&lt;/p&gt;&apos;</span>,
<span class="hljs-attr">methods</span>: {
  <span class="hljs-attr">getTimeMessage</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-built_in">Date</span>.now() + <span class="hljs-keyword">this</span>.message
  }
}</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the <code>cache: false</code> option.</p>
</div>

<h2 id="Built-In-Directives"><a href="#Built-In-Directives" class="headerlink" title="Built-In Directives"></a>Built-In Directives</h2><h3 id="Truthiness-Falsiness-with-v-bind-changed"><a href="#Truthiness-Falsiness-with-v-bind-changed" class="headerlink" title="Truthiness/Falsiness with v-bind changed"></a>Truthiness/Falsiness with <code>v-bind</code> <sup>changed</sup></h3><p>When used with <code>v-bind</code>, the only falsy values are now: <code>null</code>, <code>undefined</code>, and <code>false</code>. This means <code>0</code> and empty strings will render as truthy. So for example, <code>v-bind:draggable=&quot;&apos;&apos;&quot;</code> will render as <code>draggable=&quot;true&quot;</code>.</p>
<p>For enumerated attributes, in addition to the falsy values above, the string <code>&quot;false&quot;</code> will also render as <code>attr=&quot;false&quot;</code>.</p>
<p class="tip">Note that for other directives (e.g. <code>v-if</code> and <code>v-show</code>), JavaScript&#x2019;s normal truthiness still applies.</p>


<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>Run your end-to-end test suite, if you have one. The <strong>failed tests</strong> should alert to you to any parts of your app that may be affected by this change.</p>
</div>

<h3 id="Listening-for-Native-Events-on-Components-with-v-on-changed"><a href="#Listening-for-Native-Events-on-Components-with-v-on-changed" class="headerlink" title="Listening for Native Events on Components with v-on changed"></a>Listening for Native Events on Components with <code>v-on</code> <sup>changed</sup></h3><p>When used on a component, <code>v-on</code> now only listens to custom events <code>$emit</code>ted by that component. To listen for a native DOM event on the root element, you can use the <code>.native</code> modifier. For example:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">my-component</span> <span class="hljs-attr">v-on:click.native</span>=<span class="hljs-string">&quot;doSomething&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">my-component</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>Run your end-to-end test suite, if you have one. The <strong>failed tests</strong> should alert to you to any parts of your app that may be affected by this change.</p>
</div>

<h3 id="debounce-Param-Attribute-for-v-model-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#debounce-Param-Attribute-for-v-model-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="debounce Param Attribute for v-model &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>debounce</code> Param Attribute for <code>v-model</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Debouncing is used to limit how often we execute Ajax requests and other expensive operations. Vue&#x2019;s <code>debounce</code> attribute parameter for <code>v-model</code> made this easy for very simple cases, but it actually debounced <strong>state updates</strong> rather than the expensive operations themselves. It&#x2019;s a subtle difference, but it comes with limitations as an application grows.</p>
<p>These limitations become apparent when designing a search indicator, like this one for example:</p>

<script src="https://cdn.jsdelivr.net/lodash/4.13.1/lodash.js"></script>
<div id="debounce-search-demo" class="demo">
  <input v-model="searchQuery" placeholder="Type something">
  <strong>{{ searchIndicator }}</strong>
</div>
<script>
new Vue({
  el: '#debounce-search-demo',
  data: {
    searchQuery: '',
    searchQueryIsDirty: false,
    isCalculating: false
  },
  computed: {
    searchIndicator: function () {
      if (this.isCalculating) {
        return '⟳ Fetching new results'
      } else if (this.searchQueryIsDirty) {
        return '... Typing'
      } else {
        return '✓ Done'
      }
    }
  },
  watch: {
    searchQuery: function () {
      this.searchQueryIsDirty = true
      this.expensiveOperation()
    }
  },
  methods: {
    expensiveOperation: _.debounce(function () {
      this.isCalculating = true
      setTimeout(function () {
        this.isCalculating = false
        this.searchQueryIsDirty = false
      }.bind(this), 1000)
    }, 500)
  }
})
</script>

<p>Using the <code>debounce</code> attribute, there&#x2019;d be no way to detect the &#x201C;Typing&#x201D; state, because we lose access to the input&#x2019;s real-time state. By decoupling the debounce function from Vue however, we&#x2019;re able to debounce only the operation we want to limit, removing the limits on features we can develop:</p>
<pre><code class="hljs html"><span class="hljs-comment">&lt;!--
By using the debounce function from lodash or another dedicated
utility library, we know the specific debounce implementation we
use will be best-in-class - and we can use it ANYWHERE. Not only
in our template.
--&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;https://cdn.jsdelivr.net/lodash/4.13.1/lodash.js&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">div</span> <span class="hljs-attr">id</span>=<span class="hljs-string">&quot;debounce-search-demo&quot;</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-model</span>=<span class="hljs-string">&quot;searchQuery&quot;</span> <span class="hljs-attr">placeholder</span>=<span class="hljs-string">&quot;Type something&quot;</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">strong</span>&gt;</span>{{ searchIndicator }}<span class="hljs-tag">&lt;/<span class="hljs-name">strong</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span></code></pre>
<pre><code class="hljs js"><span class="hljs-keyword">new</span> Vue({
  <span class="hljs-attr">el</span>: <span class="hljs-string">&apos;#debounce-search-demo&apos;</span>,
  <span class="hljs-attr">data</span>: {
    <span class="hljs-attr">searchQuery</span>: <span class="hljs-string">&apos;&apos;</span>,
    <span class="hljs-attr">searchQueryIsDirty</span>: <span class="hljs-literal">false</span>,
    <span class="hljs-attr">isCalculating</span>: <span class="hljs-literal">false</span>
  },
  <span class="hljs-attr">computed</span>: {
    <span class="hljs-attr">searchIndicator</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
      <span class="hljs-keyword">if</span> (<span class="hljs-keyword">this</span>.isCalculating) {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&apos;&#x27F3; Fetching new results&apos;</span>
      } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (<span class="hljs-keyword">this</span>.searchQueryIsDirty) {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&apos;... Typing&apos;</span>
      } <span class="hljs-keyword">else</span> {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&apos;&#x2713; Done&apos;</span>
      }
    }
  },
  <span class="hljs-attr">watch</span>: {
    <span class="hljs-attr">searchQuery</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
      <span class="hljs-keyword">this</span>.searchQueryIsDirty = <span class="hljs-literal">true</span>
      <span class="hljs-keyword">this</span>.expensiveOperation()
    }
  },
  <span class="hljs-attr">methods</span>: {
    <span class="hljs-comment">// This is where the debounce actually belongs.</span>
    expensiveOperation: _.debounce(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
      <span class="hljs-keyword">this</span>.isCalculating = <span class="hljs-literal">true</span>
      setTimeout(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
        <span class="hljs-keyword">this</span>.isCalculating = <span class="hljs-literal">false</span>
        <span class="hljs-keyword">this</span>.searchQueryIsDirty = <span class="hljs-literal">false</span>
      }.bind(<span class="hljs-keyword">this</span>), <span class="hljs-number">1000</span>)
    }, <span class="hljs-number">500</span>)
  }
})</code></pre>
<p>Another advantage of this approach is there will be times when debouncing isn&#x2019;t quite the right wrapper function. For example, when hitting an API for search suggestions, waiting to offer suggestions until after the user has stopped typing for a period of time isn&#x2019;t an ideal experience. What you probably want instead is a <strong>throttling</strong> function. Now since you&#x2019;re already using a utility library like lodash, refactoring to use its <code>throttle</code> function instead takes only a few seconds.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the <code>debounce</code> attribute.</p>
</div>

<h3 id="lazy-or-number-Param-Attributes-for-v-model-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#lazy-or-number-Param-Attributes-for-v-model-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="lazy or number Param Attributes for v-model &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>lazy</code> or <code>number</code> Param Attributes for <code>v-model</code> <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>The <code>lazy</code> and <code>number</code> param attributes are now modifiers, to make it more clear what That means instead of:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-model</span>=<span class="hljs-string">&quot;name&quot;</span> <span class="hljs-attr">lazy</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-model</span>=<span class="hljs-string">&quot;age&quot;</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;number&quot;</span> <span class="hljs-attr">number</span>&gt;</span></code></pre>
<p>You would use:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-model.lazy</span>=<span class="hljs-string">&quot;name&quot;</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-model.number</span>=<span class="hljs-string">&quot;age&quot;</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;number&quot;</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the these param attributes.</p>
</div>

<h3 id="value-Attribute-with-v-model-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#value-Attribute-with-v-model-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="value Attribute with v-model &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>value</code> Attribute with <code>v-model</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p><code>v-model</code> no longer cares about the initial value of an inline <code>value</code> attribute. For predictability, it will instead always treat the Vue instance data as the source of truth.</p>
<p>That means this element:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-model</span>=<span class="hljs-string">&quot;text&quot;</span> <span class="hljs-attr">value</span>=<span class="hljs-string">&quot;foo&quot;</span>&gt;</span></code></pre>
<p>backed by this data:</p>
<pre><code class="hljs js">data: {
  <span class="hljs-attr">text</span>: <span class="hljs-string">&apos;bar&apos;</span>
}</code></pre>
<p>will render with a value of &#x201C;bar&#x201D; instead of &#x201C;foo&#x201D;. The same goes for a <code>&lt;textarea&gt;</code> with existing content. Instead of:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">textarea</span> <span class="hljs-attr">v-model</span>=<span class="hljs-string">&quot;text&quot;</span>&gt;</span>
  hello world
<span class="hljs-tag">&lt;/<span class="hljs-name">textarea</span>&gt;</span></code></pre>
<p>You should ensure your initial value for <code>text</code> is &#x201C;hello world&#x201D;.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>Run your end-to-end test suite or app after upgrading and look for <strong>console warnings</strong> about inline value attributes with <code>v-model</code>.</p>
</div>

<h3 id="v-model-with-v-for-Iterated-Primitive-Values-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#v-model-with-v-for-Iterated-Primitive-Values-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="v-model with v-for Iterated Primitive Values &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>v-model</code> with <code>v-for</code> Iterated Primitive Values <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Cases like this no longer work:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;str in strings&quot;</span> <span class="hljs-attr">v-model</span>=<span class="hljs-string">&quot;str&quot;</span>&gt;</span></code></pre>
<p>The reason is this is the equivalent JavaScript that the <code>&lt;input&gt;</code> would compile to:</p>
<pre><code class="hljs js">strings.map(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">str</span>) </span>{
  <span class="hljs-keyword">return</span> createElement(<span class="hljs-string">&apos;input&apos;</span>, ...)
})</code></pre>
<p>As you can see, <code>v-model</code>&#x2018;s two-way binding doesn&#x2019;t make sense here. Setting <code>str</code> to another value in the iterator function will do nothing because it&#x2019;s only a local variable in the function scope.</p>
<p>Instead, you should use an array of <strong>objects</strong> so that <code>v-model</code> can update the field on the object. For example:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;obj in objects&quot;</span> <span class="hljs-attr">v-model</span>=<span class="hljs-string">&quot;obj.str&quot;</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>Run your test suite, if you have one. The <strong>failed tests</strong> should alert to you to any parts of your app that may be affected by this change.</p>
</div>

<h3 id="v-bind-style-with-Object-Syntax-and-important-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#v-bind-style-with-Object-Syntax-and-important-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="v-bind:style with Object Syntax and !important &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>v-bind:style</code> with Object Syntax and <code>!important</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>This will no longer work:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-bind:style</span>=<span class="hljs-string">&quot;{ color: myColor + &apos; !important&apos; }&quot;</span>&gt;</span>hello<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>If you really need to override another <code>!important</code>, you must use the string syntax:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-bind:style</span>=<span class="hljs-string">&quot;&apos;color: &apos; + myColor + &apos; !important&apos;&quot;</span>&gt;</span>hello<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of style bindings with <code>!important</code> in objects.</p>
</div>

<h3 id="v-el-and-v-ref-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#v-el-and-v-ref-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="v-el and v-ref &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>v-el</code> and <code>v-ref</code> <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>For simplicity, <code>v-el</code> and <code>v-ref</code> have been merged into the <code>ref</code> attribute, accessible on a component instance via <code>$refs</code>. That means <code>v-el:my-element</code> would become <code>ref=&quot;myElement&quot;</code> and <code>v-ref:my-component</code> would become <code>ref=&quot;myComponent&quot;</code>. When used on a normal element, the <code>ref</code> will be the DOM element, and when used on a component, the <code>ref</code> will be the component instance.</p>
<p>Since <code>v-ref</code> is no longer a directive, but a special attribute, it can also be dynamically defined. This is especially useful in combination with <code>v-for</code>. For example:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;item in items&quot;</span> <span class="hljs-attr">v-bind:ref</span>=<span class="hljs-string">&quot;&apos;item&apos; + item.id&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>Previously, <code>v-el</code>/<code>v-ref</code> combined with <code>v-for</code> would produce an array of elements/components, because there was no way to give each item a unique name. You can still achieve this behavior by given each item the same <code>ref</code>:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;item in items&quot;</span> <span class="hljs-attr">ref</span>=<span class="hljs-string">&quot;items&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>Unlike in 1.x, these <code>$refs</code> are not reactive, because they&#x2019;re registered/updated during the render process itself. Making them reactive would require duplicate renders for every change.</p>
<p>On the other hand, <code>$refs</code> are designed primarily for programmatic access in JavaScript - it is not recommended to rely on them in templates, because that would mean referring to state that does not belong to the instance itself. This would violate Vue&#x2019;s data-driven view model.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>v-el</code> and <code>v-ref</code>.</p>
</div>

<h3 id="v-else-with-v-show-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#v-else-with-v-show-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="v-else with v-show &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>v-else</code> with <code>v-show</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p><code>v-else</code> no longer works with <code>v-show</code>. Use <code>v-if</code> with a negation expression instead. For example, instead of:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;foo&quot;</span>&gt;</span>Foo<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-else</span> <span class="hljs-attr">v-show</span>=<span class="hljs-string">&quot;bar&quot;</span>&gt;</span>Not foo, but bar<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>You can use:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;foo&quot;</span>&gt;</span>Foo<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;!foo &amp;&amp; bar&quot;</span>&gt;</span>Not foo, but bar<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the <code>v-else</code> with <code>v-show</code>.</p>
</div>

<h2 id="&#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x435;-&#x414;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B;-&#x443;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x44B;"><a href="#&#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x435;-&#x414;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B;-&#x443;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x44B;" class="headerlink" title="&#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x435; &#x414;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; &#x443;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x44B;"></a>&#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x435; &#x414;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; <sup>&#x443;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x44B;<sup></sup></sup></h2><p>Directives have a greatly reduced scope of responsibility: they are now only used for applying low-level direct DOM manipulations. In most cases, you should prefer using components as the main code-reuse abstraction.</p>
<p>Some of the most notable differences include:</p>
<ul>
<li>Directives no longer have instances. This means there&#x2019;s no more <code>this</code> inside directive hooks. Instead, they receive everything they might need as arguments. If you really must persist state across hooks, you can do so on <code>el</code>.</li>
<li>Options such as <code>acceptStatement</code>, <code>deep</code>, <code>priority</code>, etc have all been removed. To replace <code>twoWay</code> directives, see <a href="#Two-Way-Filters-replaced">this example</a>.</li>
<li>Some of the current hooks have different behavior and there are also a couple new hooks.</li>
</ul>
<p>Fortunately, since the new directives are much simpler, you can master them more easily. Read the new <a href="custom-directive.html">Custom Directives guide</a> to learn more.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of defined directives. The helper will flag all of them, as it&apos;s likely in most cases that you&apos;ll want to refactor to a component.</p>
</div>

<h3 id="Directive-literal-Modifier-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Directive-literal-Modifier-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Directive .literal Modifier &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a>Directive <code>.literal</code> Modifier <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>The <code>.literal</code> modifier has been removed, as the same can be easily achieved by providing a string literal as the value.</p>
<p>For example, you can update:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-my-directive.literal</span>=<span class="hljs-string">&quot;foo bar baz&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>to:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-my-directive</span>=<span class="hljs-string">&quot;&apos;foo bar baz&apos;&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the `.literal` modifier on a directive.</p>
</div>

<h2 id="Transitions"><a href="#Transitions" class="headerlink" title="Transitions"></a>Transitions</h2><h3 id="transition-Attribute-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#transition-Attribute-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="transition Attribute &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>transition</code> Attribute <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>Vue&#x2019;s transition system has changed quite drastically and now uses <code>&lt;transition&gt;</code> and <code>&lt;transition-group&gt;</code> wrapper elements, rather than the <code>transition</code> attribute. It&#x2019;s recommended to read the new <a href="transitions.html">Transitions guide</a> to learn more.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the <code>transition</code> attribute.</p>
</div>

<h3 id="Vue-transition-for-Reusable-Transitions-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#Vue-transition-for-Reusable-Transitions-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="Vue.transition for Reusable Transitions &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>Vue.transition</code> for Reusable Transitions <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>With the new transition system, you can now <a href="transitions.html#Reusable-Transitions">use components for reusable transitions</a>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>Vue.transition</code>.</p>
</div>

<h3 id="Transition-stagger-Attribute-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Transition-stagger-Attribute-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Transition stagger Attribute &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a>Transition <code>stagger</code> Attribute <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>If you need to stagger list transitions, you can control timing by setting and accessing a <code>data-index</code> (or similar attribute) on an element. See <a href="transitions.html#Staggering-List-Transitions">an example here</a>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the <code>transition</code> attribute. During your update, you can transition (pun very much intended) to the new staggering strategy as well.</p>
</div>

<h2 id="Events"><a href="#Events" class="headerlink" title="Events"></a>Events</h2><h3 id="events-option-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#events-option-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="events option &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>events</code> option <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>The <code>events</code> option has been removed. Event handlers should now be registered in the <code>created</code> hook instead. Check out the <a href="#dispatch-and-broadcast-replaced"><code>$dispatch</code> and <code>$broadcast</code> migration guide</a> for a detailed example.</p>
<h3 id="Vue-directive-39-on-39-keyCodes-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#Vue-directive-39-on-39-keyCodes-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="Vue.directive(&apos;on&apos;).keyCodes &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>Vue.directive(&apos;on&apos;).keyCodes</code> <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>The new, more concise way to configure <code>keyCodes</code> is through <code>Vue.config.keyCodes</code>. For example:</p>
<pre><code class="hljs js"><span class="hljs-comment">// enable v-on:keyup.f1</span>
Vue.config.keyCodes.f1 = <span class="hljs-number">112</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the the old <code>keyCode</code> configuration syntax.</p>
</div>

<h3 id="dispatch-and-broadcast-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#dispatch-and-broadcast-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="$dispatch and $broadcast &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>$dispatch</code> and <code>$broadcast</code> <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p><code>$dispatch</code> and <code>$broadcast</code> have been removed in favor of more explicitly cross-component communication and more maintainable state management solutions, such as <a href="https://github.com/vuejs/vuex" target="_blank" rel="noopener">Vuex</a>.</p>
<p>The problem is event flows that depend on a component&#x2019;s tree structure can be hard to reason about and are very brittle when the tree becomes large. They don&#x2019;t scale well and only set you up for pain later. <code>$dispatch</code> and <code>$broadcast</code> also do not solve communication between sibling components.</p>
<p>One of the most common uses for these methods is to communicate between a parent and its direct children. In these cases, you can actually <a href="components.html#Form-Input-Components-using-Custom-Events">listen to an <code>$emit</code> from a child with <code>v-on</code></a>. This allows you to keep the convenience of events with added explicitness.</p>
<p>However, when communicating between distant descendants/ancestors, <code>$emit</code> won&#x2019;t help you. Instead, the simplest possible upgrade would be to use a centralized event hub. This has the added benefit of allowing you to communicate between components no matter where they are in the component tree - even between siblings! Because Vue instances implement an event emitter interface, you can actually use an empty Vue instance for this purpose.</p>
<p>For example, let&#x2019;s say we have a todo app structured like this:</p>
<pre><code class="hljs undefined">Todos
&#x251C;&#x2500; NewTodoInput
&#x2514;&#x2500; Todo
   &#x2514;&#x2500; DeleteTodoButton</code></pre>
<p>We could manage communication between components with this single event hub:</p>
<pre><code class="hljs js"><span class="hljs-comment">// This is the event hub we&apos;ll use in every</span>
<span class="hljs-comment">// component to communicate between them.</span>
<span class="hljs-keyword">var</span> eventHub = <span class="hljs-keyword">new</span> Vue()</code></pre>
<p>Then in our components, we can use <code>$emit</code>, <code>$on</code>, <code>$off</code> to emit events, listen for events, and clean up event listeners, respectively:</p>
<pre><code class="hljs js"><span class="hljs-comment">// NewTodoInput</span>
<span class="hljs-comment">// ...</span>
methods: {
  <span class="hljs-attr">addTodo</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    eventHub.$emit(<span class="hljs-string">&apos;add-todo&apos;</span>, { <span class="hljs-attr">text</span>: <span class="hljs-keyword">this</span>.newTodoText })
    <span class="hljs-keyword">this</span>.newTodoText = <span class="hljs-string">&apos;&apos;</span>
  }
}</code></pre>
<pre><code class="hljs js"><span class="hljs-comment">// DeleteTodoButton</span>
<span class="hljs-comment">// ...</span>
methods: {
  <span class="hljs-attr">deleteTodo</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">id</span>) </span>{
    eventHub.$emit(<span class="hljs-string">&apos;delete-todo&apos;</span>, id)
  }
}</code></pre>
<pre><code class="hljs js"><span class="hljs-comment">// Todos</span>
<span class="hljs-comment">// ...</span>
created: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
  eventHub.$on(<span class="hljs-string">&apos;add-todo&apos;</span>, <span class="hljs-keyword">this</span>.addTodo)
  eventHub.$on(<span class="hljs-string">&apos;delete-todo&apos;</span>, <span class="hljs-keyword">this</span>.deleteTodo)
},
<span class="hljs-comment">// It&apos;s good to clean up event listeners before</span>
<span class="hljs-comment">// a component is destroyed.</span>
beforeDestroy: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
  eventHub.$off(<span class="hljs-string">&apos;add-todo&apos;</span>, <span class="hljs-keyword">this</span>.addTodo)
  eventHub.$off(<span class="hljs-string">&apos;delete-todo&apos;</span>, <span class="hljs-keyword">this</span>.deleteTodo)
},
<span class="hljs-attr">methods</span>: {
  <span class="hljs-attr">addTodo</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">newTodo</span>) </span>{
    <span class="hljs-keyword">this</span>.todos.push(newTodo)
  },
  <span class="hljs-attr">deleteTodo</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">todoId</span>) </span>{
    <span class="hljs-keyword">this</span>.todos = <span class="hljs-keyword">this</span>.todos.filter(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">todo</span>) </span>{
      <span class="hljs-keyword">return</span> todo.id !== todoId
    })
  }
}</code></pre>
<p>This pattern can serve as a replacement for <code>$dispatch</code> and <code>$broadcast</code> in simple scenarios, but for more complex cases, it&#x2019;s recommended to use a dedicated state management layer such as <a href="https://github.com/vuejs/vuex" target="_blank" rel="noopener">Vuex</a>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>$dispatch</code> and <code>$broadcast</code>.</p>
</div>

<h2 id="Filters"><a href="#Filters" class="headerlink" title="Filters"></a>Filters</h2><h3 id="Filters-Outside-Text-Interpolations-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Filters-Outside-Text-Interpolations-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Filters Outside Text Interpolations &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a>Filters Outside Text Interpolations <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Filters can now only be used inside text interpolations (<code>{{ }}</code> tags). In the past we&#x2019;ve found using filters within directives such as <code>v-model</code>, <code>v-on</code>, etc led to more complexity than convenience. For list filtering on <code>v-for</code>, it&#x2019;s also better to move that logic into JavaScript as computed properties, so that it can be reused throughout your component.</p>
<p>In general, whenever something can be achieved in plain JavaScript, we want to avoid introducing a special syntax like filters to take care of the same concern. Here&#x2019;s how you can replace Vue&#x2019;s built-in directive filters:</p>
<h4 id="Replacing-the-debounce-Filter"><a href="#Replacing-the-debounce-Filter" class="headerlink" title="Replacing the debounce Filter"></a>Replacing the <code>debounce</code> Filter</h4><p>Instead of:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-on:keyup</span>=<span class="hljs-string">&quot;doStuff | debounce 500&quot;</span>&gt;</span></code></pre>
<pre><code class="hljs js">methods: {
  <span class="hljs-attr">doStuff</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-comment">// ...</span>
  }
}</code></pre>
<p>Use <a href="https://lodash.com/docs/4.15.0#debounce" target="_blank" rel="noopener">lodash&#x2019;s <code>debounce</code></a> (or possibly <a href="https://lodash.com/docs/4.15.0#throttle" target="_blank" rel="noopener"><code>throttle</code></a>) to directly limit calling the expensive method. You can achieve the same as above like this:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">input</span> <span class="hljs-attr">v-on:keyup</span>=<span class="hljs-string">&quot;doStuff&quot;</span>&gt;</span></code></pre>
<pre><code class="hljs js">methods: {
  <span class="hljs-attr">doStuff</span>: _.debounce(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-comment">// ...</span>
  }, <span class="hljs-number">500</span>)
}</code></pre>
<p>For more on the advantages of this strategy, see <a href="#debounce-Param-Attribute-for-v-model-removed">the example here with <code>v-model</code></a>.</p>
<h4 id="Replacing-the-limitBy-Filter"><a href="#Replacing-the-limitBy-Filter" class="headerlink" title="Replacing the limitBy Filter"></a>Replacing the <code>limitBy</code> Filter</h4><p>Instead of:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;item in items | limitBy 10&quot;</span>&gt;</span>{{ item }}<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>Use JavaScript&#x2019;s built-in <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/slice#Examples" target="_blank" rel="noopener"><code>.slice</code> method</a> in a computed property:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;item in filteredItems&quot;</span>&gt;</span>{{ item }}<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<pre><code class="hljs js">computed: {
  <span class="hljs-attr">filteredItems</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.items.slice(<span class="hljs-number">0</span>, <span class="hljs-number">10</span>)
  }
}</code></pre>
<h4 id="Replacing-the-filterBy-Filter"><a href="#Replacing-the-filterBy-Filter" class="headerlink" title="Replacing the filterBy Filter"></a>Replacing the <code>filterBy</code> Filter</h4><p>Instead of:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;user in users | filterBy searchQuery in &apos;name&apos;&quot;</span>&gt;</span>{{ user.name }}<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>Use JavaScript&#x2019;s built-in <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/filter#Examples" target="_blank" rel="noopener"><code>.filter</code> method</a> in a computed property:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;user in filteredUsers&quot;</span>&gt;</span>{{ user.name }}<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<pre><code class="hljs js">computed: {
  <span class="hljs-attr">filteredUsers</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">var</span> self = <span class="hljs-keyword">this</span>
    <span class="hljs-keyword">return</span> self.users.filter(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">user</span>) </span>{
      <span class="hljs-keyword">return</span> user.name.indexOf(self.searchQuery) !== <span class="hljs-number">-1</span>
    })
  }
}</code></pre>
<p>JavaScript&#x2019;s native <code>.filter</code> can also manage much more complex filtering operations, because you have access to the full power of JavaScript within computed properties. For example, if you wanted to find all active users and case-insensitively match against both their name and email:</p>
<pre><code class="hljs js"><span class="hljs-keyword">var</span> self = <span class="hljs-keyword">this</span>
self.users.filter(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">user</span>) </span>{
  <span class="hljs-keyword">var</span> searchRegex = <span class="hljs-keyword">new</span> <span class="hljs-built_in">RegExp</span>(self.searchQuery, <span class="hljs-string">&apos;i&apos;</span>)
  <span class="hljs-keyword">return</span> user.isActive &amp;&amp; (
    searchRegex.test(user.name) ||
    searchRegex.test(user.email)
  )
})</code></pre>
<h4 id="Replacing-the-orderBy-Filter"><a href="#Replacing-the-orderBy-Filter" class="headerlink" title="Replacing the orderBy Filter"></a>Replacing the <code>orderBy</code> Filter</h4><p>Instead of:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;user in users | orderBy &apos;name&apos;&quot;</span>&gt;</span>{{ user.name }}<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>Use <a href="https://lodash.com/docs/4.15.0#orderBy" target="_blank" rel="noopener">lodash&#x2019;s <code>orderBy</code></a> (or possibly <a href="https://lodash.com/docs/4.15.0#sortBy" target="_blank" rel="noopener"><code>sortBy</code></a>) in a computed property:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span> <span class="hljs-attr">v-for</span>=<span class="hljs-string">&quot;user in orderedUsers&quot;</span>&gt;</span>{{ user.name }}<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<pre><code class="hljs js">computed: {
  <span class="hljs-attr">orderedUsers</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> _.orderBy(<span class="hljs-keyword">this</span>.users, <span class="hljs-string">&apos;name&apos;</span>)
  }
}</code></pre>
<p>You can even order by multiple columns:</p>
<pre><code class="hljs js">_.orderBy(<span class="hljs-keyword">this</span>.users, [<span class="hljs-string">&apos;name&apos;</span>, <span class="hljs-string">&apos;last_login&apos;</span>], [<span class="hljs-string">&apos;asc&apos;</span>, <span class="hljs-string">&apos;desc&apos;</span>])</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of filters being used inside directives. If you miss any, you should also see <strong>console errors</strong>.</p>
</div>

<h3 id="Filter-Argument-Syntax-changed"><a href="#Filter-Argument-Syntax-changed" class="headerlink" title="Filter Argument Syntax changed"></a>Filter Argument Syntax <sup>changed</sup></h3><p>Filters&#x2019; syntax for arguments now better aligns with JavaScript function invocation. So instead of taking space-delimited arguments:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>{{ date | formatDate &apos;YY-MM-DD&apos; timeZone }}<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>
<p>We surround the arguments with parentheses and delimit the arguments with commas:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>{{ date | formatDate(&apos;YY-MM-DD&apos;, timeZone) }}<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the old filter syntax. If you miss any, you should also see <strong>console errors</strong>.</p>
</div>

<h3 id="Built-In-Text-Filters-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Built-In-Text-Filters-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Built-In Text Filters &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a>Built-In Text Filters <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Although filters within text interpolations are still allowed, all of the filters have been removed. Instead, it&#x2019;s recommended to use more specialized libraries for solving problems in each domain (e.g. <a href="https://date-fns.org/" target="_blank" rel="noopener"><code>date-fns</code></a> to format dates and <a href="http://openexchangerates.github.io/accounting.js/" target="_blank" rel="noopener"><code>accounting</code></a> for currencies).</p>
<p>For each of Vue&#x2019;s built-in text filters, we go through how you can replace them below. The example code could exist in custom helper functions, methods, or computed properties.</p>
<h4 id="Replacing-the-json-Filter"><a href="#Replacing-the-json-Filter" class="headerlink" title="Replacing the json Filter"></a>Replacing the <code>json</code> Filter</h4><p>You actually don&#x2019;t need to for debugging anymore, as Vue will nicely format output for you automatically, whether it&#x2019;s a string, number, array, or plain object. If you want the exact same functionality as JavaScript&#x2019;s <code>JSON.stringify</code> though, then you can use that in a method or computed property.</p>
<h4 id="Replacing-the-capitalize-Filter"><a href="#Replacing-the-capitalize-Filter" class="headerlink" title="Replacing the capitalize Filter"></a>Replacing the <code>capitalize</code> Filter</h4><pre><code class="hljs js">text[<span class="hljs-number">0</span>].toUpperCase() + text.slice(<span class="hljs-number">1</span>)</code></pre>
<h4 id="Replacing-the-uppercase-Filter"><a href="#Replacing-the-uppercase-Filter" class="headerlink" title="Replacing the uppercase Filter"></a>Replacing the <code>uppercase</code> Filter</h4><pre><code class="hljs js">text.toUpperCase()</code></pre>
<h4 id="Replacing-the-lowercase-Filter"><a href="#Replacing-the-lowercase-Filter" class="headerlink" title="Replacing the lowercase Filter"></a>Replacing the <code>lowercase</code> Filter</h4><pre><code class="hljs js">text.toLowerCase()</code></pre>
<h4 id="Replacing-the-pluralize-Filter"><a href="#Replacing-the-pluralize-Filter" class="headerlink" title="Replacing the pluralize Filter"></a>Replacing the <code>pluralize</code> Filter</h4><p>The <a href="https://www.npmjs.com/package/pluralize" target="_blank" rel="noopener">pluralize</a> package on NPM serves this purpose nicely, but if you only want to pluralize a specific word or want to have special output for cases like <code>0</code>, then you can also easily define your own pluralize functions. For example:</p>
<pre><code class="hljs js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">pluralizeKnife</span> (<span class="hljs-params">count</span>) </span>{
  <span class="hljs-keyword">if</span> (count === <span class="hljs-number">0</span>) {
    <span class="hljs-keyword">return</span> <span class="hljs-string">&apos;no knives&apos;</span>
  } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (count === <span class="hljs-number">1</span>) {
    <span class="hljs-keyword">return</span> <span class="hljs-string">&apos;1 knife&apos;</span>
  } <span class="hljs-keyword">else</span> {
    <span class="hljs-keyword">return</span> count + <span class="hljs-string">&apos;knives&apos;</span>
  }
}</code></pre>
<h4 id="Replacing-the-currency-Filter"><a href="#Replacing-the-currency-Filter" class="headerlink" title="Replacing the currency Filter"></a>Replacing the <code>currency</code> Filter</h4><p>For a very naive implementation, you could do something like this:</p>
<pre><code class="hljs js"><span class="hljs-string">&apos;$&apos;</span> + price.toFixed(<span class="hljs-number">2</span>)</code></pre>
<p>In many cases though, you&#x2019;ll still run into strange behavior (e.g. <code>0.035.toFixed(2)</code> rounds up to <code>0.04</code>, but <code>0.045</code> rounds down to <code>0.04</code>). To work around these issues, you can use the <a href="http://openexchangerates.github.io/accounting.js/" target="_blank" rel="noopener"><code>accounting</code></a> library to more reliably format currencies.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the obsolete text filters. If you miss any, you should also see <strong>console errors</strong>.</p>
</div>

<h3 id="Two-Way-Filters-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#Two-Way-Filters-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="Two-Way Filters &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a>Two-Way Filters <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>Some users have enjoyed using two-way filters with <code>v-model</code> to create interesting inputs with very little code. While <em>seemingly</em> simple however, two-way filters can also hide a great deal of complexity - and even encourage poor UX by delaying state updates. Instead, components wrapping an input are recommended as a more explicit and feature-rich way of creating custom inputs.</p>
<p>As an example, we&#x2019;ll now walk the migration of a two-way currency filter:</p>
<iframe width="100%" height="300" src="https://jsfiddle.net/chrisvfritz/6744xnjk/embedded/js,html,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>

<p>It mostly works well, but the delayed state updates can cause strange behavior. For example, click on the <code>Result</code> tab and try entering <code>9.999</code> into one of those inputs. When the input loses focus, its value will update to <code>$10.00</code>. When looking at the calculated total however, you&#x2019;ll see that <code>9.999</code> is what&#x2019;s stored in our data. The version of reality that the user sees is out of sync!</p>
<p>To start transitioning towards a more robust solution using Vue 2.0, let&#x2019;s first wrap this filter in a new <code>&lt;currency-input&gt;</code> component:</p>
<iframe width="100%" height="300" src="https://jsfiddle.net/chrisvfritz/943zfbsh/embedded/js,html,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>

<p>This allows us add behavior that a filter alone couldn&#x2019;t encapsulate, such as selecting the content of an input on focus. Now the next step will be to extract the business logic from the filter. Below, we pull everything out into an external <a href="https://gist.github.com/chrisvfritz/5f0a639590d6e648933416f90ba7ae4e" target="_blank" rel="noopener"><code>currencyValidator</code> object</a>:</p>
<iframe width="100%" height="300" src="https://jsfiddle.net/chrisvfritz/9c32kev2/embedded/js,html,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>

<p>This increased modularity not only makes it easier to migrate to Vue 2, but also allows currency parsing and formatting to be:</p>
<ul>
<li>unit tested in isolation from your Vue code</li>
<li>used by other parts of your application, such as to validate the payload to an API endpoint</li>
</ul>
<p>Having this validator extracted out, we&#x2019;ve also more comfortably built it up into a more robust solution. The state quirks have been eliminated and it&#x2019;s actually impossible for users to enter anything wrong, similar to what the browser&#x2019;s native number input tries to do.</p>
<p>We&#x2019;re still limited however, by filters and by Vue 1.0 in general, so let&#x2019;s complete the upgrade to Vue 2.0:</p>
<iframe width="100%" height="300" src="https://jsfiddle.net/chrisvfritz/1oqjojjx/embedded/js,html,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>

<p>You may notice that:</p>
<ul>
<li>Every aspect of our input is more explicit, using lifecycle hooks and DOM events in place of the hidden behavior of two-way filters.</li>
<li>We can now use <code>v-model</code> directly on our custom inputs, which is not only more consistent with normal inputs, but also means our component is Vuex-friendly.</li>
<li>Since we&#x2019;re no longer using filter options that require a value to be returned, our currency work could actually be done asynchronously. That means if we had a lot of apps that had to work with currencies, we could easily refactor this logic into a shared microservice.</li>
</ul>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of filters used in directives like <code>v-model</code>. If you miss any, you should also see <strong>console errors</strong>.</p>
</div>

<h2 id="Slots"><a href="#Slots" class="headerlink" title="Slots"></a>Slots</h2><h3 id="Duplicate-Slots-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Duplicate-Slots-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Duplicate Slots &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a>Duplicate Slots <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>It is no longer supported to have <code>&lt;slot&gt;</code>s with the same name in the same template. When a slot is rendered it is &#x201C;used up&#x201D; and cannot be rendered elsewhere in the same render tree. If you must render the same content in multiple places, pass that content as a prop.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>Run your end-to-end test suite or app after upgrading and look for <strong>console warnings</strong> about duplicate slots <code>v-model</code>.</p>
</div>

<h3 id="slot-Attribute-Styling-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#slot-Attribute-Styling-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="slot Attribute Styling &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>slot</code> Attribute Styling <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Content inserted via named <code>&lt;slot&gt;</code> no longer preserves the <code>slot</code> attribute. Use a wrapper element to style them, or for advanced use cases, modify the inserted content programmatically using <a href="render-function.html">render functions</a>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find CSS selectors targeting named slots (e.g. <code>[slot=&quot;my-slot-name&quot;]</code>).</p>
</div>

<h2 id="Special-Attributes"><a href="#Special-Attributes" class="headerlink" title="Special Attributes"></a>Special Attributes</h2><h3 id="keep-alive-Attribute-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#keep-alive-Attribute-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="keep-alive Attribute &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>keep-alive</code> Attribute <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p><code>keep-alive</code> is no longer a special attribute, but rather a wrapper component, similar to <code>&lt;transition&gt;</code>. For example:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">keep-alive</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">component</span> <span class="hljs-attr">v-bind:is</span>=<span class="hljs-string">&quot;view&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">component</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">keep-alive</span>&gt;</span></code></pre>
<p>This makes it possible to use <code>&lt;keep-alive&gt;</code> on multiple conditional children:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">keep-alive</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">todo-list</span> <span class="hljs-attr">v-if</span>=<span class="hljs-string">&quot;todos.length &gt; 0&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">todo-list</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">no-todos-gif</span> <span class="hljs-attr">v-else</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">no-todos-gif</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">keep-alive</span>&gt;</span></code></pre>
<p class="tip">When <code>&lt;keep-alive&gt;</code> has multiple children, they should eventually evaluate to a single child. Any child other than the first one will be ignored.</p>

<p>When used together with <code>&lt;transition&gt;</code>, make sure to nest it inside:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">transition</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">keep-alive</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">component</span> <span class="hljs-attr">v-bind:is</span>=<span class="hljs-string">&quot;view&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">component</span>&gt;</span>
  <span class="hljs-tag">&lt;/<span class="hljs-name">keep-alive</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">transition</span>&gt;</span></code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find <code>keep-alive</code> attributes.</p>
</div>

<h2 id="Interpolation"><a href="#Interpolation" class="headerlink" title="Interpolation"></a>Interpolation</h2><h3 id="Interpolation-within-Attributes-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Interpolation-within-Attributes-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Interpolation within Attributes &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a>Interpolation within Attributes <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Interpolation within attributes is no longer valid. For example:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">button</span> <span class="hljs-attr">class</span>=<span class="hljs-string">&quot;btn btn-{{ size }}&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">button</span>&gt;</span></code></pre>
<p>Should either be updated to use an inline expression:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">button</span> <span class="hljs-attr">v-bind:class</span>=<span class="hljs-string">&quot;&apos;btn btn-&apos; + size&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">button</span>&gt;</span></code></pre>
<p>Or a data/computed property:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">button</span> <span class="hljs-attr">v-bind:class</span>=<span class="hljs-string">&quot;buttonClasses&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">button</span>&gt;</span></code></pre>
<pre><code class="hljs js">computed: {
  <span class="hljs-attr">buttonClasses</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-string">&apos;btn btn-&apos;</span> + size
  }
}</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of interpolation used within attributes.</p>
</div>

<h3 id="HTML-Interpolation-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#HTML-Interpolation-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="HTML Interpolation &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a>HTML Interpolation <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>HTML interpolations (<code>{{{ foo }}}</code>) have been removed in favor of the <a href="../api/#v-html"><code>v-html</code> directive</a>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find HTML interpolations.</p>
</div>

<h3 id="One-Time-Bindings-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#One-Time-Bindings-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="One-Time Bindings &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a>One-Time Bindings <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>One time bindings (<code>{{* foo }}</code>) have been replaced by the new <a href="../api/#v-once"><code>v-once</code> directive</a>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find one-time bindings.</p>
</div>

<h2 id="Reactivity"><a href="#Reactivity" class="headerlink" title="Reactivity"></a>Reactivity</h2><h3 id="vm-watch-changed"><a href="#vm-watch-changed" class="headerlink" title="vm.$watch changed"></a><code>vm.$watch</code> <sup>changed</sup></h3><p>Watchers created via <code>vm.$watch</code> are now fired before the associated component rerenders. This gives you the chance to further update state before the component rerender, thus avoiding unnecessary updates. For example, you can watch a component prop and update the component&#x2019;s own data when the prop changes.</p>
<p>If you were previously relying on <code>vm.$watch</code> to do something with the DOM after a component updates, you can instead do so in the <code>updated</code> lifecycle hook.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>Run your end-to-end test suite, if you have one. The <strong>failed tests</strong> should alert to you to the fact that a watcher was relying on the old behavior.</p>
</div>

<h3 id="vm-set-changed"><a href="#vm-set-changed" class="headerlink" title="vm.$set changed"></a><code>vm.$set</code> <sup>changed</sup></h3><p><code>vm.$set</code> is now an alias for <a href="../api/#Vue-set"><code>Vue.set</code></a>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the obsolete usage.</p>
</div>

<h3 id="vm-delete-changed"><a href="#vm-delete-changed" class="headerlink" title="vm.$delete changed"></a><code>vm.$delete</code> <sup>changed</sup></h3><p><code>vm.$delete</code> is now an alias for <a href="../api/#Vue-delete"><code>Vue.delete</code></a>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of the obsolete usage.</p>
</div>

<h3 id="Array-prototype-set-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Array-prototype-set-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Array.prototype.$set &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>Array.prototype.$set</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Use <code>Vue.set</code> instead.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>.$set</code> on an array. If you miss any, you should see <strong>console errors</strong> from the missing method.</p>
</div>

<h3 id="Array-prototype-remove-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Array-prototype-remove-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Array.prototype.$remove &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>Array.prototype.$remove</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Use <code>Array.prototype.splice</code> instead. For example:</p>
<pre><code class="hljs js">methods: {
  <span class="hljs-attr">removeTodo</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">todo</span>) </span>{
    <span class="hljs-keyword">var</span> index = <span class="hljs-keyword">this</span>.todos.indexOf(todo)
    <span class="hljs-keyword">this</span>.todos.splice(index, <span class="hljs-number">1</span>)
  }
}</code></pre>
<p>Or better yet, pass removal methods an index:</p>
<pre><code class="hljs js">methods: {
  <span class="hljs-attr">removeTodo</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">index</span>) </span>{
    <span class="hljs-keyword">this</span>.todos.splice(index, <span class="hljs-number">1</span>)
  }
}</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>.$remove</code> on an array. If you miss any, you should see <strong>console errors</strong> from the missing method.</p>
</div>

<h3 id="Vue-set-and-Vue-delete-on-Vue-instances-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Vue-set-and-Vue-delete-on-Vue-instances-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Vue.set and Vue.delete on Vue instances &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>Vue.set</code> and <code>Vue.delete</code> on Vue instances <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p><code>Vue.set</code> and <code>Vue.delete</code> can no longer work on Vue instances. It is now mandatory to properly declare all top-level reactive properties in the data option. If you&#x2019;d like to delete properties on a Vue instance or its <code>$data</code>, set it to null.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>Vue.set</code> or <code>Vue.delete</code> on a Vue instance. If you miss any, they&apos;ll trigger <strong>console warnings</strong>.</p>
</div>

<h3 id="Replacing-vm-data-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Replacing-vm-data-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Replacing vm.$data &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a>Replacing <code>vm.$data</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>It is now prohibited to replace a component instance&#x2019;s root $data. This prevents some edge cases in the reactivity system and makes the component state more predictable (especially with type-checking systems).</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of overwriting <code>vm.$data</code>. If you miss any, <strong>console warnings</strong> will be emitted.</p>
</div>

<h3 id="vm-get-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#vm-get-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="vm.$get &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>vm.$get</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Instead, retrieve reactive data directly.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>vm.$get</code>. If you miss any, you&apos;ll see <strong>console errors</strong>.</p>
</div>

<h2 id="DOM-Focused-Instance-Methods"><a href="#DOM-Focused-Instance-Methods" class="headerlink" title="DOM-Focused Instance Methods"></a>DOM-Focused Instance Methods</h2><h3 id="vm-appendTo-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#vm-appendTo-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="vm.$appendTo &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>vm.$appendTo</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Use the native DOM API:</p>
<pre><code class="hljs js">myElement.appendChild(vm.$el)</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>vm.$appendTo</code>. If you miss any, you&apos;ll see <strong>console errors</strong>.</p>
</div>

<h3 id="vm-before-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#vm-before-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="vm.$before &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>vm.$before</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Use the native DOM API:</p>
<pre><code class="hljs js">myElement.parentNode.insertBefore(vm.$el, myElement)</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>vm.$before</code>. If you miss any, you&apos;ll see <strong>console errors</strong>.</p>
</div>

<h3 id="vm-after-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#vm-after-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="vm.$after &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>vm.$after</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Use the native DOM API:</p>
<pre><code class="hljs js">myElement.parentNode.insertBefore(vm.$el, myElement.nextSibling)</code></pre>
<p>Or if <code>myElement</code> is the last child:</p>
<pre><code class="hljs js">myElement.parentNode.appendChild(vm.$el)</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>vm.$after</code>. If you miss any, you&apos;ll see <strong>console errors</strong>.</p>
</div>

<h3 id="vm-remove-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#vm-remove-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="vm.$remove &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>vm.$remove</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Use the native DOM API:</p>
<pre><code class="hljs js">vm.$el.remove()</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>vm.$remove</code>. If you miss any, you&apos;ll see <strong>console errors</strong>.</p>
</div>

<h2 id="Meta-Instance-Methods"><a href="#Meta-Instance-Methods" class="headerlink" title="Meta Instance Methods"></a>Meta Instance Methods</h2><h3 id="vm-eval-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#vm-eval-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="vm.$eval &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>vm.$eval</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>No real use. If you do happen to rely on this feature somehow and aren&#x2019;t sure how to work around it, post on <a href="https://forum.vuejs.org/" target="_blank" rel="noopener">the forum</a> for ideas.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>vm.$eval</code>. If you miss any, you&apos;ll see <strong>console errors</strong>.</p>
</div>

<h3 id="vm-interpolate-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#vm-interpolate-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="vm.$interpolate &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>vm.$interpolate</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>No real use. If you do happen to rely on this feature somehow and aren&#x2019;t sure how to work around it, post on <a href="https://forum.vuejs.org/" target="_blank" rel="noopener">the forum</a> for ideas.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>vm.$interpolate</code>. If you miss any, you&apos;ll see <strong>console errors</strong>.</p>
</div>

<h3 id="vm-log-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#vm-log-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="vm.$log &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>vm.$log</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Use the <a href="https://github.com/vuejs/vue-devtools" target="_blank" rel="noopener">Vue Devtools</a> for the optimal debugging experience.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>vm.$log</code>. If you miss any, you&apos;ll see <strong>console errors</strong>.</p>
</div>

<h2 id="Instance-DOM-Options"><a href="#Instance-DOM-Options" class="headerlink" title="Instance DOM Options"></a>Instance DOM Options</h2><h3 id="replace-false-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#replace-false-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="replace: false &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>replace: false</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Components now always replace the element they&#x2019;re bound to. To simulate the behavior of <code>replace: false</code>, you can wrap your root component with an element similar to the one you&#x2019;re replacing. For example:</p>
<pre><code class="hljs js"><span class="hljs-keyword">new</span> Vue({
  <span class="hljs-attr">el</span>: <span class="hljs-string">&apos;#app&apos;</span>,
  <span class="hljs-attr">template</span>: <span class="hljs-string">&apos;&lt;div id=&quot;app&quot;&gt; ... &lt;/div&gt;&apos;</span>
})</code></pre>
<p>Or with a render function:</p>
<pre><code class="hljs js"><span class="hljs-keyword">new</span> Vue({
  <span class="hljs-attr">el</span>: <span class="hljs-string">&apos;#app&apos;</span>,
  <span class="hljs-attr">render</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">h</span>) </span>{
    h(<span class="hljs-string">&apos;div&apos;</span>, {
      <span class="hljs-attr">attrs</span>: {
        <span class="hljs-attr">id</span>: <span class="hljs-string">&apos;app&apos;</span>,
      }
    }, <span class="hljs-comment">/* ... */</span>)
  }
})</code></pre>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>replace: false</code>.</p>
</div>

<h2 id="Global-Config"><a href="#Global-Config" class="headerlink" title="Global Config"></a>Global Config</h2><h3 id="Vue-config-debug-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Vue-config-debug-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Vue.config.debug &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>Vue.config.debug</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>No longer necessary, since warnings come with stack traces by default now.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>Vue.config.debug</code>.</p>
</div>

<h3 id="Vue-config-async-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Vue-config-async-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Vue.config.async &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>Vue.config.async</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Async is now required for rendering performance.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>Vue.config.async</code>.</p>
</div>

<h3 id="Vue-config-delimiters-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"><a href="#Vue-config-delimiters-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;" class="headerlink" title="Vue.config.delimiters &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;"></a><code>Vue.config.delimiters</code> <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x451;&#x43D;</sup></h3><p>This has been reworked as a <a href="../api/#delimiters">component-level option</a>. This allows you to use alternative delimiters within your app without breaking 3rd-party components.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>Vue.config.delimiters</code>.</p>
</div>

<h3 id="Vue-config-unsafeDelimiters-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Vue-config-unsafeDelimiters-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Vue.config.unsafeDelimiters &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>Vue.config.unsafeDelimiters</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>HTML interpolation has been <a href="#HTML-Interpolation-removed">removed in favor of <code>v-html</code></a>.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>Vue.config.unsafeDelimiters</code>. After this, the helper will also find instances of HTML interpolation so that you can replace them with `v-html`.</p>
</div>

<h2 id="Global-API"><a href="#Global-API" class="headerlink" title="Global API"></a>Global API</h2><h3 id="Vue-extend-with-el-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Vue-extend-with-el-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Vue.extend with el &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>Vue.extend</code> with <code>el</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>The el option can no longer be used in <code>Vue.extend</code>. It&#x2019;s only valid as an instance creation option.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>Run your end-to-end test suite or app after upgrading and look for <strong>console warnings</strong> about the <code>el</code> option with <code>Vue.extend</code>.</p>
</div>

<h3 id="Vue-elementDirective-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Vue-elementDirective-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Vue.elementDirective &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>Vue.elementDirective</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Use components instead.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>Vue.elementDirective</code>.</p>
</div>

<h3 id="Vue-partial-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"><a href="#Vue-partial-&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;" class="headerlink" title="Vue.partial &#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;"></a><code>Vue.partial</code> <sup>&#x443;&#x434;&#x430;&#x43B;&#x451;&#x43D;</sup></h3><p>Partials have been removed in favor of more explicit data flow between components, using props. Unless you&#x2019;re using a partial in a performance-critical area, the recommendation is to use a <a href="components.html">normal component</a> instead. If you were dynamically binding the <code>name</code> of a partial, you can use a <a href="components.html#Dynamic-Components">dynamic component</a>.</p>
<p>If you happen to be using partials in a performance-critical part of your app, then you should upgrade to <a href="render-function.html#Functional-Components">functional components</a>. They must be in a plain JS/JSX file (rather than in a <code>.vue</code> file) and are stateless and instanceless, like partials. This makes rendering extremely fast.</p>
<p>A benefit of functional components over partials is that they can be much more dynamic, because they grant you access to the full power of JavaScript. There is a cost to this power however. If you&#x2019;ve never used a component framework with render functions before, they may take a bit longer to learn.</p>

<div class="upgrade-path">
  <h4>&#x41A;&#x430;&#x43A; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">migration helper</a> on your codebase to find examples of <code>Vue.partial</code>.</p>
</div>


    
    
      <div class="guide-links">
        
        
          <span>&#x2190; <a href="/v2/guide/reactivity.html">&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E; &#x43E; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x438;</a></span>
        
        
        
          <span style="float: right;"><a href="/v2/guide/migration-vue-router.html">&#x41C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441; Vue Router 0.7.x</a> &#x2192;</span>
        
      </div>
    
    <div class="footer">
        <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
<div class="bsa-cpc"></div>
<script>
  (function(){
    if(typeof _bsa !== 'undefined' && _bsa) {
    _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
      target: '.bsa-cpc',
      align: 'horizontal',
      disable_css: 'true'
    });
      }
  })();
</script>

      &#x41E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x451; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;?
      <a href="https://github.com/translation-gang/ru.vuejs.org/blob/master/src/v2/guide/migration.md" target="_blank">
        &#x41E;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43D;&#x430; GitHub!
      </a>
    </div>

</body>
</html>