<!DOCTYPE html>
<html lang="en" id="wrapper">
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Миграция с Vuex 0.6.x на 1.0</title>

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <link href="./style.css" rel="stylesheet" type="text/css">

    <!-- версия для разработки, отображает полезные предупреждения в консоли -->
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>

    <!-- production-версия, оптимизированная для размера и скорости -->
    <!--    <script src="https://cdn.jsdelivr.net/npm/vue"></script>-->

</head>
<body id="main">
<p>Спаршено с: <a href="https://ru.vuejs.org/v2/guide/migration-vuex.html">https://ru.vuejs.org/v2/guide/migration-vuex.html</a></p>

    
      
        

      
    
    
      <h1>&#x41C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441; Vuex 0.6.x &#x43D;&#x430; 1.0</h1>
    
    
      <blockquote>
<p>&#x421;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43B;&#x441;&#x44F; &#x440;&#x435;&#x43B;&#x438;&#x437; Vuex 2.0, &#x43D;&#x43E; &#x44D;&#x442;&#x430; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x44F; &#x43F;&#x43E;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44E; &#x43D;&#x430; 1.0? &#x42D;&#x442;&#x43E; &#x43E;&#x43F;&#x435;&#x447;&#x430;&#x442;&#x43A;&#x430;? &#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435;, &#x447;&#x442;&#x43E; Vuex 1.0 &#x438; 2.0 &#x431;&#x44B;&#x43B;&#x438; &#x432;&#x44B;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x44B; &#x43E;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;. &#x427;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442;? &#x41A;&#x430;&#x43A;&#x443;&#x44E; &#x438;&#x437; &#x432;&#x435;&#x440;&#x441;&#x438;&#x439; &#x44F; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438; &#x43A;&#x430;&#x43A;&#x430;&#x44F; &#x438;&#x437; &#x43D;&#x438;&#x445; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x430; &#x441; Vue 2.0?</p>
</blockquote>
<p>&#x41E;&#x431;&#x435; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; Vuex 1.0 &#x438; 2.0:</p>
<ul>
<li>&#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x44B; &#x441; Vue 1.0 &#x438; 2.0</li>
<li>&#x431;&#x443;&#x434;&#x443;&#x442; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43E;&#x431;&#x43E;&#x437;&#x440;&#x438;&#x43C;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43C;</li>
</ul>
<p>&#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;, &#x43E;&#x43D;&#x438; &#x438;&#x43C;&#x435;&#x44E;&#x442; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x446;&#x435;&#x43B;&#x435;&#x432;&#x44B;&#x435; &#x430;&#x443;&#x434;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x438;.</p>
<p><strong>Vuex 2.0</strong> &#x440;&#x430;&#x434;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x43D; &#x438; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x443;&#x43F;&#x440;&#x43E;&#x449;&#x451;&#x43D;&#x43D;&#x44B;&#x439; API, &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445;, &#x43A;&#x442;&#x43E; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442; &#x43D;&#x43E;&#x432;&#x44B;&#x435; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x430; &#x43E;&#x441;&#x442;&#x440;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x435;&#x441;&#x441;&#x430; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;&#x43C; &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434;-&#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;. <strong>&#x41E;&#x43D; &#x43D;&#x435; &#x43F;&#x43E;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x435;&#x439; &#x43F;&#x43E; &#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x438;</strong>, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C; &#x43E; &#x43D;&#x451;&#x43C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x2014; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x43A; <a href="https://vuex.vuejs.org/ru/index.html" target="_blank" rel="noopener">&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438; Vuex 2.0</a>.</p>
<p><strong>Vuex 1.0</strong> &#x432; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x43D;&#x43E; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x432;&#x43D;&#x435;&#x441;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43D;&#x435;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x438; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x438;. &#x420;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445;, &#x43A;&#x442;&#x43E; &#x443;&#x436;&#x435; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x434;&#x435;&#x43B;&#x43E; &#x441; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43C;&#x438; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430;&#x43C;&#x438;, &#x43B;&#x438;&#x431;&#x43E; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445;, &#x43A;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x445;&#x43E;&#x447;&#x435;&#x442; &#x43F;&#x43E;&#x441;&#x442;&#x435;&#x43F;&#x435;&#x43D;&#x43D;&#x43E; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; Vue 2.0. &#x414;&#x430;&#x43D;&#x43D;&#x43E;&#x435; &#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x430;&#x43D;&#x43E; &#x441;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x443;, &#x43D;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x435;&#x442; &#x432; &#x441;&#x435;&#x431;&#x44F; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x43A;&#x438; &#x43F;&#x43E; &#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x438;. &#x414;&#x43B;&#x44F; &#x438;&#x437;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44E; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x43A; <a href="https://github.com/vuejs/vuex/tree/1.0/docs/en" target="_blank" rel="noopener">&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438; Vuex 1.0</a>.</p>
<h2 id="store-watch-&#x441;&#x43E;-&#x441;&#x442;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x44B;&#x43C;-&#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C;-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"><a href="#store-watch-&#x441;&#x43E;-&#x441;&#x442;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x44B;&#x43C;-&#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C;-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;" class="headerlink" title="store.watch &#x441;&#x43E; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x44B;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"></a><code>store.watch</code> &#x441;&#x43E; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x44B;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;</sup></h2><p><code>store.watch</code> &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C;:</p>
<pre><code class="hljs js">store.watch(<span class="hljs-string">&apos;user.notifications&apos;</span>, callback)</code></pre>
<p>&#x43D;&#x430;:</p>
<pre><code class="hljs js">store.watch(
  <span class="hljs-comment">// &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x43C;&#x44B;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x441;&#x44F;...</span>
  <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">state</span>) </span>{
    <span class="hljs-keyword">return</span> state.user.notifications
  },
  <span class="hljs-comment">// &#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x441;&#x44F; &#x43A;&#x43E;&#x43B;&#x43B;&#x431;&#x44D;&#x43A;</span>
  callback
)</code></pre>
<p>&#x42D;&#x442;&#x43E; &#x434;&#x430;&#x451;&#x442; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44C; &#x43D;&#x430;&#x434; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x435;&#x43C; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;.</p>

<div class="upgrade-path">
  <h4>&#x41E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; <code>store.watch</code> &#x441;&#x43E; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x43E;&#x439; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;.</p>
</div>

<h2 id="&#x412;&#x44B;&#x437;&#x43E;&#x432;-&#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439;-&#x438;&#x437;-&#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x430;-&#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43E;"><a href="#&#x412;&#x44B;&#x437;&#x43E;&#x432;-&#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439;-&#x438;&#x437;-&#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x430;-&#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43E;" class="headerlink" title="&#x412;&#x44B;&#x437;&#x43E;&#x432; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; &#x438;&#x437; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x430; &#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43E;"></a>&#x412;&#x44B;&#x437;&#x43E;&#x432; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; &#x438;&#x437; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x430; <sup>&#x443;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43E;</sup></h2><p>&#x42D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x430; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x430; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; (<code>on</code>,<code>off</code>, <code>emit</code>). &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x440;&#x430;&#x43D;&#x435;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43B;&#x438; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x435; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x448;&#x438;&#x43D;&#x44B; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439; - <a href="migration.html#dispatch-and-broadcast-removed">&#x441;&#x43C;. &#x44D;&#x442;&#x43E;&#x442; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;</a> &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x439; &#x43F;&#x43E; &#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x438;.</p>
<p>&#x412;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E;&#x442; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x439;, &#x43F;&#x440;&#x43E;&#x431;&#x440;&#x430;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x445; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x435;&#x43C; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, <code>store.on(&apos;mutation&apos;, callback)</code>), &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; - <code>store.subscribe</code>. &#x422;&#x438;&#x43F;&#x438;&#x447;&#x43D;&#x43E;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x435; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x43A;&#x430;&#x43A;:</p>
<pre><code class="hljs js"><span class="hljs-keyword">var</span> myPlugin = <span class="hljs-function"><span class="hljs-params">store</span> =&gt;</span> {
  store.subscribe(<span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">mutation, state</span>) </span>{
    <span class="hljs-comment">// &#x414;&#x430;&#x43B;&#x44C;&#x43D;&#x435;&#x439;&#x448;&#x438;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F;...</span>
  })
}</code></pre>
<p>&#x41E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x43A; <a href="https://github.com/vuejs/vuex/blob/1.0/docs/en/plugins.md" target="_blank" rel="noopener">&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x43E; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x430;&#x43C;</a> &#x434;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x439; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x438;.</p>

<div class="upgrade-path">
  <h4>&#x41E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; <code>store.on</code>, <code>store.off</code> &#x438; <code>store.emit</code>.</p>
</div>

<h2 id="&#x41F;&#x440;&#x43E;&#x441;&#x43B;&#x43E;&#x439;&#x43A;&#x438;-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"><a href="#&#x41F;&#x440;&#x43E;&#x441;&#x43B;&#x43E;&#x439;&#x43A;&#x438;-&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;" class="headerlink" title="&#x41F;&#x440;&#x43E;&#x441;&#x43B;&#x43E;&#x439;&#x43A;&#x438; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;"></a>&#x41F;&#x440;&#x43E;&#x441;&#x43B;&#x43E;&#x439;&#x43A;&#x438; <sup>&#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x43E;</sup></h2><p>&#x41F;&#x440;&#x43E;&#x441;&#x43B;&#x43E;&#x439;&#x43A;&#x438; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x44B; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x430;&#x43C;&#x438;. &#x41F;&#x43B;&#x430;&#x433;&#x438;&#x43D; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x43E;&#x431;&#x43E;&#x439; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x443;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x435; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x435; &#x43C;&#x443;&#x442;&#x430;&#x446;&#x438;&#x438; &#x432; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x435;:</p>
<pre><code class="hljs js"><span class="hljs-keyword">const</span> myPlugins = <span class="hljs-function"><span class="hljs-params">store</span> =&gt;</span> {
  store.subscribe(<span class="hljs-string">&apos;mutation&apos;</span>, (mutation, state) =&gt; {
    <span class="hljs-comment">// &#x414;&#x430;&#x43B;&#x44C;&#x43D;&#x435;&#x439;&#x448;&#x438;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F;...</span>
  })
}</code></pre>
<p>&#x414;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x437;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43C;. <a href="https://github.com/vuejs/vuex/blob/1.0/docs/en/plugins.md" target="_blank" rel="noopener">&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E; &#x43F;&#x43E; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x430;&#x43C;</a>.</p>

<div class="upgrade-path">
  <h4>&#x41E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435;</h4>
  <p>&#x417;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; <a href="https://github.com/vuejs/vue-migration-helper" target="_blank" rel="noopener">&#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x438;&#x43A;</a> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; <code>middlewares</code> &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x438;&#x449;&#x435;.</p>
</div>


    
    
      <div class="guide-links">
        
        
          <span>&#x2190; <a href="/v2/guide/migration-vue-router.html">&#x41C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441; Vue Router 0.7.x</a></span>
        
        
        
          <span style="float: right;"><a href="/v2/guide/comparison.html">&#x421;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C;&#x438; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430;&#x43C;&#x438;</a> &#x2192;</span>
        
      </div>
    
    <div class="footer">
        <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
<div class="bsa-cpc"></div>
<script>
  (function(){
    if(typeof _bsa !== 'undefined' && _bsa) {
    _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
      target: '.bsa-cpc',
      align: 'horizontal',
      disable_css: 'true'
    });
      }
  })();
</script>

      &#x41E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x451; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;?
      <a href="https://github.com/translation-gang/ru.vuejs.org/blob/master/src/v2/guide/migration-vuex.md" target="_blank">
        &#x41E;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43D;&#x430; GitHub!
      </a>
    </div>

</body>
</html>