<!DOCTYPE html>
<html lang="en" id="wrapper">
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Однофайловые компоненты</title>

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <link href="./style.css" rel="stylesheet" type="text/css">

    <!-- версия для разработки, отображает полезные предупреждения в консоли -->
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>

    <!-- production-версия, оптимизированная для размера и скорости -->
    <!--    <script src="https://cdn.jsdelivr.net/npm/vue"></script>-->

</head>
<body id="main">
<p>Спаршено с: <a href="https://ru.vuejs.org/v2/guide/single-file-components.html">https://ru.vuejs.org/v2/guide/single-file-components.html</a></p>

    
      
        

      
    
    
      <h1>&#x41E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;</h1>
    
    
      <h2 id="&#x412;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;"><a href="#&#x412;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;" class="headerlink" title="&#x412;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;"></a>&#x412;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;</h2><div class="vueschool"><a href="https://vueschool.io/lessons/introduction-to-single-file-components?friend=vuejs" target="_blank" rel="noopener" title="Free Vue.js Single File Components lesson">&#x41F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x442;&#x435; &#x431;&#x435;&#x441;&#x43F;&#x43B;&#x430;&#x442;&#x43D;&#x44B;&#x439; &#x443;&#x440;&#x43E;&#x43A; &#x43D;&#x430; Vue School</a></div>

<p>&#x412;&#x43E; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430;&#x445;, &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x43E;&#x43C; <code>Vue.component</code>, &#x441; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; <code>new Vue({ el: &apos;#container&apos; })</code> &#x434;&#x43B;&#x44F; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;-&#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;&#x430; &#x432; &#x442;&#x435;&#x43B;&#x435; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B;.</p>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x43E;&#x432; &#x43C;&#x430;&#x43B;&#x43E;&#x433;&#x43E; &#x438; &#x441;&#x440;&#x435;&#x434;&#x43D;&#x435;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x430;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; JavaScript &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x44C; &#x434;&#x43B;&#x44F; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;, &#x44D;&#x442;&#x43E;&#x442; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C;. &#x412; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x436;&#x435; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430;&#x445; &#x438;&#x43B;&#x438; &#x432; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x435;&#x441;&#x44C; &#x432;&#x430;&#x448; &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; JavaScript, &#x44F;&#x432;&#x43D;&#x44B;&#x43C;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x44F;&#x442;&#x441;&#x44F; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43A;&#x438;:</p>
<ul>
<li><strong>&#x413;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435;</strong> &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x438;&#x43C;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x443;</li>
<li><strong>&#x421;&#x442;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x44B;&#x43C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;&#x43C;</strong> &#x43D;&#x435; &#x445;&#x432;&#x430;&#x442;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x434;&#x441;&#x432;&#x435;&#x442;&#x43A;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x430;. &#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x443;&#x440;&#x43E;&#x434;&#x43B;&#x438;&#x432;&#x44B;&#x435; &#x441;&#x43B;&#x44D;&#x448;&#x438; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; HTML.</li>
<li><strong>&#x41D;&#x435;&#x442; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; CSS</strong> &#x2014; &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; HTML &#x438; JavaScript &#x440;&#x430;&#x437;&#x431;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x438;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;, CSS &#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x437;&#x430; &#x431;&#x43E;&#x440;&#x442;&#x43E;&#x43C;.</li>
<li><strong>&#x41E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; &#x448;&#x430;&#x433;&#x430; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;</strong> &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x441; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; HTML &#x438; ES5 JavaScript, &#x43D;&#x435; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x44B; &#x432;&#x440;&#x43E;&#x434;&#x435; Pug (&#x431;&#x44B;&#x432;&#x448;&#x438;&#x439; Jade) &#x438; Babel</li>
</ul>
<p>&#x412;&#x441;&#x435; &#x44D;&#x442;&#x438; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43A;&#x438; &#x440;&#x435;&#x448;&#x430;&#x44E;&#x442;&#x441;&#x44F; <strong>&#x43E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x43C;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;</strong> &#x441; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x435;&#x43C; <code>.vue</code>, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442; &#x442;&#x430;&#x43A;&#x438;&#x435; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x43A;&#x430;&#x43A; Webpack &#x438; Browserify.</p>
<p>&#x412;&#x43E;&#x442; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x444;&#x430;&#x439;&#x43B;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x44B; &#x43D;&#x430;&#x437;&#x43E;&#x432;&#x451;&#x43C; <code>Hello.vue</code>:</p>
<p><a href="https://gist.github.com/chrisvfritz/e2b6a6110e0829d78fa4aedf7cf6b235" target="_blank" rel="noopener noreferrer"><img src="/images/vue-component.png" alt="&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x43E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;" style="display: block; margin: 30px auto;"></a></p>
<p>&#x41C;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B;&#x438;:</p>
<ul>
<li><a href="https://github.com/vuejs/awesome-vue#source-code-editing" target="_blank" rel="noopener">&#x43F;&#x43E;&#x43B;&#x43D;&#x443;&#x44E; &#x43F;&#x43E;&#x434;&#x441;&#x432;&#x435;&#x442;&#x43A;&#x443; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x430;</a></li>
<li><a href="https://webpack.js.org/concepts/modules/#what-is-a-webpack-module" target="_blank" rel="noopener">&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x438; CommonJS</a></li>
<li><a href="https://vue-loader.vuejs.org/ru/features/scoped-css.html" target="_blank" rel="noopener">&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; CSS</a></li>
</ul>
<p>&#x41A;&#x430;&#x43A; &#x438; &#x43E;&#x431;&#x435;&#x449;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x43C;&#x44B; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x44B;, &#x442;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x430;&#x43A; Pug, Babel (&#x441; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;&#x43C;&#x438; ES2015) &#x438; Stylus &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x44F;&#x441;&#x43D;&#x44B;&#x445; &#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;.</p>
<p><a href="https://gist.github.com/chrisvfritz/1c9f2daea9bc078dcb47e9a82e5f7587" target="_blank" rel="noopener noreferrer"><img src="/images/vue-component-with-preprocessors.png" alt="&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x43E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; &#x441; &#x43F;&#x440;&#x435;-&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x430;&#x43C;&#x438;" style="display: block; margin: 30px auto;"></a></p>
<p>&#x41F;&#x435;&#x440;&#x435;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x44F;&#x437;&#x44B;&#x43A;&#x438; &#x434;&#x430;&#x43D;&#x44B; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430;. &#x421; &#x442;&#x435;&#x43C; &#x436;&#x435; &#x443;&#x441;&#x43F;&#x435;&#x445;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; Buble, TypeScript, SCSS, PostCSS &#x2014; &#x438;&#x43B;&#x438; &#x43B;&#x44E;&#x431;&#x44B;&#x435; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x43F;&#x440;&#x435;- &#x438;&#x43B;&#x438; &#x43F;&#x43E;&#x441;&#x442;&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x44B; &#x43F;&#x43E; &#x432;&#x43A;&#x443;&#x441;&#x443;. &#x41F;&#x440;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; Webpack &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; <code>vue-loader</code>, &#x432;&#x44B; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x443;&#x44E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443; CSS-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439;.</p>
<h3 id="&#x427;&#x442;&#x43E;-&#x43D;&#x430;&#x441;&#x447;&#x451;&#x442;-&#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F;-&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438;"><a href="#&#x427;&#x442;&#x43E;-&#x43D;&#x430;&#x441;&#x447;&#x451;&#x442;-&#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F;-&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438;" class="headerlink" title="&#x427;&#x442;&#x43E; &#x43D;&#x430;&#x441;&#x447;&#x451;&#x442; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438;?"></a>&#x427;&#x442;&#x43E; &#x43D;&#x430;&#x441;&#x447;&#x451;&#x442; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438;?</h3><p>&#x41E;&#x434;&#x43D;&#x430; &#x432;&#x430;&#x436;&#x43D;&#x430;&#x44F; &#x432;&#x435;&#x449;&#x44C;, &#x447;&#x442;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x43E;&#x442;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x2014; <strong>&#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x44D;&#x442;&#x43E; &#x43D;&#x435; &#x442;&#x43E; &#x436;&#x435; &#x441;&#x430;&#x43C;&#x43E;&#x435;, &#x447;&#x442;&#x43E; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x43F;&#x43E; &#x442;&#x438;&#x43F;&#x443;.</strong> &#x412; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x435; UI &#x43C;&#x44B; &#x43E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438;, &#x447;&#x442;&#x43E; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x43E;&#x439; &#x431;&#x430;&#x437;&#x44B; &#x43D;&#x430; &#x442;&#x440;&#x438; &#x43E;&#x433;&#x440;&#x43E;&#x43C;&#x43D;&#x44B;&#x445; &#x441;&#x43B;&#x43E;&#x44F;, &#x447;&#x442;&#x43E; &#x442;&#x435;&#x441;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x43B;&#x435;&#x442;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x434;&#x440;&#x443;&#x433; &#x441; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C;, &#x438;&#x43C;&#x435;&#x435;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x441;&#x43C;&#x44B;&#x441;&#x43B;&#x430; &#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C; &#x438;&#x445; &#x43D;&#x430; &#x441;&#x43B;&#x430;&#x431;&#x43E; &#x441;&#x432;&#x44F;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x443;&#x436;&#x435; &#x438;&#x445;. &#x412;&#x43D;&#x443;&#x442;&#x440;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;, &#x435;&#x433;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;, &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x430; &#x438; &#x441;&#x442;&#x438;&#x43B;&#x438; &#x43D;&#x435;&#x440;&#x430;&#x437;&#x440;&#x44B;&#x432;&#x43D;&#x43E; &#x441;&#x432;&#x44F;&#x437;&#x430;&#x43D;&#x44B; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x441;&#x43E;&#x431;&#x43E;&#x439;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x441;&#x43F;&#x43B;&#x43E;&#x447;&#x451;&#x43D;&#x43D;&#x44B;&#x43C; &#x438; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x43C; &#x432; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x435;.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x43C; &#x43D;&#x435; &#x43D;&#x440;&#x430;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x438;&#x434;&#x435;&#x44F; &#x43E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x432;&#x44B; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438; &#x433;&#x43E;&#x440;&#x44F;&#x447;&#x435;&#x439; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x44B; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439; &#x438; &#x43F;&#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x435;&#x439;, &#x432;&#x44B;&#x434;&#x435;&#x43B;&#x438;&#x432; JavaScript &#x438; CSS &#x432; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B;:</p>
<pre><code class="hljs html"><span class="hljs-comment">&lt;!-- my-component.vue --&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">template</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">div</span>&gt;</span>&#x42D;&#x442;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x435;&#x434;&#x432;&#x430;&#x440;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x441;&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43E;<span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">template</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;./my-component.js&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">style</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;./my-component.css&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">style</span>&gt;</span></code></pre>
<h2 id="&#x41D;&#x430;&#x447;&#x430;&#x43B;&#x43E;-&#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B;"><a href="#&#x41D;&#x430;&#x447;&#x430;&#x43B;&#x43E;-&#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B;" class="headerlink" title="&#x41D;&#x430;&#x447;&#x430;&#x43B;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B;"></a>&#x41D;&#x430;&#x447;&#x430;&#x43B;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B;</h2><h3 id="&#x41F;&#x435;&#x441;&#x43E;&#x447;&#x43D;&#x438;&#x446;&#x430;-&#x441;-&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x43C;"><a href="#&#x41F;&#x435;&#x441;&#x43E;&#x447;&#x43D;&#x438;&#x446;&#x430;-&#x441;-&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x43C;" class="headerlink" title="&#x41F;&#x435;&#x441;&#x43E;&#x447;&#x43D;&#x438;&#x446;&#x430; &#x441; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x43C;"></a>&#x41F;&#x435;&#x441;&#x43E;&#x447;&#x43D;&#x438;&#x446;&#x430; &#x441; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x43C;</h3><p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x43F;&#x43E;&#x438;&#x433;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x43E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x43C;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x2014; &#x43D;&#x430;&#x447;&#x43D;&#x438;&#x442;&#x435; &#x441; &#x44D;&#x442;&#x43E;&#x433;&#x43E; <a href="https://codesandbox.io/s/o29j95wx9" target="_blank" rel="noopener">&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; todo &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;</a> &#x43D;&#x430; CodeSandbox.</p>
<h3 id="&#x414;&#x43B;&#x44F;-&#x43D;&#x43E;&#x432;&#x438;&#x447;&#x43A;&#x43E;&#x432;-&#x432;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x445;-&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x445;-&#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;-JavaScript"><a href="#&#x414;&#x43B;&#x44F;-&#x43D;&#x43E;&#x432;&#x438;&#x447;&#x43A;&#x43E;&#x432;-&#x432;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x445;-&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x445;-&#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;-JavaScript" class="headerlink" title="&#x414;&#x43B;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x447;&#x43A;&#x43E;&#x432; &#x432; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x445; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; JavaScript"></a>&#x414;&#x43B;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x447;&#x43A;&#x43E;&#x432; &#x432; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x445; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; JavaScript</h3><p>&#x421; <code>.vue</code>-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;, &#x43C;&#x44B; &#x432;&#x445;&#x43E;&#x434;&#x438;&#x43C; &#x432;&#x43E; &#x432;&#x441;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x443;&#x44E; &#x43F;&#x440;&#x43E;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x44B;&#x445; JavaScript-&#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;. &#x42D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x447;&#x442;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x435;&#x449;&#x451; &#x43D;&#x435; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B;&#x438;, &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x441;&#x432;&#x43E;&#x438;&#x442;&#x44C; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;:</p>
<ul>
<li><p><strong>Node Package Manager (NPM)</strong>: &#x41F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x439;&#x442;&#x435; <a href="https://docs.npmjs.com/getting-started/what-is-npm" target="_blank" rel="noopener">&#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x43E; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x443; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B;</a> &#x434;&#x43E; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x438;  <em>10: Uninstalling global packages</em>.</p>
</li>
<li><p><strong>&#x421;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x439; JavaScript &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x432; ES2015/16</strong>: &#x41F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x439;&#x442;&#x435; <a href="https://babeljs.io/docs/learn-es2015/" target="_blank" rel="noopener">&#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x43E; ES2015</a> &#x43E;&#x442; Babel. &#x41D;&#x435;&#x442; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x437;&#x430;&#x43F;&#x43E;&#x43C;&#x438;&#x43D;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x43D;&#x43E;&#x432;&#x44B;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x43D;&#x43E; &#x434;&#x435;&#x440;&#x436;&#x438;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x443; &#x43F;&#x43E;&#x434; &#x440;&#x443;&#x43A;&#x43E;&#x439; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x43E;&#x447;&#x43D;&#x438;&#x43A;&#x430;.</p>
</li>
</ul>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x43A; &#x432;&#x44B; &#x443;&#x434;&#x435;&#x43B;&#x438;&#x43B;&#x438; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x44D;&#x442;&#x438;&#x43C; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x430;&#x43C;, &#x43C;&#x44B; &#x441;&#x43E;&#x432;&#x435;&#x442;&#x443;&#x435;&#x43C; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x43D;&#x430; <a href="https://cli.vuejs.org/ru/" target="_blank" rel="noopener">Vue CLI 3</a>. &#x421;&#x43B;&#x435;&#x434;&#x443;&#x439;&#x442;&#x435; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x44F;&#x43C;, &#x438; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x441;&#x43A;&#x43E;&#x440;&#x43E; &#x443; &#x432;&#x430;&#x441; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x430;&#x431;&#x43E;&#x447;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442; &#x441; <code>.vue</code>-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;, ES2015, Webpack &#x438; &#x433;&#x43E;&#x440;&#x44F;&#x447;&#x435;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x43E;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439;.</p>
<h3 id="&#x414;&#x43B;&#x44F;-&#x43F;&#x440;&#x43E;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x44B;&#x445;-&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439;"><a href="#&#x414;&#x43B;&#x44F;-&#x43F;&#x440;&#x43E;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x44B;&#x445;-&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439;" class="headerlink" title="&#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439;"></a>&#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439;</h3><p>CLI &#x43F;&#x43E;&#x437;&#x430;&#x431;&#x43E;&#x442;&#x438;&#x442;&#x441;&#x44F; &#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43A; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441;, &#x43D;&#x43E; &#x43F;&#x440;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x44B;&#x435; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x438; &#x447;&#x435;&#x440;&#x435;&#x437; <a href="https://cli.vuejs.org/ru/config/" target="_blank" rel="noopener">&#x43E;&#x43F;&#x446;&#x438;&#x438; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438;</a>.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x435; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x44E; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x441; &#x43D;&#x443;&#x43B;&#x44F;, &#x442;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x44C; webpack &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; <a href="https://vue-loader.vuejs.org/ru/" target="_blank" rel="noopener">vue-loader</a>. &#x427;&#x442;&#x43E;&#x431;&#x44B; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43E; webpack, &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x43A; <a href="https://webpack.js.org/configuration/" target="_blank" rel="noopener">&#x435;&#x433;&#x43E; &#x43E;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438;</a> &#x438; <a href="https://webpack.academy/p/the-core-concepts" target="_blank" rel="noopener">Webpack Academy</a>.</p>

    
    
      <div class="guide-links">
        
        
          <span>&#x2190; <a href="/v2/guide/filters.html">&#x424;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x44B;</a></span>
        
        
        
          <span style="float: right;"><a href="/v2/guide/unit-testing.html">&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;</a> &#x2192;</span>
        
      </div>
    
    <div class="footer">
        <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
<div class="bsa-cpc"></div>
<script>
  (function(){
    if(typeof _bsa !== 'undefined' && _bsa) {
    _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
      target: '.bsa-cpc',
      align: 'horizontal',
      disable_css: 'true'
    });
      }
  })();
</script>

      &#x41E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x451; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;?
      <a href="https://github.com/translation-gang/ru.vuejs.org/blob/master/src/v2/guide/single-file-components.md" target="_blank">
        &#x41E;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43D;&#x430; GitHub!
      </a>
    </div>

</body>
</html>