<!DOCTYPE html>
<html lang="en" id="wrapper">
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Присоединяйтесь к сообществу Vue.js!</title>

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <link href="./style.css" rel="stylesheet" type="text/css">

    <!-- версия для разработки, отображает полезные предупреждения в консоли -->
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>

    <!-- production-версия, оптимизированная для размера и скорости -->
    <!--    <script src="https://cdn.jsdelivr.net/npm/vue"></script>-->

</head>
<body id="main">
<p>Спаршено с: <a href="https://ru.vuejs.org/v2/guide/join.html">https://ru.vuejs.org/v2/guide/join.html</a></p>

    
      
        

      
    
    
      <h1>&#x41F;&#x440;&#x438;&#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x44F;&#x439;&#x442;&#x435;&#x441;&#x44C; &#x43A; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443; Vue.js!</h1>
    
    
      <p>&#x421;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E; Vue &#x440;&#x430;&#x441;&#x442;&#x451;&#x442; &#x43F;&#x43E;&#x440;&#x430;&#x437;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E;, &#x438; &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x435; &#x44D;&#x442;&#x438; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438;, &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;, &#x447;&#x442;&#x43E; &#x438; &#x432;&#x44B; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x44B; &#x43A; &#x43D;&#x435;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x438;&#x442;&#x44C;&#x441;&#x44F;. &#x414;&#x43E;&#x431;&#x440;&#x43E; &#x43F;&#x43E;&#x436;&#x430;&#x43B;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x431;&#x43E;&#x440;&#x442;!</p>
<p>&#x41D;&#x438;&#x436;&#x435; &#x43C;&#x44B; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x436;&#x435;&#x43C;, &#x447;&#x442;&#x43E; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441;, &#x438; &#x447;&#x442;&#x43E; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;.</p>
<h2 id="&#x420;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B;"><a href="#&#x420;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B;" class="headerlink" title="&#x420;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B;"></a>&#x420;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B;</h2><h3 id="&#x41A;&#x43E;&#x434;&#x435;&#x43A;&#x441;-&#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F;"><a href="#&#x41A;&#x43E;&#x434;&#x435;&#x43A;&#x441;-&#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F;" class="headerlink" title="&#x41A;&#x43E;&#x434;&#x435;&#x43A;&#x441; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F;"></a>&#x41A;&#x43E;&#x434;&#x435;&#x43A;&#x441; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F;</h3><p>&#x41D;&#x430;&#x448; <a href="/coc">&#x43A;&#x43E;&#x434;&#x435;&#x43A;&#x441; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F;</a> &#x2014; &#x44D;&#x442;&#x43E; &#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x43E;, &#x43A;&#x430;&#x43A; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x432;&#x441;&#x435;&#x445; &#x43D;&#x430;&#x441; &#x438; &#x442;&#x435;&#x445;&#x43D;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43C;&#x44B; &#x443;&#x447;&#x430;&#x441;&#x442;&#x432;&#x443;&#x435;&#x43C;.</p>
<h3 id="&#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C;-&#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443;"><a href="#&#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C;-&#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443;" class="headerlink" title="&#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443;"></a>&#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443;</h3><ul>
<li><a href="https://forum.vuejs.org/" target="_blank" rel="noopener">&#x424;&#x43E;&#x440;&#x443;&#x43C;</a>: &#x41B;&#x443;&#x447;&#x448;&#x435;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432; &#x438; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x43E;&#x432; &#x43F;&#x43E; Vue &#x438; &#x435;&#x433;&#x43E; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435;.</li>
<li><a href="https://chat.vuejs.org/" target="_blank" rel="noopener">&#x427;&#x430;&#x442;</a>: &#x41C;&#x435;&#x441;&#x442;&#x43E; &#x432;&#x441;&#x442;&#x440;&#x435;&#x447; &#x438; &#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; Vue &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x438; &#x447;&#x430;&#x442; &#x432; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438;.</li>
<li><a href="https://events.vuejs.org/meetups" target="_blank" rel="noopener">&#x41C;&#x438;&#x442;&#x430;&#x43F;&#x44B;</a>: &#x425;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43C;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x445; &#x44D;&#x43D;&#x442;&#x443;&#x437;&#x438;&#x430;&#x441;&#x442;&#x43E;&#x432; Vue.js, &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43A;&#x430;&#x43A; &#x432;&#x44B;? &#x425;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x441;&#x442;&#x430;&#x442;&#x44C; &#x43B;&#x438;&#x434;&#x435;&#x440;&#x43E;&#x43C; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;? &#x41C;&#x44B; &#x43F;&#x43E;&#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C; &#x432;&#x430;&#x441; &#x437;&#x434;&#x435;&#x441;&#x44C;!</li>
<li><a href="https://github.com/vuejs" target="_blank" rel="noopener">GitHub</a>: GitHub issues &#x2014; &#x441;&#x430;&#x43C;&#x43E;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x431;&#x430;&#x433;&#x440;&#x435;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;, feature request&#x2019;&#x43E;&#x432;, &#x438; &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E; &#x436;&#x435; pull request&#x2019;&#x43E;&#x432;!</li>
</ul>
<h3 id="&#x418;&#x437;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435;-&#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B;"><a href="#&#x418;&#x437;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435;-&#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B;" class="headerlink" title="&#x418;&#x437;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B;"></a>&#x418;&#x437;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B;</h3><ul>
<li><a href="https://github.com/vuejs/awesome-vue" target="_blank" rel="noopener">&#x421;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430; The Awesome Vue</a>: &#x41F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x442;&#x435;, &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x435;&#x449;&#x451; &#x43A;&#x43B;&#x451;&#x432;&#x44B;&#x435; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B; &#x431;&#x44B;&#x43B;&#x438; &#x43E;&#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x44B; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C; &#x43A;&#x440;&#x443;&#x442;&#x44B;&#x43C; &#x43D;&#x430;&#x440;&#x43E;&#x434;&#x43E;&#x43C;.</li>
<li><a href="https://forum.vuejs.org/c/show-and-tell" target="_blank" rel="noopener">&#x41F;&#x43E;&#x434;&#x444;&#x43E;&#x440;&#x443;&#x43C; &#xAB;Show and Tell&#xBB;</a>: &#x415;&#x449;&#x451; &#x43E;&#x434;&#x43D;&#x43E; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x43E;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x43E; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x43D;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x44B; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x443;&#x447;&#x430;&#x441;&#x442;&#x43D;&#x438;&#x43A;&#x43E;&#x432; &#x440;&#x430;&#x441;&#x442;&#x443;&#x449;&#x435;&#x433;&#x43E; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430; Vue.</li>
</ul>
<h2 id="&#x427;&#x442;&#x43E;-&#x432;&#x44B;-&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435;-&#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;"><a href="#&#x427;&#x442;&#x43E;-&#x432;&#x44B;-&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435;-&#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;" class="headerlink" title="&#x427;&#x442;&#x43E; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;"></a>&#x427;&#x442;&#x43E; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;</h2><h3 id="&#x41F;&#x440;&#x438;&#x441;&#x43B;&#x430;&#x442;&#x44C;-&#x43A;&#x43E;&#x434;"><a href="#&#x41F;&#x440;&#x438;&#x441;&#x43B;&#x430;&#x442;&#x44C;-&#x43A;&#x43E;&#x434;" class="headerlink" title="&#x41F;&#x440;&#x438;&#x441;&#x43B;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434;"></a>&#x41F;&#x440;&#x438;&#x441;&#x43B;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434;</h3><p>&#x41A;&#x430;&#x43A; &#x438; &#x443; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x43E;&#x432;, &#x437;&#x434;&#x435;&#x441;&#x44C; &#x435;&#x441;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x438; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x430;. &#x427;&#x442;&#x43E;&#x431;&#x44B; &#x443;&#x434;&#x43E;&#x441;&#x442;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x43C;&#x44B; &#x441;&#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x43E;&#x43C;&#x43E;&#x447;&#x44C; &#x432;&#x430;&#x43C; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x44C; &#x432;&#x430;&#x448; pull request &#x432; &#x43A;&#x440;&#x430;&#x442;&#x447;&#x430;&#x439;&#x448;&#x438;&#x439; &#x441;&#x440;&#x43E;&#x43A;, &#x43F;&#x43E;&#x436;&#x430;&#x43B;&#x443;&#x439;&#x441;&#x442;&#x430; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x439;&#x442;&#x435; <a href="https://github.com/vuejs/vue/blob/dev/.github/CONTRIBUTING.md" target="_blank" rel="noopener">the contributing guide</a>.</p>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E;, &#x432;&#x44B; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x44B; &#x43F;&#x440;&#x438;&#x441;&#x43B;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x43A;&#x430;&#x43A; &#x432; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x435; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x438; Vue:</p>
<ul>
<li><a href="https://github.com/vuejs/vue" target="_blank" rel="noopener">Vue</a>: &#x44F;&#x434;&#x440;&#x43E; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430;</li>
<li><a href="https://github.com/vuejs/vuex" target="_blank" rel="noopener">Vuex</a>: Flux-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x430;&#x44F; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;&#x43C;</li>
<li><a href="https://github.com/vuejs/vue-router" target="_blank" rel="noopener">Vue-router</a>: &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440; &#x434;&#x43B;&#x44F; SPA</li>
</ul>
<p>&#x2026;&#x442;&#x430;&#x43A; &#x438; &#x432;&#x43E; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x43E;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; <a href="https://github.com/vuejs" target="_blank" rel="noopener">&#x441;&#x43E;&#x43F;&#x443;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x445; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;</a>.</p>
<h3 id="&#x41F;&#x43E;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x435;&#x441;&#x44C;-&#x441;&#x432;&#x43E;&#x438;&#x43C;-&#x43E;&#x43F;&#x44B;&#x442;&#x43E;&#x43C;-&#x438;-&#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x435;-&#x435;&#x433;&#x43E;"><a href="#&#x41F;&#x43E;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x435;&#x441;&#x44C;-&#x441;&#x432;&#x43E;&#x438;&#x43C;-&#x43E;&#x43F;&#x44B;&#x442;&#x43E;&#x43C;-&#x438;-&#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x435;-&#x435;&#x433;&#x43E;" class="headerlink" title="&#x41F;&#x43E;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x441;&#x432;&#x43E;&#x438;&#x43C; &#x43E;&#x43F;&#x44B;&#x442;&#x43E;&#x43C; (&#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x435; &#x435;&#x433;&#x43E;)"></a>&#x41F;&#x43E;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x441;&#x432;&#x43E;&#x438;&#x43C; &#x43E;&#x43F;&#x44B;&#x442;&#x43E;&#x43C; (&#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x435; &#x435;&#x433;&#x43E;)</h3><p>&#x41F;&#x43E;&#x43C;&#x438;&#x43C;&#x43E; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432; &#x438; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x43E;&#x432; &#x43D;&#x430; &#x444;&#x43E;&#x440;&#x443;&#x43C;&#x435; &#x438; &#x432; &#x447;&#x430;&#x442;&#x435;, &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x442; &#x438; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x44B;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43F;&#x43E;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x438;&#x43C;&#x435;&#x44E;&#x449;&#x438;&#x43C;&#x438;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x438; &#x43F;&#x440;&#x438;&#x43E;&#x431;&#x440;&#x435;&#x441;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x44B;&#x435;:</p>
<ul>
<li><strong>&#x421;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x43E;&#x431;&#x443;&#x447;&#x430;&#x44E;&#x449;&#x438;&#x435; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B;&#x44B;.</strong> &#x427;&#x430;&#x441;&#x442;&#x43E; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44F;&#x442;, &#x447;&#x442;&#x43E; &#x43B;&#x443;&#x447;&#x448;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#x43D;&#x430;&#x443;&#x447;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x2014; &#x44D;&#x442;&#x43E; &#x43D;&#x430;&#x443;&#x447;&#x438;&#x442;&#x44C;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442;&#x435; &#x441; Vue &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E;&#x435;, &#x43D;&#x435; &#x441;&#x442;&#x435;&#x441;&#x43D;&#x44F;&#x439;&#x442;&#x435;&#x441;&#x44C; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x441;&#x442; &#x432; &#x431;&#x43B;&#x43E;&#x433;&#x435;, &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x441;&#x442;&#x438; &#x432;&#x43E;&#x440;&#x43A;&#x448;&#x43E;&#x43F; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x441;&#x43E;&#x446;&#x441;&#x435;&#x442;&#x438; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x443; &#x43D;&#x430; gist.</li>
<li><strong>&#x41F;&#x43E;&#x434;&#x43F;&#x438;&#x448;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x43A;&#x430;&#x43A; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x43D;&#x430; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x432;&#x430;&#x441; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x439;.</strong> &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x432;&#x44B; &#x441;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x440;&#x430;&#x437;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x432; &#x44D;&#x442;&#x43E;&#x43C; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x447;&#x442;&#x43E;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x434;&#x430;&#x441;&#x442; &#x432;&#x430;&#x43C; &#x438;&#x43D;&#x441;&#x430;&#x439;&#x434;&#x435;&#x440;&#x441;&#x43A;&#x443;&#x44E; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E; &#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x44F;&#x449;&#x438;&#x445; &#x43E;&#x431;&#x441;&#x443;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F;&#x445; &#x438; &#x433;&#x440;&#x44F;&#x434;&#x443;&#x449;&#x438;&#x445; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F;&#x445;. &#x42D;&#x442;&#x43E; &#x2014; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x430;&#x44F; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43D;&#x430;&#x431;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x43F;&#x44B;&#x442;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x43E;&#x43C;&#x43E;&#x436;&#x435;&#x442; &#x432; &#x434;&#x430;&#x43B;&#x44C;&#x43D;&#x435;&#x439;&#x448;&#x435;&#x43C;.</li>
</ul>
<h3 id="&#x41F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x434;&#x438;&#x442;&#x435;-&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;"><a href="#&#x41F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x434;&#x438;&#x442;&#x435;-&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;" class="headerlink" title="&#x41F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x434;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;"></a>&#x41F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x434;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;</h3><p>Vue &#x443;&#x436;&#x435; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x43B;&#x441;&#x44F; &#x43F;&#x43E; &#x43F;&#x43B;&#x430;&#x43D;&#x435;&#x442;&#x435;: &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x430;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x430; &#x432; &#x43A;&#x430;&#x43A; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x443;&#x43C; &#x43F;&#x43E;&#x43B;&#x443;&#x434;&#x44E;&#x436;&#x438;&#x43D;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x437;&#x43E;&#x43D;. <a href="https://forum.vuejs.org/" target="_blank" rel="noopener">&#x424;&#x43E;&#x440;&#x443;&#x43C;</a> &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x435;&#x442; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x44B; &#x43D;&#x430; 7 &#x44F;&#x437;&#x44B;&#x43A;&#x430;&#x445;, &#x430; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44F; &#x2014; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; <a href="https://github.com/vuejs?utf8=%E2%9C%93&amp;query=vuejs.org" target="_blank" rel="noopener">&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x434;&#x44B;</a>. &#x41C;&#x44B; &#x433;&#x43E;&#x440;&#x434;&#x438;&#x43C;&#x441;&#x44F; &#x43C;&#x435;&#x436;&#x434;&#x443;&#x43D;&#x430;&#x440;&#x43E;&#x434;&#x43D;&#x44B;&#x43C; &#x440;&#x430;&#x437;&#x432;&#x438;&#x442;&#x438;&#x435;&#x43C; Vue &#x2014; &#x43D;&#x43E; &#x432;&#x441;&#x451; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x435;&#x449;&#x451; &#x43B;&#x443;&#x447;&#x448;&#x435;!</p>
<p>&#x41C;&#x44B; &#x43D;&#x430;&#x434;&#x435;&#x435;&#x43C;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x432;&#x44B; &#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x435; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x441;&#x432;&#x43E;&#x451;&#x43C; &#x440;&#x43E;&#x434;&#x43D;&#x43E;&#x43C; &#x44F;&#x437;&#x44B;&#x43A;&#x435;. &#x415;&#x441;&#x43B;&#x438; &#x43D;&#x435;&#x442; &#x2014; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C;, &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x435;&#x43B;&#x438; &#x431;&#x44B; &#x43F;&#x43E;&#x43C;&#x43E;&#x447;&#x44C; &#x441; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x434;&#x43E;&#x43C;?</p>
<p>&#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x444;&#x43E;&#x440;&#x43A;&#x43D;&#x438;&#x442;&#x435; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x439; <a href="https://github.com/vuejs/vuejs.org/" target="_blank" rel="noopener">&#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x439; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438;</a> &#x438;&#x43B;&#x438; &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x43E;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x43C;&#x43E;&#x439; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438;, &#x438; &#x43D;&#x430;&#x447;&#x43D;&#x438;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x434;. &#x41F;&#x43E; &#x434;&#x43E;&#x441;&#x442;&#x438;&#x436;&#x435;&#x43D;&#x438;&#x438; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x435;&#x441;&#x441;&#x430;, &#x43E;&#x442;&#x43A;&#x440;&#x43E;&#x439;&#x442;&#x435; issue &#x438;&#x43B;&#x438; pull request &#x432; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x43C; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x438;, &#x438; &#x43C;&#x44B; &#x43F;&#x43E;&#x437;&#x43E;&#x432;&#x451;&#x43C; &#x435;&#x449;&#x451; &#x43A;&#x43E;&#x433;&#x43E;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x432;&#x430;&#x43C; &#x432; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;.</p>
<h3 id="&#x421;&#x442;&#x430;&#x43D;&#x44C;&#x442;&#x435;-&#x43B;&#x438;&#x434;&#x435;&#x440;&#x43E;&#x43C;-&#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;"><a href="#&#x421;&#x442;&#x430;&#x43D;&#x44C;&#x442;&#x435;-&#x43B;&#x438;&#x434;&#x435;&#x440;&#x43E;&#x43C;-&#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;" class="headerlink" title="&#x421;&#x442;&#x430;&#x43D;&#x44C;&#x442;&#x435; &#x43B;&#x438;&#x434;&#x435;&#x440;&#x43E;&#x43C; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;"></a>&#x421;&#x442;&#x430;&#x43D;&#x44C;&#x442;&#x435; &#x43B;&#x438;&#x434;&#x435;&#x440;&#x43E;&#x43C; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;</h3><p>&#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43C;&#x43E;&#x447;&#x44C; Vue &#x440;&#x430;&#x441;&#x442;&#x438; &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;:</p>
<ul>
<li><strong>&#x412;&#x44B;&#x441;&#x442;&#x443;&#x43F;&#x438;&#x442;&#x435; &#x43D;&#x430; &#x43C;&#x435;&#x441;&#x442;&#x43D;&#x43E;&#x43C; &#x43C;&#x438;&#x442;&#x430;&#x43F;&#x435;.</strong> &#x420;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x44F; &#x43B;&#x438; &#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x434; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x44F; &#x441;&#x435;&#x43C;&#x438;&#x43D;&#x430;&#x440;, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x43D;&#x435;&#x441;&#x442;&#x438; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x443;&#x44E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443; &#x441;&#x432;&#x43E;&#x435;&#x43C;&#x443; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;, &#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x430;&#x44F; &#x43A;&#x430;&#x43A; &#x43D;&#x43E;&#x432;&#x44B;&#x43C;, &#x442;&#x430;&#x43A; &#x438; &#x43E;&#x43F;&#x44B;&#x442;&#x43D;&#x44B;&#x43C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C; Vue &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x430;&#x442;&#x44C; &#x440;&#x430;&#x441;&#x442;&#x438;.</li>
<li><strong>&#x41E;&#x440;&#x433;&#x430;&#x43D;&#x438;&#x437;&#x443;&#x439;&#x442;&#x435; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x438;&#x442;&#x430;&#x43F;.</strong> &#x415;&#x441;&#x43B;&#x438; &#x440;&#x44F;&#x434;&#x43E;&#x43C; &#x441; &#x432;&#x430;&#x43C;&#x438; &#x43D;&#x435;&#x442; &#x43C;&#x438;&#x442;&#x430;&#x43F;&#x43E;&#x432; &#x43F;&#x43E; Vue, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x440;&#x433;&#x430;&#x43D;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x439; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439;! &#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; <a href="https://events.vuejs.org/resources/#getting-started" target="_blank" rel="noopener">&#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B; &#x43D;&#x430; events.vuejs.org</a> &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x434;&#x43E;&#x431;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443;&#x441;&#x43F;&#x435;&#x445;&#x430;!</li>
<li><strong>&#x41F;&#x43E;&#x43C;&#x43E;&#x433;&#x438;&#x442;&#x435; &#x43E;&#x440;&#x433;&#x430;&#x43D;&#x438;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C; &#x43C;&#x438;&#x442;&#x430;&#x43F;&#x43E;&#x432;.</strong> &#x41D;&#x438;&#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x43F;&#x43E;&#x437;&#x434;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x438;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x434;&#x435;&#x43B;&#x43E; &#x434;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x434;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430; &#x43C;&#x435;&#x440;&#x43E;&#x43F;&#x440;&#x438;&#x44F;&#x442;&#x438;&#x44F;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x439;&#x442;&#x435; &#x43E;&#x440;&#x433;&#x430;&#x43D;&#x438;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C; &#x441;&#x432;&#x43E;&#x44E; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43C;&#x43E;&#x447;&#x44C; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x435; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x435; &#x443;&#x441;&#x43F;&#x435;&#x448;&#x43D;&#x44B;&#x43C;.</li>
</ul>
<p>&#x415;&#x441;&#x43B;&#x438; &#x443; &#x432;&#x430;&#x441; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x43A;&#x430;&#x43A;&#x438;&#x435;-&#x43B;&#x438;&#x431;&#x43E; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B; &#x43E; &#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x432;&#x43B;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E; Vue, &#x43D;&#x430;&#x43F;&#x438;&#x448;&#x438;&#x442;&#x435; &#x43D;&#x430;&#x43C; <a href="https://www.twitter.com/vuejs_events" target="_blank" rel="noopener">@Vuejs_Events</a>!</p>

    
    
      <div class="guide-links">
        
        
          <span>&#x2190; <a href="/v2/guide/comparison.html">&#x421;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C;&#x438; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430;&#x43C;&#x438;</a></span>
        
        
        
          <span style="float: right;"><a href="/v2/guide/team.html">&#x41F;&#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x44C;&#x442;&#x435;&#x441;&#x44C; &#x441; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43E;&#x439;</a> &#x2192;</span>
        
      </div>
    
    <div class="footer">
        <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
<div class="bsa-cpc"></div>
<script>
  (function(){
    if(typeof _bsa !== 'undefined' && _bsa) {
    _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
      target: '.bsa-cpc',
      align: 'horizontal',
      disable_css: 'true'
    });
      }
  })();
</script>

      &#x41E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x451; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;?
      <a href="https://github.com/translation-gang/ru.vuejs.org/blob/master/src/v2/guide/join.md" target="_blank">
        &#x41E;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43D;&#x430; GitHub!
      </a>
    </div>

</body>
</html>