<!DOCTYPE html>
<html lang="en" id="wrapper">
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Сравнение с другими фреймворками</title>

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <link href="./style.css" rel="stylesheet" type="text/css">

    <!-- версия для разработки, отображает полезные предупреждения в консоли -->
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>

    <!-- production-версия, оптимизированная для размера и скорости -->
    <!--    <script src="https://cdn.jsdelivr.net/npm/vue"></script>-->

</head>
<body id="main">
<p>Спаршено с: <a href="https://ru.vuejs.org/v2/guide/comparison.html">https://ru.vuejs.org/v2/guide/comparison.html</a></p>

    
      
        

      
    
    
      <h1>&#x421;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C;&#x438; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430;&#x43C;&#x438;</h1>
    
    
      <p>&#x41E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x43E;, &#x44D;&#x442;&#x43E;&#x442; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B; &#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x430; &#x2014; &#x441;&#x430;&#x43C;&#x44B;&#x439; &#x442;&#x440;&#x443;&#x434;&#x43D;&#x44B;&#x439; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F;, &#x43D;&#x43E; &#x43E;&#x43D; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x432;&#x430;&#x436;&#x435;&#x43D;. &#x412;&#x435;&#x440;&#x43E;&#x44F;&#x442;&#x43D;&#x43E;, &#x432;&#x44B; &#x443;&#x436;&#x435; &#x440;&#x435;&#x448;&#x430;&#x435;&#x442;&#x435; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; &#x442;&#x43E;&#x442; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x43E;&#x439; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A; &#x438;&#x43B;&#x438; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x443;, &#x430; &#x441;&#x44E;&#x434;&#x430; &#x432;&#x430;&#x441; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x43B;&#x43E; &#x436;&#x435;&#x43B;&#x430;&#x43D;&#x438;&#x435; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C;, &#x43D;&#x435; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442; &#x43B;&#x438; Vue &#x443;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x438; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x448;&#x443; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443;. &#x41D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441; &#x43C;&#x44B; &#x438; &#x43D;&#x430;&#x434;&#x435;&#x435;&#x43C;&#x441;&#x44F; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x438;&#x442;&#x44C;.</p>
<p>&#x41C;&#x44B; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x440;&#x430;&#x435;&#x43C;&#x441;&#x44F; &#x43D;&#x435; &#x431;&#x44B;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x434;&#x432;&#x437;&#x44F;&#x442;&#x44B;&#x43C;&#x438;. &#x411;&#x443;&#x434;&#x443;&#x447;&#x438; &#x447;&#x43B;&#x435;&#x43D;&#x430;&#x43C;&#x438; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x439; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; Vue, &#x43C;&#x44B;, &#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x435;&#x442;&#x441;&#x44F;, &#x441;&#x430;&#x43C;&#x438; &#x435;&#x433;&#x43E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43B;&#x44E;&#x431;&#x438;&#x43C;. &#x41D;&#x430; &#x43D;&#x430;&#x448; &#x432;&#x437;&#x433;&#x43B;&#x44F;&#x434;, &#x441; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C;&#x438; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430;&#x43C;&#x438; Vue &#x441;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43B;&#x443;&#x447;&#x448;&#x435;, &#x447;&#x435;&#x43C; &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x43B;&#x438;&#x431;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;. &#x415;&#x441;&#x43B;&#x438; &#x431;&#x44B; &#x43C;&#x44B; &#x43D;&#x435; &#x432;&#x435;&#x440;&#x438;&#x43B;&#x438; &#x432; &#x44D;&#x442;&#x43E;, &#x43C;&#x44B; &#x431;&#x44B; &#x43D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435; &#x438; &#x43D;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43B;&#x438; &#x43D;&#x430;&#x434; &#x44D;&#x442;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x43E;&#x43C;, &#x432;&#x435;&#x440;&#x43D;&#x43E;? &#x418; &#x442;&#x435;&#x43C; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435;, &#x43D;&#x430;&#x43C; &#x431;&#x44B; &#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x431;&#x44B;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x447;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x43C;&#x438; &#x438; &#x442;&#x43E;&#x447;&#x43D;&#x44B;&#x43C;&#x438; &#x432; &#x43E;&#x446;&#x435;&#x43D;&#x43A;&#x430;&#x445;. &#x412; &#x442;&#x435;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x438;&#x43C;&#x435;&#x44E;&#x442; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;, &#x43A;&#x430;&#x43A; &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x43E;&#x431;&#x448;&#x438;&#x440;&#x43D;&#x435;&#x439;&#x448;&#x430;&#x44F; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x445; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438; React&#x2019;&#x430; &#x438;&#x43B;&#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x430; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x432; &#x432;&#x43F;&#x43B;&#x43E;&#x442;&#x44C; &#x434;&#x43E; IE6 Knockout&#x2019;&#x43E;&#x43C;, &#x43C;&#x44B; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x440;&#x430;&#x435;&#x43C;&#x441;&#x44F; &#x43D;&#x435; &#x437;&#x430;&#x431;&#x44B;&#x442;&#x44C; &#x43E; &#x43D;&#x438;&#x445; &#x443;&#x43F;&#x43E;&#x43C;&#x44F;&#x43D;&#x443;&#x442;&#x44C;.</p>
<p>&#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43C;&#x44B; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E; &#x446;&#x435;&#x43D;&#x438;&#x43C; <strong>&#x432;&#x430;&#x448;&#x443;</strong> &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C; &#x432; &#x434;&#x435;&#x43B;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x430;&#x43D;&#x438;&#x44F; &#x430;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; &#x43C;&#x438;&#x440; JavaScript &#x440;&#x430;&#x437;&#x432;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x442;&#x440;&#x435;&#x43C;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;! &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x435; &#x43A;&#x430;&#x43A;&#x443;&#x44E;-&#x43B;&#x438;&#x431;&#x43E; &#x43D;&#x435;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x2014; &#x43F;&#x43E;&#x436;&#x430;&#x43B;&#x443;&#x439;&#x441;&#x442;&#x430;, &#x434;&#x430;&#x439;&#x442;&#x435; &#x43D;&#x430;&#x43C; &#x437;&#x43D;&#x430;&#x442;&#x44C;, <a href="https://github.com/vuejs/vuejs.org/issues/new?title=Inaccuracy+in+comparisons+guide" target="_blank" rel="noopener">&#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x432; issue &#x43D;&#x430; GitHub</a>.</p>
<h2 id="React"><a href="#React" class="headerlink" title="React"></a>React</h2><p>React &#x438; Vue &#x432;&#x43E; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x43C; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x438;. &#x41E;&#x43D;&#x438; &#x43E;&#x431;&#x430;:</p>
<ul>
<li>&#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442; Virtual DOM</li>
<li>&#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43D;&#x443;&#x44E; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;</li>
<li>&#x444;&#x43E;&#x43A;&#x443;&#x441;&#x438;&#x440;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x43E;&#x439; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x435;, &#x432;&#x44B;&#x43D;&#x43E;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B;, &#x442;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x430;&#x43A; &#x440;&#x43E;&#x443;&#x442;&#x438;&#x43D;&#x433; &#x438;&#x43B;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x432; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438;</li>
</ul>
<p>&#x418;&#x437;-&#x437;&#x430; &#x441;&#x442;&#x43E;&#x43B;&#x44C; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x438;&#x445; &#x43D;&#x438;&#x448;, &#x43C;&#x44B; &#x443;&#x434;&#x435;&#x43B;&#x438;&#x43B;&#x438; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x44E; &#x44D;&#x442;&#x438;&#x445; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x43E;&#x432; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438;. &#x41D;&#x430;&#x448;&#x435;&#x439; &#x446;&#x435;&#x43B;&#x44C;&#x44E; &#x431;&#x44B;&#x43B;&#x43E; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x443;&#x434;&#x43E;&#x441;&#x442;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x442;&#x435;&#x445;&#x43D;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x439; &#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x438; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x438;&#x442;&#x44C; &#x431;&#x430;&#x43B;&#x430;&#x43D;&#x441;. &#x41C;&#x44B; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C;, &#x433;&#x434;&#x435; React &#x43F;&#x440;&#x435;&#x432;&#x43E;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; Vue, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x2014; &#x432; &#x431;&#x43E;&#x433;&#x430;&#x442;&#x441;&#x442;&#x432;&#x435; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B; &#x438; &#x438;&#x437;&#x43E;&#x431;&#x438;&#x43B;&#x438;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x445; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438;.</p>
<p>&#x422;&#x435;&#x43C; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435;, &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x2014; &#x432; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x43E;&#x439; &#x43C;&#x435;&#x440;&#x435; &#x441;&#x443;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;, &#x438; &#x432;&#x438;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x438;&#x437;&#x431;&#x435;&#x436;&#x43D;&#x44B;&#x43C; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;&#x43C; React &#x434;&#x430;&#x43B;&#x44C;&#x43D;&#x435;&#x439;&#x448;&#x435;&#x435; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x441;&#x451; &#x440;&#x430;&#x432;&#x43D;&#x43E; &#x43F;&#x43E;&#x43A;&#x430;&#x436;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x435;&#x434;&#x432;&#x437;&#x44F;&#x442;&#x44B;&#x43C;. &#x41C;&#x44B; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x43C;, &#x447;&#x442;&#x43E; &#x438; &#x432; &#x442;&#x435;&#x445;&#x43D;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430;&#x445; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x442; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x432;&#x43A;&#x443;&#x441;&#x430;, &#x438; &#x432; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x43C; &#x441;&#x442;&#x430;&#x432;&#x438;&#x43C; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x446;&#x435;&#x43B;&#x44C;&#x44E; &#x432; &#x44D;&#x442;&#x43E;&#x43C; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x44B;, &#x43F;&#x43E; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C; Vue &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x43C; &#x2014; &#x43D;&#x430; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x439; &#x435;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x448;&#x438; &#x432;&#x43A;&#x443;&#x441;&#x44B; &#x441;&#x43E;&#x432;&#x43F;&#x430;&#x434;&#x430;&#x44E;&#x442; &#x441; &#x43D;&#x430;&#x448;&#x438;&#x43C;&#x438;.</p>
<p>&#x41D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x438;&#x437; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x451;&#x43D;&#x43D;&#x44B;&#x445; &#x43D;&#x438;&#x436;&#x435; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x43E;&#x432; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x443;&#x441;&#x442;&#x430;&#x440;&#x435;&#x432;&#x448;&#x438;&#x43C;&#x438; &#x438;&#x437;-&#x437;&#x430; &#x43D;&#x435;&#x434;&#x430;&#x432;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x432; React 16+, &#x438; &#x43C;&#x44B; &#x43F;&#x43B;&#x430;&#x43D;&#x438;&#x440;&#x443;&#x435;&#x43C; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x441; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x43C; React &#x434;&#x43B;&#x44F; &#x430;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x430; &#x432; &#x431;&#x43B;&#x438;&#x436;&#x430;&#x439;&#x448;&#x435;&#x43C; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43C;.</p>
<h3 id="&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;-&#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;"><a href="#&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;-&#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;" class="headerlink" title="&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;"></a>&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;</h3><p>&#x41A;&#x430;&#x43A; React, &#x442;&#x430;&#x43A; &#x438; Vue &#x2014; &#x438;&#x441;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x44B;&#x435;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x44C; &#x432;&#x440;&#x44F;&#x434; &#x43B;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x435;&#x448;&#x430;&#x44E;&#x449;&#x438;&#x43C; &#x444;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x43F;&#x440;&#x438; &#x432;&#x44B;&#x431;&#x43E;&#x440;&#x435; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x43D;&#x438;&#x43C;&#x438;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x441; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x443;&#x44E;&#x442; &#x446;&#x438;&#x444;&#x440;&#x44B;, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x437;&#x443;&#x447;&#x438;&#x442;&#x44C; <a href="https://stefankrause.net/js-frameworks-benchmark8/table.html" target="_blank" rel="noopener">&#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x43D;&#x435;&#x435; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;</a>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x444;&#x43E;&#x43A;&#x443;&#x441;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x441;&#x44B;&#x440;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438;/&#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x435;&#x440;&#x435;&#x432;&#x430; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;.</p>
<h4 id="&#x423;&#x441;&#x438;&#x43B;&#x438;&#x44F;-&#x434;&#x43B;&#x44F;-&#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;"><a href="#&#x423;&#x441;&#x438;&#x43B;&#x438;&#x44F;-&#x434;&#x43B;&#x44F;-&#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;" class="headerlink" title="&#x423;&#x441;&#x438;&#x43B;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;"></a>&#x423;&#x441;&#x438;&#x43B;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;</h4><p>&#x412; React &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F;, &#x43E;&#x43D;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x443;&#x44E; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x443; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x435;&#x432;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;, &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44F; &#x441; &#x441;&#x435;&#x431;&#x44F;. &#x427;&#x442;&#x43E;&#x431;&#x44B; &#x438;&#x437;&#x431;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x43D;&#x443;&#x436;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E;&#x439; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x432;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43B;&#x438;&#x431;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; <code>PureComponent</code>, &#x43B;&#x438;&#x431;&#x43E; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x442;&#x44C; <code>shouldComponentUpdate</code> &#x432;&#x435;&#x437;&#x434;&#x435; &#x433;&#x434;&#x435; &#x44D;&#x442;&#x43E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;. &#x412;&#x430;&#x43C; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x43C;&#x44B;&#x435; (immutable) &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x44B; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x43C;&#x438; &#x43A; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;, &#x432; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445; &#x432;&#x44B; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x440;&#x430;&#x441;&#x441;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x442;&#x430;&#x43A;&#x443;&#x44E; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44E;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; <code>PureComponent/shouldComponentUpdate</code> &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x44E;&#x442;, &#x447;&#x442;&#x43E; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x435;&#x432;&#x430; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;. &#x415;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x43D;&#x435; &#x442;&#x430;&#x43A;, &#x442;&#x43E; &#x442;&#x430;&#x43A;&#x430;&#x44F; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43A; &#x43D;&#x435;&#x441;&#x43E;&#x433;&#x43B;&#x430;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44E; DOM.</p>
<p>&#x412;&#x43E; Vue &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x432;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x435;&#x442;, &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x438; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F;. &#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x430;&#x43A; &#x438;&#x43C;&#x435;&#x44E;&#x449;&#x438;&#x439; <code>shouldComponentUpdate</code>, &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441;, &#x431;&#x435;&#x437; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x432;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;.</p>
<p>&#x412; &#x446;&#x435;&#x43B;&#x43E;&#x43C;, &#x44D;&#x442;&#x43E; &#x443;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x44F;&#x435;&#x442; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x44C; &#x446;&#x435;&#x43B;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x441;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x43E;&#x442;&#x43E;&#x447;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x438;&#x438; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E; &#x43C;&#x435;&#x440;&#x435; &#x435;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;.</p>
<h3 id="HTML-amp-CSS"><a href="#HTML-amp-CSS" class="headerlink" title="HTML &amp; CSS"></a>HTML &amp; CSS</h3><p>&#x412; React &#x430;&#x431;&#x441;&#x43E;&#x43B;&#x44E;&#x442;&#x43D;&#x43E; &#x432;&#x441;&#x451; &#x2014; &#x44D;&#x442;&#x43E; JavaScript. &#x41D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x44B; HTML, &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; JSX, &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x435; &#x442;&#x435;&#x43D;&#x434;&#x435;&#x43D;&#x446;&#x438;&#x438; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x442; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; CSS &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; JavaScript. &#x42D;&#x442;&#x43E;&#x442; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x441;&#x432;&#x43E;&#x438; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;, &#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x438;&#x434;&#x442;&#x438; &#x43D;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x440;&#x43E;&#x43C;&#x438;&#x441;&#x441;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;.</p>
<p>Vue &#x43E;&#x445;&#x432;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x432;&#x435;&#x431;-&#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x438; &#x438; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43D;&#x438;&#x445;. &#x427;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x43C;&#x44B; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x43C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x432;.</p>
<h4 id="JSX-vs-&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;"><a href="#JSX-vs-&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;" class="headerlink" title="JSX vs &#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;"></a>JSX vs &#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B;</h4><p>&#x412; React &#x432;&#x441;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x443;&#x44E;&#x442; &#x441;&#x432;&#x43E;&#x439; UI &#x432; render-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;&#x445; &#x441; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;&#x43C; JSX, &#x434;&#x435;&#x43A;&#x43B;&#x430;&#x440;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C; XML-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x43C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x43E;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x432; JavaScript.</p>
<p>Render-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x441; JSX &#x438;&#x43C;&#x435;&#x44E;&#x442; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;:</p>
<ul>
<li><p>&#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x44F;&#x437;&#x44B;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; (JavaScript) &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x432;&#x43E;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;. &#x42D;&#x442;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x435;&#x442; &#x432; &#x441;&#x435;&#x431;&#x44F; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x435;, &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x435;&#x442;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x438; &#x43F;&#x440;&#x44F;&#x43C;&#x44B;&#x435; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x438; &#x43D;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; JavaScript &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;.</p>
</li>
<li><p>&#x41F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x430; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43B;&#x438;&#x43D;&#x442;&#x438;&#x43D;&#x433;, &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x430; &#x442;&#x438;&#x43F;&#x43E;&#x432;, &#x430;&#x432;&#x442;&#x43E;&#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x435;) &#x434;&#x43B;&#x44F; JSX &#x432; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43E;&#x442;&#x43D;&#x43E;&#x448;&#x435;&#x43D;&#x438;&#x44F;&#x445; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x430;, &#x447;&#x435;&#x43C; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E; &#x432; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x435;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x434;&#x43B;&#x44F; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432; Vue.</p>
</li>
</ul>
<p>&#x412;&#x43E; Vue &#x443; &#x43D;&#x430;&#x441; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x435;&#x441;&#x442;&#x44C; <a href="render-function.html"><code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;</a> &#x438; &#x434;&#x430;&#x436;&#x435; <a href="render-function.html#JSX">&#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x430; JSX</a>, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; &#x438;&#x43D;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x430;&#x43C; &#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x44D;&#x442;&#x438; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x422;&#x435;&#x43C; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435;, &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; &#x43C;&#x44B; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x43C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x43A;&#x430;&#x43A; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x443;&#x44E; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x443;. &#x41B;&#x44E;&#x431;&#x43E;&#x439; &#x432;&#x430;&#x43B;&#x438;&#x434;&#x43D;&#x44B;&#x439; HTML &#x442;&#x430;&#x43A;&#x436;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x430;&#x43B;&#x438;&#x434;&#x43D;&#x44B;&#x43C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x43C; Vue, &#x438; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442; &#x43A; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x43C; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;&#x43C;:</p>
<ul>
<li><p>&#x414;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x445; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x442; &#x441; HTML, &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x435;&#x441;&#x442;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B; &#x434;&#x43B;&#x44F; &#x447;&#x442;&#x435;&#x43D;&#x438;&#x44F; &#x438; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F;. &#x421;&#x430;&#x43C;&#x43E; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x447;&#x442;&#x435;&#x43D;&#x438;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x443;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C;, &#x43D;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x434;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C;, &#x442;&#x43E; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43D;&#x430;&#x43B;&#x438;&#x446;&#x43E;.</p>
</li>
<li><p>HTML-&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x43E;&#x431;&#x43B;&#x435;&#x433;&#x447;&#x430;&#x44E;&#x442; &#x43F;&#x43E;&#x441;&#x442;&#x435;&#x43F;&#x435;&#x43D;&#x43D;&#x443;&#x44E; &#x43C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44E; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x438; Vue.</p>
</li>
<li><p>&#x42D;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43E;&#x431;&#x43B;&#x435;&#x433;&#x447;&#x430;&#x435;&#x442; &#x434;&#x438;&#x437;&#x430;&#x439;&#x43D;&#x435;&#x440;&#x430;&#x43C; &#x438; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x43E;&#x43F;&#x44B;&#x442;&#x43D;&#x44B;&#x43C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C; &#x440;&#x430;&#x437;&#x431;&#x438;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x438; &#x432;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x434;&#x43E;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x432; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x443;&#x44E; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x443;&#x44E; &#x431;&#x430;&#x437;&#x443;.</p>
</li>
<li><p>&#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x430;&#x436;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x44B;, &#x442;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x430;&#x43A; Pug (&#x440;&#x430;&#x43D;&#x435;&#x435; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x439; &#x43A;&#x430;&#x43A; Jade), &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x430;&#x448;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x432;&#x43E; Vue.</p>
</li>
</ul>
<p>&#x41D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x443;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x430;&#x44E;&#x442;, &#x447;&#x442;&#x43E; &#x432;&#x430;&#x436;&#x43D;&#x43E; &#x438;&#x437;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x44F;&#x437;&#x44B;&#x43A; DSL (Domain-Specific Language) &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432; &#x2014; &#x43C;&#x44B; &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x43C;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x430; &#x440;&#x430;&#x437;&#x43D;&#x438;&#x446;&#x430; &#x432; &#x43B;&#x443;&#x447;&#x448;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x445;&#x43D;&#x43E;&#x441;&#x442;&#x43D;&#x430;. &#x412;&#x43E;-&#x43F;&#x435;&#x440;&#x432;&#x44B;&#x445;, JSX &#x43D;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x435;&#x442;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44E; &#x43D;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x443;&#x447;&#x438;&#x442;&#x44C; &#x2014; &#x44D;&#x442;&#x43E; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; JavaScript, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43E;&#x43D; &#x43F;&#x440;&#x43E;&#x441;&#x442; &#x432; &#x43E;&#x441;&#x432;&#x43E;&#x435;&#x43D;&#x438;&#x438; &#x434;&#x43B;&#x44F; &#x43B;&#x44E;&#x431;&#x43E;&#x433;&#x43E;, &#x43A;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; &#x441; JavaScript, &#x43D;&#x43E; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x435;&#x445;, &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x437;&#x430;&#x431;&#x43B;&#x443;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x435;&#x43C;. &#x422;&#x43E;&#x447;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x43E;&#x43C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x445; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; HTML &#x438;, &#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;, &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43D;&#x438;&#x437;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x440;&#x43E;&#x433; &#x432;&#x445;&#x43E;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445;, &#x43A;&#x442;&#x43E; &#x443;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; &#x441; HTML. &#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; DSL &#x43C;&#x44B; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x43E;&#x43C;&#x43E;&#x447;&#x44C; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x441; &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x438;&#x43C; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x43C; &#x43A;&#x43E;&#x434;&#x430; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x441; <code>v-on</code> &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438;). &#x41F;&#x43E;&#x445;&#x43E;&#x436;&#x430;&#x44F; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C; &#x432; &#x441;&#x435;&#x431;&#x44F; &#x43D;&#x430;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43A;&#x43E;&#x434;&#x430; &#x43F;&#x440;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x439; JSX &#x438;&#x43B;&#x438; render-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x439;.</p>
<p>&#x41D;&#x430; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E;&#x43C; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x43D;&#x430; &#x434;&#x432;&#x435; &#x43A;&#x430;&#x442;&#x435;&#x433;&#x43E;&#x440;&#x438;&#x438;: &#x43F;&#x440;&#x435;&#x437;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x435; &#x438; &#x43B;&#x43E;&#x433;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435;. &#x41C;&#x44B; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x435;&#x437;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x438; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; / JSX &#x434;&#x43B;&#x44F; &#x43B;&#x43E;&#x433;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445;. &#x41F;&#x440;&#x43E;&#x446;&#x435;&#x43D;&#x442;&#x43D;&#x43E;&#x435; &#x441;&#x43E;&#x43E;&#x442;&#x43D;&#x43E;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x44D;&#x442;&#x438;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x442; &#x43E;&#x442; &#x442;&#x438;&#x43F;&#x430; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x43D;&#x43E; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x437;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x44B;.</p>
<h4 id="&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x439;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43D;&#x44B;&#x439;-CSS"><a href="#&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x439;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43D;&#x44B;&#x439;-CSS" class="headerlink" title="&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; (&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43D;&#x44B;&#x439;) CSS"></a>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; (&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43D;&#x44B;&#x439;) CSS</h4><p>&#x417;&#x430; &#x438;&#x441;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x43D;&#x430; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43F;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x43E;&#x43C; <a href="https://github.com/gajus/react-css-modules" target="_blank" rel="noopener">CSS-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439;</a>), &#x434;&#x43B;&#x44F; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; CSS &#x432; React &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434; CSS-in-JS (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, <a href="https://github.com/styled-components/styled-components" target="_blank" rel="noopener">styled-components</a>, <a href="https://github.com/paypal/glamorous" target="_blank" rel="noopener">glamorous</a> &#x438; <a href="https://github.com/emotion-js/emotion" target="_blank" rel="noopener">emotion</a>). &#x42D;&#x442;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x43E;&#x431;&#x43E;&#x439; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43D;&#x43E;-&#x43E;&#x440;&#x438;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x43A; &#x441;&#x442;&#x438;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x442; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; CSS. &#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43D;&#x435;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443; &#x438;&#x437;&#x432;&#x43B;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x44F; CSS &#x432; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x441;&#x442;&#x438;&#x43B;&#x435;&#x439; &#x43D;&#x430; &#x44D;&#x442;&#x430;&#x43F;&#x435; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;, &#x43F;&#x43E;-&#x43F;&#x440;&#x435;&#x436;&#x43D;&#x435;&#x43C;&#x443; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x432;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x431;&#x44B;&#x43B;&#x438; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x44B; &#x432; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x443; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441;&#x442;&#x438;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;. &#x412; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F;, &#x43A;&#x430;&#x43A; &#x432;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x438;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x438; JavaScript &#x43F;&#x440;&#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x438; &#x432;&#x430;&#x448;&#x438;&#x445; &#x441;&#x442;&#x438;&#x43B;&#x435;&#x439;, &#x44D;&#x442;&#x43E;&#x442; &#x43A;&#x43E;&#x43C;&#x43F;&#x440;&#x43E;&#x43C;&#x438;&#x441;&#x441; &#x437;&#x430;&#x447;&#x430;&#x441;&#x442;&#x443;&#x44E; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x438; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x43F;&#x43E;&#x43A;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x43A; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x430; CSS-in-JS &#x2014; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x44B;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44E;&#x442; Vue (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, <a href="https://github.com/styled-components/vue-styled-components" target="_blank" rel="noopener">styled-components-vue</a> &#x438; <a href="https://github.com/egoist/vue-emotion" target="_blank" rel="noopener">vue-emotion</a>). &#x413;&#x43B;&#x430;&#x432;&#x43D;&#x44B;&#x43C; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x438;&#x435;&#x43C; &#x43C;&#x435;&#x436;&#x434;&#x443; React &#x438; Vue &#x437;&#x434;&#x435;&#x441;&#x44C; &#x431;&#x443;&#x434;&#x435;&#x442; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; &#x441;&#x442;&#x438;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; Vue &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x44B;&#x435; &#x442;&#x435;&#x433;&#x438; <code>style</code> &#x432; <a href="single-file-components.html">&#x43E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x445;</a>.</p>
<p><a href="single-file-components.html">&#x41E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;</a> &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; CSS &#x432; &#x442;&#x43E;&#x43C; &#x436;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x435;, &#x447;&#x442;&#x43E; &#x438; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x434;&#x430; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;.</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">style</span> <span class="hljs-attr">scoped</span>&gt;</span><span class="css">
  @<span class="hljs-keyword">media</span> (min-width: <span class="hljs-number">250px</span>) {
    <span class="hljs-selector-class">.list-container</span><span class="hljs-selector-pseudo">:hover</span> {
      <span class="hljs-attribute">background</span>: orange;
    }
  }
</span><span class="hljs-tag">&lt;/<span class="hljs-name">style</span>&gt;</span></code></pre>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>scoped</code> &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; CSS &#x442;&#x435;&#x43A;&#x443;&#x449;&#x438;&#x43C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x43C;, &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x44F; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B; (&#x442;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x430;&#x43A; <code>data-v-1-21e5b78</code>), &#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x443;&#x44F; <code>.list-container:hover</code> &#x432;&#x43E; &#x447;&#x442;&#x43E;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x432;&#x440;&#x43E;&#x434;&#x435; <code>.list-container[data-v-1-21e5b78]:hover</code>.</p>
<p>&#x41D;&#x430;&#x43A;&#x43E;&#x43D;&#x435;&#x446;, &#x441;&#x442;&#x438;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x445; Vue &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x433;&#x438;&#x431;&#x43A;&#x430;. &#x421; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <a href="https://github.com/vuejs/vue-loader" target="_blank" rel="noopener">vue-loader</a>, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x43F;&#x440;&#x435;&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;, &#x43F;&#x43E;&#x441;&#x442;&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440; &#x438; &#x434;&#x430;&#x436;&#x435; &#x433;&#x43B;&#x443;&#x431;&#x43E;&#x43A;&#x443;&#x44E; &#x438;&#x43D;&#x442;&#x435;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44E; &#x441; <a href="https://vue-loader.vuejs.org/ru/features/css-modules.html" target="_blank" rel="noopener">CSS-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;&#x43C;&#x438;</a> &#x2014; &#x432;&#x441;&#x451; &#x432; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x435; <code>&lt;style&gt;</code>.</p>
<h3 id="&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;"><a href="#&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;" class="headerlink" title="&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;"></a>&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;</h3><h4 id="&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;-&#x432;&#x432;&#x435;&#x440;&#x445;"><a href="#&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;-&#x432;&#x432;&#x435;&#x440;&#x445;" class="headerlink" title="&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x432;&#x435;&#x440;&#x445;"></a>&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x432;&#x435;&#x440;&#x445;</h4><p>&#x414;&#x43B;&#x44F; &#x43A;&#x440;&#x443;&#x43F;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;, &#x43A;&#x430;&#x43A; Vue &#x442;&#x430;&#x43A; &#x438; React &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442; &#x43D;&#x430;&#x434;&#x451;&#x436;&#x43D;&#x44B;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x443;&#x442;&#x438;&#x43D;&#x433;&#x430;. &#x421;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E; React &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x43E;&#x440;&#x43E;&#x434;&#x438;&#x43B;&#x43E; &#x432;&#x435;&#x441;&#x44C;&#x43C;&#x430; &#x438;&#x43D;&#x43D;&#x43E;&#x432;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; (&#x441;&#x43C;. Flux/Redux). &#x42D;&#x442;&#x438; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x44B;, &#x438; <a href="https://yarnpkg.com/en/packages?q=redux%20vue&amp;p=1" target="_blank" rel="noopener">&#x434;&#x430;&#x436;&#x435; &#x441;&#x430;&#x43C; Redux</a> &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x438;&#x43D;&#x442;&#x435;&#x433;&#x440;&#x438;&#x440;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x432; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x430; Vue. &#x412; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;, Vue &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x448;&#x430;&#x433;, &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432; <a href="https://github.com/vuejs/vuex" target="_blank" rel="noopener">Vuex</a> &#x2014; &#x432;&#x434;&#x43E;&#x445;&#x43D;&#x43E;&#x432;&#x43B;&#x451;&#x43D;&#x43D;&#x443;&#x44E; Elm &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44E; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D;&#x430; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;. Vuex &#x433;&#x43B;&#x443;&#x431;&#x43E;&#x43A;&#x43E; &#x438;&#x43D;&#x442;&#x435;&#x433;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D; &#x441; Vue, &#x447;&#x442;&#x43E;, &#x43D;&#x430; &#x43D;&#x430;&#x448; &#x432;&#x437;&#x433;&#x43B;&#x44F;&#x434;, &#x438;&#x437;&#x440;&#x44F;&#x434;&#x43D;&#x43E; &#x43E;&#x431;&#x43B;&#x435;&#x433;&#x447;&#x430;&#x435;&#x442; &#x436;&#x438;&#x437;&#x43D;&#x44C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C;.</p>
<p>&#x412; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x435;&#x449;&#x451; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x430;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x438;&#x44F; &#x43C;&#x435;&#x436;&#x434;&#x443; React &#x438; Vue &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43F;&#x43E;&#x43C;&#x44F;&#x43D;&#x443;&#x442;&#x44C; &#x442;&#x43E;&#x442; &#x444;&#x430;&#x43A;&#x442;, &#x447;&#x442;&#x43E; &#x432;&#x441;&#x435; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; Vue, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44F; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x438; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x443;&#x442;&#x438;&#x43D;&#x433;&#x430; (&#x441;&#x440;&#x435;&#x434;&#x438; <a href="https://github.com/vuejs" target="_blank" rel="noopener">&#x43F;&#x440;&#x43E;&#x447;&#x438;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447;</a>), &#x43E;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x432; &#x430;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; &#x44F;&#x434;&#x440;&#x43E;&#x43C; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438;. React, &#x43D;&#x430;&#x43F;&#x440;&#x43E;&#x442;&#x438;&#x432;, &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442; &#x43E;&#x442;&#x434;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x438; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B; &#x43D;&#x430; &#x43E;&#x442;&#x43A;&#x443;&#x43F; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;, &#x442;&#x435;&#x43C; &#x441;&#x430;&#x43C;&#x44B;&#x43C; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x444;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x443;&#x44E; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443;. &#x412;&#x43F;&#x440;&#x43E;&#x447;&#x435;&#x43C;, &#x43A;&#x430;&#x43A; &#x443;&#x436;&#x435; &#x437;&#x430;&#x43C;&#x435;&#x447;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x440;&#x430;&#x43D;&#x435;&#x435;, &#x432; &#x441;&#x438;&#x43B;&#x443; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x441;&#x442;&#x438; React, &#x435;&#x433;&#x43E; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x431;&#x448;&#x438;&#x440;&#x43D;&#x435;&#x435;, &#x447;&#x435;&#x43C; &#x443; Vue.</p>
<p>&#x41D;&#x430;&#x43A;&#x43E;&#x43D;&#x435;&#x446;, &#x443; Vue &#x435;&#x441;&#x442;&#x44C; <a href="https://github.com/vuejs/vue-cli" target="_blank" rel="noopener">CLI &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x43E;&#x432;</a>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x442;&#x435;&#x440;&#x430;. &#x415;&#x433;&#x43E; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x43B;&#x44F; <a href="https://cli.vuejs.org/ru/guide/prototyping.html#%D0%BC%D0%B3%D0%BD%D0%BE%D0%B2%D0%B5%D0%BD%D0%BD%D0%BE%D0%B5-%D0%BF%D1%80%D0%BE%D1%82%D0%BE%D1%82%D0%B8%D0%BF%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5" target="_blank" rel="noopener">&#x43C;&#x433;&#x43D;&#x43E;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;</a> &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;. React &#x442;&#x430;&#x43A;&#x436;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; &#x443;&#x441;&#x43F;&#x435;&#x445;&#x438; &#x432; &#x44D;&#x442;&#x43E;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <a href="https://github.com/facebookincubator/create-react-app" target="_blank" rel="noopener">create-react-app</a>, &#x43D;&#x43E; &#x432; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x435;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x443; &#x43D;&#x435;&#x433;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x439;:</p>
<ul>
<li>&#x41E;&#x43D; &#x43D;&#x435; &#x434;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x442; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438; &#x432;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430;, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; Vue CLI &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x445; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x435;&#x43C;&#x43E;&#x439; runtime-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <a href="https://cli.vuejs.org/ru/guide/plugins-and-presets.html#%D0%BFn%D0%B0%D0%B3%D0%B8%D0%BD%D1%8B" target="_blank" rel="noopener">&#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x43E;&#x432;</a>.</li>
<li>&#x421;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x434;&#x438;&#x43D; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x434;&#x43B;&#x44F; &#x43E;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; Vue &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x438;&#x439; &#x432;&#x44B;&#x431;&#x43E;&#x440; &#x43E;&#x43F;&#x446;&#x438;&#x439; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x446;&#x435;&#x43B;&#x435;&#x439; &#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;.</li>
<li>&#x41D;&#x435;&#x442; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B; &#x438;&#x437; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x445; <a href="https://cli.vuejs.org/ru/guide/plugins-and-presets.html#%D0%BF%D1%80%D0%B5%D1%81%D0%B5%D1%82%D1%8B-%D0%BD%D0%B0%D1%81%D1%82%D1%80%D0%BE%D0%B5%D0%BA" target="_blank" rel="noopener">&#x43F;&#x440;&#x435;&#x441;&#x435;&#x442;&#x43E;&#x432; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43A;</a>, &#x447;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; enterprise-&#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x441; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x432;&#x448;&#x438;&#x43C;&#x438;&#x441;&#x44F; &#x440;&#x430;&#x43D;&#x435;&#x435; &#x441;&#x43E;&#x433;&#x43B;&#x430;&#x448;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438;.</li>
</ul>
<p>&#x412;&#x430;&#x436;&#x43D;&#x43E; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x438;&#x437; &#x44D;&#x442;&#x438;&#x445; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x2014; &#x441;&#x43B;&#x435;&#x434;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x441;&#x43E;&#x437;&#x43D;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x44B;&#x445; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B; create-react-app, &#x438; &#x432; &#x43D;&#x438;&#x445; &#x435;&#x441;&#x442;&#x44C; &#x438; &#x441;&#x432;&#x43E;&#x438; &#x43F;&#x43B;&#x44E;&#x441;&#x44B;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43A;&#x43E;&#x43B;&#x44C; &#x441;&#x43A;&#x43E;&#x440;&#x43E; &#x432;&#x430;&#x448; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442; &#x43D;&#x435; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x43E;&#x439; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x438; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x430; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;, &#x435;&#x451; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43A;&#x430;&#x43A; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x44C;. &#x41F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x435; <a href="https://github.com/facebookincubator/create-react-app#philosophy" target="_blank" rel="noopener">&#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x437;&#x434;&#x435;&#x441;&#x44C;</a>.</p>
<h4 id="&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;-&#x432;&#x43D;&#x438;&#x437;"><a href="#&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;-&#x432;&#x43D;&#x438;&#x437;" class="headerlink" title="&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x43D;&#x438;&#x437;"></a>&#x41C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x43D;&#x438;&#x437;</h4><p>React &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x435;&#x43D; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43A;&#x440;&#x443;&#x442;&#x43E;&#x439; &#x43A;&#x440;&#x438;&#x432;&#x43E;&#x439; &#x438;&#x437;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F;. &#x414;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x447;&#x43E;&#x43A; &#x441;&#x43C;&#x43E;&#x436;&#x435;&#x442; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C;, &#x435;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C; &#x43E; JSX, &#x430; &#x432;&#x435;&#x440;&#x43E;&#x44F;&#x442;&#x43D;&#x43E; &#x2014; &#x438; &#x43E; ES2015+, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; ES2015-&#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43E;&#x432;. &#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x440;&#x430;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x43C;&#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443;, &#x445;&#x43E;&#x442;&#x44F; &#x442;&#x435;&#x445;&#x43D;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x438; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; Babel &#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; live-&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x438; &#x43A;&#x43E;&#x434;&#x430;, &#x434;&#x43B;&#x44F; production &#x44D;&#x442;&#x43E;&#x442; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x432; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43D;&#x435; &#x433;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F;.</p>
<p>Vue &#x43C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x432;&#x435;&#x440;&#x445; &#x43D;&#x438;&#x447;&#x443;&#x442;&#x44C; &#x43D;&#x435; &#x445;&#x443;&#x436;&#x435;, &#x447;&#x435;&#x43C; React, &#x438; &#x432; &#x442;&#x43E; &#x436;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x435;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438; &#x432;&#x43D;&#x438;&#x437; &#x2014; &#x432;&#x43F;&#x43B;&#x43E;&#x442;&#x44C; &#x434;&#x43E; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; jQuery. &#x418;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x2014; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x430;&#x440;&#x442;&#x430; &#x432; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x435;&#x439;&#x448;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x442;&#x435;&#x433; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x430; &#x43D;&#x430; HTML-&#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443;.</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;https://cdn.jsdelivr.net/npm/vue&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span></code></pre>
<p>&#x41D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44F; &#x441; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x43D;&#x430; Vue, &#x438; &#x434;&#x430;&#x436;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; production-&#x432;&#x435;&#x440;&#x441;&#x438;&#x44E;, &#x43D;&#x435; &#x43C;&#x443;&#x447;&#x430;&#x44F;&#x441;&#x44C; &#x443;&#x433;&#x440;&#x44B;&#x437;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x441;&#x43E;&#x432;&#x435;&#x441;&#x442;&#x438; &#x438; &#x432;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x43D;&#x430;&#x441;&#x447;&#x451;&#x442; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;.</p>
<p>&#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x437;&#x43D;&#x430;&#x43D;&#x438;&#x44F; JSX, ES2015 &#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x43D;&#x435; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; Vue, &#x432; &#x441;&#x440;&#x435;&#x434;&#x43D;&#x435;&#x43C; &#x443; &#x43D;&#x43E;&#x432;&#x44B;&#x445; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x443;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43D;&#x435; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x434;&#x43D;&#x44F; &#x43D;&#x430; &#x447;&#x442;&#x435;&#x43D;&#x438;&#x435; <a href="./">&#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x430;</a>, &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x449;&#x435;&#x433;&#x43E; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x435;&#x442;&#x440;&#x438;&#x432;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;.</p>
<h3 id="&#x41D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x430;&#x44F;-&#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430;"><a href="#&#x41D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x430;&#x44F;-&#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430;" class="headerlink" title="&#x41D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x430;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430;"></a>&#x41D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x430;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430;</h3><p>React Native &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; iOS &#x438; Android, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; &#x442;&#x443; &#x436;&#x435; &#x441;&#x430;&#x43C;&#x443;&#x44E; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432; React&#x2019;&#x430;. &#x42D;&#x442;&#x43E; &#x2014; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x43E;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x43D;&#x438;&#x435; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x438; &#x442;&#x43E;&#x433;&#x43E; &#x436;&#x435; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430; &#x43D;&#x430; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x445;. &#x412; &#x44D;&#x442;&#x43E;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438;, Vue &#x43E;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442; <a href="https://weex.apache.org/" target="_blank" rel="noopener">Weex</a> &#x2014; &#x43A;&#x440;&#x43E;&#x441;&#x441;&#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x439; UI-&#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;, &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; Alibaba Group &#x438; &#x438;&#x43D;&#x43A;&#x443;&#x431;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x439; Apache Software Foundation (ASF). Weex &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x442;&#x43E;&#x442; &#x436;&#x435; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; Vue &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435;, &#x43D;&#x43E; &#x438; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C;&#x438; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x432; iOS &#x438; Android!</p>
<p>&#x41D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; Weex &#x432;&#x441;&#x451; &#x435;&#x449;&#x451; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x432; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x439; &#x444;&#x430;&#x437;&#x435; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;, &#x438; &#x435;&#x449;&#x451; &#x43D;&#x435; &#x441;&#x442;&#x43E;&#x43B;&#x44C; &#x43C;&#x430;&#x442;&#x451;&#x440; &#x438; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x435;&#x43D; &#x43E;&#x43F;&#x44B;&#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A; React Native. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;, &#x435;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x430; &#x43C;&#x43E;&#x442;&#x438;&#x432;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438; &#x442;&#x440;&#x435;&#x431;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x43A;&#x440;&#x443;&#x43F;&#x43D;&#x435;&#x439;&#x448;&#x435;&#x433;&#x43E; &#x431;&#x438;&#x437;&#x43D;&#x435;&#x441;&#x430; &#x44D;&#x43B;&#x435;&#x43A;&#x442;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x439; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x440;&#x446;&#x438;&#x438; &#x432; &#x43C;&#x438;&#x440;&#x435;. &#x41A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; Vue &#x442;&#x430;&#x43A;&#x436;&#x435; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x432;&#x437;&#x430;&#x438;&#x43C;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x441; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C;&#x438; Weex, &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x44F; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; &#x43D;&#x435;&#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x434;&#x43B;&#x44F; Vue-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432;.</p>
<p>&#x415;&#x449;&#x451; &#x43E;&#x434;&#x438;&#x43D; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442; <a href="https://nativescript-vue.org/" target="_blank" rel="noopener">NativeScript-Vue</a> &#x2014; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D; &#x434;&#x43B;&#x44F; <a href="https://www.nativescript.org/" target="_blank" rel="noopener">NativeScript</a> &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;-&#x43D;&#x430;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x435;&#x43C;&#x443; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; Vue.js.</p>
<h3 id="&#x421;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435;-&#x441;-MobX"><a href="#&#x421;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435;-&#x441;-MobX" class="headerlink" title="&#x421;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441; MobX"></a>&#x421;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441; MobX</h3><p>MobX &#x441;&#x442;&#x430;&#x43B; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x44B;&#x43C; &#x432; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435; React. &#x41E;&#x43D; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x438;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x447;&#x43D;&#x443;&#x44E; Vue &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x412; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x441;&#x43C;&#x44B;&#x441;&#x43B;&#x435;, &#x441;&#x432;&#x44F;&#x437;&#x43A;&#x443; React + MobX &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x441;&#x43B;&#x43E;&#x432;&#x43D;&#x44B;&#x43C; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x43C; Vue, &#x442;&#x430;&#x43A; &#x447;&#x442;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x435; &#x435;&#x451;, &#x438; &#x43E;&#x43D;&#x430; &#x432;&#x430;&#x43C; &#x43D;&#x440;&#x430;&#x432;&#x438;&#x442;&#x441;&#x44F;, &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434; &#x43D;&#x430; Vue &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x43B;&#x43E;&#x433;&#x438;&#x447;&#x43D;&#x44B;&#x43C; &#x448;&#x430;&#x433;&#x43E;&#x43C;.</p>
<h3 id="Preact-&#x438;-&#x434;&#x440;&#x443;&#x433;&#x438;&#x435;-React-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x435;-&#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438;"><a href="#Preact-&#x438;-&#x434;&#x440;&#x443;&#x433;&#x438;&#x435;-React-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x435;-&#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438;" class="headerlink" title="Preact &#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; React-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438;"></a>Preact &#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; React-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438;</h3><p>React-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x43F;&#x44B;&#x442;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x430;&#x43A; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x441;&#x432;&#x43E;&#x438;&#x445; API &#x438; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B; React &#x43D;&#x430;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x44D;&#x442;&#x43E; &#x43E;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x438;&#x43C;&#x43E;. &#x41F;&#x43E; &#x44D;&#x442;&#x43E;&#x439; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x435; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x439;, &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x451;&#x43D;&#x43D;&#x44B;&#x445; &#x432;&#x44B;&#x448;&#x435;, &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x43C;&#x44B; &#x438; &#x43A; &#x43D;&#x438;&#x43C;. &#x413;&#x43B;&#x430;&#x432;&#x43D;&#x44B;&#x43C; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x438;&#x435;&#x43C;, &#x43A;&#x430;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E;, &#x431;&#x443;&#x434;&#x435;&#x442; &#x443;&#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x439; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B; (&#x447;&#x430;&#x441;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;) &#x432; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x441; React. &#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x44D;&#x442;&#x438; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x430; 100% &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x44B; &#x441;&#x43E; &#x432;&#x441;&#x435;&#x43C; &#x432; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435; React, &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x438;&#x43B;&#x438; &#x441;&#x43E;&#x43F;&#x443;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F;. &#x418;&#x43B;&#x438;, &#x434;&#x430;&#x436;&#x435; &#x435;&#x441;&#x43B;&#x438; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435; &#x447;&#x442;&#x43E; &#x43E;&#x43D;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x442;, &#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x441;&#x43B;&#x43E;&#x43C;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43B;&#x44E;&#x431;&#x43E;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x448;&#x430; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x430;&#x44F; React-&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x430;&#x44F; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430;&#x440;&#x430;&#x432;&#x43D;&#x435; &#x441; React.</p>
<h2 id="AngularJS-Angular-1"><a href="#AngularJS-Angular-1" class="headerlink" title="AngularJS (Angular 1)"></a>AngularJS (Angular 1)</h2><p>&#x41D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x430; Vue &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x44F;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435; &#x43D;&#x430; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; AngularJS (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x441;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x442;&#x435; <code>v-if</code> &#x438; <code>ng-if</code>). &#x42D;&#x442;&#x43E; &#x2014; &#x43D;&#x435; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x441;&#x442;&#x44C;: &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x438;&#x434;&#x435;&#x438;, &#x43B;&#x435;&#x436;&#x430;&#x449;&#x438;&#x435; &#x432; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x435; AngularJS &#x43C;&#x44B; &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x43C; &#x432;&#x435;&#x440;&#x43D;&#x44B;&#x43C;&#x438;, &#x438; &#x432;&#x434;&#x43E;&#x445;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x43B;&#x438;&#x441;&#x44C; &#x438;&#x43C;&#x438; &#x43D;&#x430; &#x440;&#x430;&#x43D;&#x43D;&#x438;&#x445; &#x44D;&#x442;&#x430;&#x43F;&#x430;&#x445; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; Vue. &#x412;&#x43F;&#x440;&#x43E;&#x447;&#x435;&#x43C;, &#x432; AngularJS &#x43D;&#x435;&#x43C;&#x430;&#x43B;&#x43E; &#x438; &#x431;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;, &#x438; &#x432; &#x44D;&#x442;&#x438;&#x445; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44F;&#x445; &#x43C;&#x44B; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x440;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x434;&#x43E;&#x431;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x435;&#x43D;&#x438;&#x439;.</p>
<h3 id="&#x421;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C;"><a href="#&#x421;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C;" class="headerlink" title="&#x421;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C;"></a>&#x421;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C;</h3><p>Vue &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435; AngularJS, &#x43A;&#x430;&#x43A; &#x432; &#x441;&#x43C;&#x44B;&#x441;&#x43B;&#x435; API, &#x442;&#x430;&#x43A; &#x438; &#x432; &#x441;&#x43C;&#x44B;&#x441;&#x43B;&#x435; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x44B;. &#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x44B;&#x445; &#x437;&#x43D;&#x430;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x43D;&#x435;&#x442;&#x440;&#x438;&#x432;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x447;&#x435;&#x43C; &#x437;&#x430; &#x434;&#x435;&#x43D;&#x44C;, &#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435;&#x43B;&#x44C;&#x437;&#x44F; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x43E;&#x431; AngularJS.</p>
<h3 id="&#x413;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x44C;-&#x438;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;"><a href="#&#x413;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x44C;-&#x438;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;" class="headerlink" title="&#x413;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;"></a>&#x413;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;</h3><p>AngularJS &#x438;&#x43C;&#x435;&#x435;&#x442; &#x436;&#x451;&#x441;&#x442;&#x43A;&#x43E;&#x435; &#x43C;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x430;&#x441;&#x447;&#x451;&#x442; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x44B; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; Vue &#x43F;&#x440;&#x43E;&#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x433;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;&#x43C;. &#x425;&#x43E;&#x442;&#x44F; &#x44D;&#x442;&#x43E; &#x438; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; Vue &#x43F;&#x440;&#x438;&#x433;&#x43E;&#x434;&#x43D;&#x44B;&#x43C; &#x434;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43D;&#x43E;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x43E;&#x432;, &#x43C;&#x44B; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x43C; &#x438; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x443;&#x436;&#x435; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x44B; &#x437;&#x430; &#x442;&#x435;&#x431;&#x44F;, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x440;&#x430;&#x437;&#x443; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;, &#x438; &#x432; &#x44D;&#x442;&#x43E;&#x43C; &#x435;&#x441;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x438; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;.</p>
<p>&#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x44B; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x43C; &#x43F;&#x43E;&#x43B;&#x43D;&#x443;&#x44E; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443; &#x434;&#x43B;&#x44F; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x439; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x43D;&#x430; Vue.js. <a href="https://github.com/vuejs/vue-cli" target="_blank" rel="noopener">Vue CLI</a> &#x43D;&#x430;&#x446;&#x435;&#x43B;&#x435;&#x43D; &#x441;&#x442;&#x430;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x43C; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x44B;&#x43C; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x44D;&#x43A;&#x43E;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B; Vue. &#x42D;&#x442;&#x43E; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442;, &#x447;&#x442;&#x43E; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430;&#x43C;&#x438; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442; &#x441;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x43E;&#x442;&#x43E;&#x447;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x438; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x430; &#x43D;&#x435; &#x442;&#x440;&#x430;&#x442;&#x438;&#x442;&#x44C; &#x447;&#x430;&#x441;&#x44B; &#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;. &#x412; &#x442;&#x43E;&#x436;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F;, &#x43E;&#x43D; &#x43F;&#x43E;-&#x43F;&#x440;&#x435;&#x436;&#x43D;&#x435;&#x43C;&#x443; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x433;&#x438;&#x431;&#x43A;&#x443;&#x44E; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x443; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x432; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x44B;&#x43C;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;.</p>
<h3 id="&#x421;&#x432;&#x44F;&#x437;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x435;-&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;"><a href="#&#x421;&#x432;&#x44F;&#x437;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x435;-&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;" class="headerlink" title="&#x421;&#x432;&#x44F;&#x437;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;"></a>&#x421;&#x432;&#x44F;&#x437;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;</h3><p>AngularJS &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x434;&#x432;&#x443;&#x43D;&#x430;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x441;&#x432;&#x44F;&#x437;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44F;&#x43C;&#x438; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; Vue &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43D;&#x442;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43E;&#x434;&#x43D;&#x43E;&#x43D;&#x430;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x43F;&#x43E;&#x442;&#x43E;&#x43A;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;. &#x42D;&#x442;&#x43E; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43E;&#x431;&#x43B;&#x435;&#x433;&#x447;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x442;&#x43E;&#x43A;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x432; &#x43D;&#x435;&#x442;&#x440;&#x438;&#x432;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x445;.</p>
<h3 id="&#x414;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B;-&#x438;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;"><a href="#&#x414;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B;-&#x438;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;" class="headerlink" title="&#x414;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; &#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;"></a>&#x414;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; &#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;</h3><p>Vue &#x447;&#x451;&#x442;&#x447;&#x435; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; &#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;. &#x414;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; &#x43F;&#x440;&#x435;&#x434;&#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44B; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x434;&#x43B;&#x44F; &#x438;&#x43D;&#x43A;&#x430;&#x43F;&#x441;&#x443;&#x43B;&#x44F;&#x446;&#x438;&#x438; &#x43D;&#x438;&#x437;&#x43A;&#x43E;&#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x432;&#x44B;&#x445; &#x43C;&#x430;&#x43D;&#x438;&#x43F;&#x443;&#x43B;&#x44F;&#x446;&#x438;&#x439; &#x441; DOM, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442; &#x441;&#x43E;&#x431;&#x43E;&#x439; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x446;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x430;&#x432;&#x442;&#x43E;&#x43D;&#x43E;&#x43C;&#x43D;&#x44B;&#x435; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x44B;, &#x441;&#x43E; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x43E;&#x439; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;. &#x412; AngularJS &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; &#x434;&#x435;&#x43B;&#x430;&#x44E;&#x442; &#x432;&#x441;&#x44E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443;, &#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43B;&#x438;&#x448;&#x44C; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x439; &#x442;&#x438;&#x43F; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;.</p>
<h3 id="&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;-&#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;-1"><a href="#&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;-&#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;-1" class="headerlink" title="&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;"></a>&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;</h3><p>Vue &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x435;&#x435; AngularJS. &#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x438;&#x437;-&#x437;&#x430; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x44F; dirty-checking, &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; Vue-&#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x430;&#x43C;&#x43D;&#x43E;&#x433;&#x43E;-&#x43D;&#x430;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435;. AngularJS &#x437;&#x430;&#x43C;&#x435;&#x434;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x438; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x430; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439;, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x440;&#x430;&#x437; &#x43F;&#x440;&#x438; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x447;&#x435;&#x433;&#x43E;-&#x43B;&#x438;&#x431;&#x43E; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x432;&#x441;&#x435; &#x44D;&#x442;&#x438; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x442;&#x435;&#x43B;&#x438; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x431;&#x44B;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x44B;. &#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x446;&#x438;&#x43A;&#x43B; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x440;&#x430;&#x437; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x441;&#x442;&#x430;&#x431;&#x438;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x435;&#x439;, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x440;&#x435;&#x430;&#x43A;&#x446;&#x438;&#x44F; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x441;&#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x435;&#x435; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435;. &#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;&#x43C; AngularJS &#x43D;&#x435;&#x440;&#x435;&#x434;&#x43A;&#x43E; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x431;&#x435;&#x433;&#x430;&#x442;&#x44C; &#x43A; &#x432;&#x435;&#x441;&#x44C;&#x43C;&#x430; &#x44D;&#x437;&#x43E;&#x442;&#x435;&#x440;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x43C; &#x442;&#x435;&#x445;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x445;&#x43E;&#x434;&#x430; &#x44D;&#x442;&#x438;&#x445; &#x442;&#x440;&#x443;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x430; &#x432; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x438; &#x432;&#x43E;&#x432;&#x441;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x439;.</p>
<p>Vue &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x432;&#x435;&#x440;&#x436;&#x435;&#x43D; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430;&#x43C; &#x43F;&#x43E; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x437;&#x440;&#x430;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x437;&#x43C;&#x430; &#x443;&#x447;&#x451;&#x442;&#x430; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x441; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x439; &#x43E;&#x447;&#x435;&#x440;&#x435;&#x434;&#x44C;&#x44E; &#x2014; &#x432;&#x441;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;, &#x43A;&#x440;&#x43E;&#x43C;&#x435; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x432; &#x44F;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x43D;&#x430;&#x43B;&#x438;&#x447;&#x438;&#x44F; &#x441;&#x432;&#x44F;&#x437;&#x438; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x43D;&#x438;&#x43C;&#x438;.</p>
<p>&#x41B;&#x44E;&#x431;&#x43E;&#x43F;&#x44B;&#x442;&#x43D;&#x43E;, &#x447;&#x442;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x43C;&#x430;&#x43B;&#x43E; &#x43E;&#x431;&#x449;&#x438;&#x445; &#x447;&#x435;&#x440;&#x442;, &#x43A;&#x430;&#x43A; Angular &#x438; Vue &#x440;&#x435;&#x448;&#x430;&#x44E;&#x442; &#x44D;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x44B; AngularJS.</p>
<h2 id="Angular-&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x439;-&#x442;&#x430;&#x43A;&#x436;&#x435;-&#x43A;&#x430;&#x43A;-Angular-2"><a href="#Angular-&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x439;-&#x442;&#x430;&#x43A;&#x436;&#x435;-&#x43A;&#x430;&#x43A;-Angular-2" class="headerlink" title="Angular (&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x439; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43A;&#x430;&#x43A; Angular 2)"></a>Angular (&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x439; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43A;&#x430;&#x43A; Angular 2)</h2><p>&#x41C;&#x44B; &#x432;&#x44B;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x43C; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x44E; &#x434;&#x43B;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; Angular, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43F;&#x43E; &#x441;&#x443;&#x442;&#x438; &#x43E;&#x43D; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x435;&#x43D; &#x43E;&#x442; AngularJS. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43E;&#x43D; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x446;&#x435;&#x43D;&#x43D;&#x443;&#x44E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43D;&#x443;&#x44E; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443;; &#x43A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x438; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x431;&#x44B;&#x43B;&#x438; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B;, &#x430; API &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x43B;&#x441;&#x44F;.</p>
<h3 id="TypeScript"><a href="#TypeScript" class="headerlink" title="TypeScript"></a>TypeScript</h3><p>&#x414;&#x43B;&#x44F; Angular &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; TypeScript, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x432;&#x441;&#x44F; &#x435;&#x433;&#x43E; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44F; &#x438; &#x443;&#x447;&#x435;&#x431;&#x43D;&#x44B;&#x435; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x44B; &#x43D;&#x430; TypeScript. TypeScript &#x438;&#x43C;&#x435;&#x435;&#x442; &#x441;&#x432;&#x43E;&#x438; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430; &#x2014; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x430; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x43E;&#x432; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x43A;&#x440;&#x443;&#x43F;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;, &#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C;, &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x449;&#x438;&#x43C; &#x43D;&#x430; Java &#x438; C#.</p>
<p>&#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E; &#x43D;&#x435; &#x432;&#x441;&#x435; &#x445;&#x43E;&#x442;&#x44F;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; TypeScript. &#x427;&#x430;&#x441;&#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B; &#x442;&#x438;&#x43F;&#x43E;&#x432; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43A; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x43C;&#x443; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x44E; &#x43D;&#x430;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x44B;&#x445; &#x440;&#x430;&#x441;&#x445;&#x43E;&#x434;&#x43E;&#x432; &#x43D;&#x435;&#x436;&#x435;&#x43B;&#x438; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x44E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;. &#x412; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445; &#x432;&#x430;&#x43C; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; Vue, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; Angular &#x431;&#x435;&#x437; TypeScript &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x43C;.</p>
<p>&#x41D;&#x430;&#x43A;&#x43E;&#x43D;&#x435;&#x446;, &#x445;&#x43E;&#x442;&#x44F; Vue &#x438; &#x43D;&#x435; &#x442;&#x430;&#x43A; &#x433;&#x43B;&#x443;&#x431;&#x43E;&#x43A;&#x43E; &#x438;&#x43D;&#x442;&#x435;&#x433;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D; &#x441; TypeScript &#x43A;&#x430;&#x43A; Angular, &#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; <a href="https://github.com/vuejs/vue/tree/dev/types" target="_blank" rel="noopener">&#x43E;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x434;&#x435;&#x43A;&#x43B;&#x430;&#x440;&#x430;&#x446;&#x438;&#x438; &#x442;&#x438;&#x43F;&#x43E;&#x432;</a> &#x438; <a href="https://github.com/vuejs/vue-class-component" target="_blank" rel="noopener">&#x43E;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x434;&#x435;&#x43A;&#x43E;&#x440;&#x430;&#x442;&#x43E;&#x440;</a> &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445;, &#x43A;&#x442;&#x43E; &#x445;&#x43E;&#x447;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; TypeScript &#x441; Vue. &#x41C;&#x44B; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x441;&#x43E;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x447;&#x430;&#x435;&#x43C; &#x441; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x430;&#x43C;&#x438; TypeScript &#x438; VSCode &#x432; Microsoft, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x438;&#x442;&#x44C; &#x43E;&#x43F;&#x44B;&#x442; TS/IDE &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; Vue + TS.</p>
<h3 id="&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;-&#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;-2"><a href="#&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;-&#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;-2" class="headerlink" title="&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;"></a>&#x411;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;</h3><p>&#x412; &#x441;&#x43C;&#x44B;&#x441;&#x43B;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x43E;&#x431;&#x430; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430; &#x432;&#x435;&#x441;&#x44C;&#x43C;&#x430; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x44B;, &#x438; &#x43F;&#x43E;&#x43A;&#x430; &#x43D;&#x435;&#x442; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x44B;&#x445; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x438;&#x437; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x438;&#x440;&#x430; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x432;&#x44B;&#x43D;&#x435;&#x441;&#x442;&#x438; &#x43E;&#x43A;&#x43E;&#x43D;&#x447;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x432;&#x435;&#x440;&#x434;&#x438;&#x43A;&#x442;. &#x41D;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x432;&#x441;&#x451; &#x436;&#x435; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x446;&#x438;&#x444;&#x440;, &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435; &#x447;&#x442;&#x43E; Vue 2.0 &#x432;&#x441;&#x451;-&#x442;&#x430;&#x43A;&#x438; &#x43E;&#x431;&#x433;&#x43E;&#x43D;&#x44F;&#x435;&#x442; Angular, &#x43F;&#x43E; &#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435;&#x439; &#x43C;&#x435;&#x440;&#x435;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x435;&#x440;&#x438;&#x442;&#x44C; &#x44D;&#x442;&#x43E;&#x43C;&#x443; <a href="http://stefankrause.net/js-frameworks-benchmark4/webdriver-ts/table.html" target="_blank" rel="noopener">&#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x43D;&#x435;&#x43C;&#x443; &#x438;&#x441;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;</a>.</p>
<p>&#x41E;&#x431;&#x430; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430; &#x438;&#x441;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x44B;&#x435;, &#x441; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x440;&#x438;&#x43A;&#x430;&#x43C;&#x438; &#x432; &#x442;&#x435;&#x441;&#x442;&#x430;&#x445;. &#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; <a href="https://stefankrause.net/js-frameworks-benchmark8/table.html" target="_blank" rel="noopener">&#x438;&#x437;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x44B;&#x435; &#x446;&#x438;&#x444;&#x440;&#x44B;</a> &#x434;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x44F;, &#x43D;&#x43E; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x44C; &#x432;&#x440;&#x44F;&#x434; &#x43B;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x442; &#x440;&#x435;&#x448;&#x430;&#x44E;&#x449;&#x438;&#x43C; &#x444;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x43C;.</p>
<h3 id="&#x420;&#x430;&#x437;&#x43C;&#x435;&#x440;"><a href="#&#x420;&#x430;&#x437;&#x43C;&#x435;&#x440;" class="headerlink" title="&#x420;&#x430;&#x437;&#x43C;&#x435;&#x440;"></a>&#x420;&#x430;&#x437;&#x43C;&#x435;&#x440;</h3><p>&#x41F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x435; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; Angular, &#x441; <a href="https://ru.wikipedia.org/wiki/AOT-&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x44F;" target="_blank" rel="noopener">AOT-&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x435;&#x439;</a> &#x438; <a href="https://en.wikipedia.org/wiki/Tree_shaking" target="_blank" rel="noopener">tree-shaking</a>, &#x441;&#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x443;&#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x438;&#x442;&#x44C; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x441;&#x431;&#x43E;&#x440;&#x43E;&#x43A;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442; Vue 2 &#x441; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x451;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; Vuex + Vue Router (~30&#x41A;&#x411; gzip) &#x43F;&#x43E;-&#x43F;&#x440;&#x435;&#x436;&#x43D;&#x435;&#x43C;&#x443; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43B;&#x435;&#x433;&#x447;&#x435; &#x438;&#x437; &#x43A;&#x43E;&#x440;&#x43E;&#x431;&#x43A;&#x438;, &#x447;&#x435;&#x43C; AOT-&#x441;&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x435; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <code>angular-cli</code> (~65&#x41A;&#x411; gzip).</p>
<h3 id="&#x413;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x44C;"><a href="#&#x413;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x44C;" class="headerlink" title="&#x413;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x44C;"></a>&#x413;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x44C;</h3><p>Vue &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x443;&#x43F;&#x440;&#x44F;&#x43C;, &#x447;&#x435;&#x43C; Angular, &#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C; &#x441;&#x431;&#x43E;&#x440;&#x43E;&#x43A;, &#x43D;&#x435; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x438;&#x432;&#x430;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x432; &#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A;&#x443;&#x44E; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;. &#x41C;&#x43D;&#x43E;&#x433;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x441;&#x442;&#x430;&#x43C; &#x44D;&#x442;&#x430; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x430; &#x43D;&#x440;&#x430;&#x432;&#x438;&#x442;&#x441;&#x44F;, &#x445;&#x43E;&#x442;&#x44F; &#x435;&#x441;&#x442;&#x44C; &#x438; &#x442;&#x435;, &#x43A;&#x442;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x44E;&#x442; &#x438;&#x43C;&#x435;&#x442;&#x44C; &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;-&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;.</p>
<h3 id="&#x41A;&#x440;&#x438;&#x432;&#x430;&#x44F;-&#x43E;&#x431;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F;"><a href="#&#x41A;&#x440;&#x438;&#x432;&#x430;&#x44F;-&#x43E;&#x431;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F;" class="headerlink" title="&#x41A;&#x440;&#x438;&#x432;&#x430;&#x44F; &#x43E;&#x431;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F;"></a>&#x41A;&#x440;&#x438;&#x432;&#x430;&#x44F; &#x43E;&#x431;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F;</h3><p>&#x412;&#x441;&#x451; &#x447;&#x442;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; Vue &#x2014; &#x44D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x441;&#x442;&#x432;&#x43E; &#x441; HTML &#x438; &#x43E;&#x431;&#x44B;&#x43A;&#x43D;&#x43E;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; (ES5) JavaScript&#x2019;&#x43E;&#x43C;. &#x421; &#x44D;&#x442;&#x438;&#x43C;&#x438; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x44B;&#x43C;&#x438; &#x43D;&#x430;&#x432;&#x44B;&#x43A;&#x430;&#x43C;&#x438; &#x432;&#x44B; &#x443;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x44C; &#x43D;&#x435;&#x442;&#x440;&#x438;&#x432;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x447;&#x435;&#x43C; &#x43E;&#x434;&#x43D;&#x43E;&#x434;&#x43D;&#x435;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x447;&#x442;&#x435;&#x43D;&#x438;&#x44F; <a href="./">&#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x430;</a>.</p>
<p>&#x41A;&#x440;&#x438;&#x432;&#x430;&#x44F; &#x43E;&#x431;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x443; Angular &#x433;&#x43E;&#x440;&#x430;&#x437;&#x434;&#x43E; &#x43A;&#x440;&#x443;&#x447;&#x435;. API &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x433;&#x440;&#x43E;&#x43C;&#x43D;&#x43E;&#x435; &#x438; &#x432;&#x430;&#x43C; &#x43A;&#x430;&#x43A; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44E; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x430;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43C; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x43C; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x438;&#x439;, &#x43F;&#x440;&#x435;&#x436;&#x434;&#x435; &#x447;&#x435;&#x43C; &#x441;&#x442;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x434;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C;. &#x41E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x43E;, &#x447;&#x442;&#x43E; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; Angular &#x432;&#x43E; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x43C; &#x43E;&#x431;&#x443;&#x441;&#x43B;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x430; &#x435;&#x433;&#x43E; &#x43D;&#x430;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43D;&#x430; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x435;, &#x43A;&#x43E;&#x43C;&#x43F;&#x43B;&#x435;&#x43A;&#x441;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x2014; &#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x443; &#x43D;&#x430;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x442;&#x440;&#x443;&#x434;&#x43D;&#x43E;&#x439; &#x434;&#x43B;&#x44F; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x43E;&#x43F;&#x44B;&#x442;&#x43D;&#x44B;&#x445; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432;.</p>
<h2 id="Ember"><a href="#Ember" class="headerlink" title="Ember"></a>Ember</h2><p>Ember &#x2014; &#x44D;&#x442;&#x43E; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;, &#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#xAB;&#x438;&#x43C;&#x435;&#x44E;&#x449;&#x438;&#x43C; &#x438; &#x43E;&#x442;&#x441;&#x442;&#x430;&#x438;&#x432;&#x430;&#x44E;&#x449;&#x438;&#x43C; &#x441;&#x432;&#x43E;&#x451; &#x43C;&#x43D;&#x435;&#x43D;&#x438;&#x435;&#xBB;. &#x41E;&#x43D; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x441;&#x43E;&#x431;&#x43B;&#x44E;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x430; &#x441;&#x43E;&#x433;&#x43B;&#x430;&#x448;&#x435;&#x43D;&#x438;&#x439; &#x438; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x43D;&#x446;&#x438;&#x439;, &#x438; &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x44B; &#x441; &#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x441;&#x432;&#x43E;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x2014; &#x43E;&#x43D; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x432;&#x430;&#x441; &#x432;&#x435;&#x441;&#x44C;&#x43C;&#x430; &#x43F;&#x440;&#x43E;&#x434;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C;&#x438;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;, &#x44D;&#x442;&#x43E; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x435;&#x442; &#x435;&#x449;&#x451; &#x438; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x443;&#x44E; &#x438; &#x43A;&#x440;&#x443;&#x442;&#x443;&#x44E; &#x43A;&#x440;&#x438;&#x432;&#x443;&#x44E; &#x43E;&#x431;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F;, &#x43D;&#x435; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44F; &#x43E; &#x441;&#x442;&#x440;&#x430;&#x434;&#x430;&#x44E;&#x449;&#x435;&#x439; &#x433;&#x438;&#x431;&#x43A;&#x43E;&#x441;&#x442;&#x438;. &#x412;&#x44B;&#x431;&#x43E;&#x440; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x436;&#x451;&#x441;&#x442;&#x43A;&#x43E; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x43E;&#x43C; &#x438; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x43E;&#x439; &#x441;&#x43E; &#x441;&#x43B;&#x430;&#x431;&#x43E;&#x441;&#x432;&#x44F;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x43D;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x449;&#x438;&#x43C;&#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x2014; &#x44D;&#x442;&#x43E; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x440;&#x43E;&#x43C;&#x438;&#x441;&#x441;. &#x41F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x44F;&#x44F; &#x434;&#x430;&#x451;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x44B;, &#x43D;&#x43E; &#x438; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x438;&#x44F; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x43D;&#x44B;&#x445; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x439;.</p>
<p>&#x423;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x44F; &#x432;&#x44B;&#x448;&#x435;&#x441;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x435;, &#x432;&#x435;&#x440;&#x43E;&#x44F;&#x442;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x430;&#x437;&#x443;&#x43C;&#x43D;&#x435;&#x435; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x44F;&#x434;&#x440;&#x43E; Vue &#x438; &#x441;&#x43B;&#x43E;&#x438; <a href="https://guides.emberjs.com/v2.7.0/templates/handlebars-basics/" target="_blank" rel="noopener">&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;</a> &#x438; <a href="https://guides.emberjs.com/v2.7.0/object-model/" target="_blank" rel="noopener">&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x439; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x438;</a> Ember:</p>
<ul>
<li><p>Vue &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442; &#x43D;&#x435;&#x43D;&#x430;&#x432;&#x44F;&#x437;&#x447;&#x438;&#x432;&#x443;&#x44E; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;&#x445; JavaScript-&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432; &#x438; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x432;&#x44B;&#x447;&#x438;&#x441;&#x43B;&#x44F;&#x435;&#x43C;&#x44B;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;. &#x412; Ember &#x43E;&#x442; &#x432;&#x430;&#x441; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x437;&#x430;&#x432;&#x43E;&#x440;&#x430;&#x447;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x432; &#xAB;&#x41E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x44B; Ember&#xBB; &#x438; &#x440;&#x443;&#x447;&#x43D;&#x43E;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x435; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x434;&#x43B;&#x44F; &#x432;&#x44B;&#x447;&#x438;&#x441;&#x43B;&#x44F;&#x435;&#x43C;&#x44B;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;.</p>
</li>
<li><p>&#x421;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432; Vue &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439; JavaScript, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439; Handlebars &#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x445;&#x435;&#x43B;&#x43F;&#x435;&#x440;&#x43E;&#x432; &#x432; Ember &#x43D;&#x430;&#x43C;&#x435;&#x440;&#x435;&#x43D;&#x43D;&#x43E; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x44B;.</p>
</li>
<li><p>&#x412; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; Vue <a href="https://stefankrause.net/js-frameworks-benchmark8/table.html" target="_blank" rel="noopener">&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x432;&#x44B;&#x438;&#x433;&#x440;&#x44B;&#x432;&#x430;&#x435;&#x442;</a> &#x2014; &#x434;&#x430;&#x436;&#x435; &#x441; &#x443;&#x447;&#x451;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x435;&#x433;&#x43E; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; Glimmer engine &#x432; Ember 3.x. Vue &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43E;&#x431;&#x44A;&#x435;&#x434;&#x438;&#x43D;&#x44F;&#x435;&#x442; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; &#x432; Ember &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x443;&#x447;&#x43D;&#x43E;&#x435; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x446;&#x438;&#x43A;&#x43B;&#x43E;&#x43C; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x44F;&#x445;, &#x433;&#x434;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43A;&#x440;&#x438;&#x442;&#x438;&#x447;&#x43D;&#x430;.</p>
</li>
</ul>
<h2 id="Knockout"><a href="#Knockout" class="headerlink" title="Knockout"></a>Knockout</h2><p>Knockout &#x431;&#x44B;&#x43B; &#x43F;&#x438;&#x43E;&#x43D;&#x435;&#x440;&#x43E;&#x43C; MVVM-&#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x430; &#x438; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x432; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;. &#x415;&#x433;&#x43E; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x430; &#x43D;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x443;&#x44E; Vue. &#x421;&#x43F;&#x438;&#x441;&#x43E;&#x43A; <a href="http://knockoutjs.com/documentation/browser-support.html" target="_blank" rel="noopener">&#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x432;</a> &#x2014; &#x432;&#x43F;&#x435;&#x447;&#x430;&#x442;&#x43B;&#x44F;&#x435;&#x442;, &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E; &#x441; &#x443;&#x447;&#x451;&#x442;&#x43E;&#x43C; &#x432;&#x441;&#x435;&#x445; &#x43D;&#x435;&#x43C;&#x430;&#x43B;&#x44B;&#x445; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430;, &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x44B;&#x445; &#x434;&#x430;&#x436;&#x435; &#x432; IE6! Vue &#x436;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; IE9+.</p>
<p>&#x421;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x435;&#x43C;, &#x432;&#x43F;&#x440;&#x43E;&#x447;&#x435;&#x43C;, &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x430; Knockout &#x437;&#x430;&#x43C;&#x435;&#x434;&#x43B;&#x438;&#x43B;&#x430;&#x441;&#x44C; &#x438; &#x43E;&#x43D; &#x43F;&#x43E;&#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x443; &#x43D;&#x430;&#x447;&#x430;&#x43B; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x43A;&#x438; &#x441;&#x432;&#x43E;&#x435;&#x433;&#x43E; &#x432;&#x43E;&#x437;&#x440;&#x430;&#x441;&#x442;&#x430;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x451;&#x442; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x431;&#x43E;&#x440;&#x430; &#x445;&#x443;&#x43A;&#x43E;&#x432; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430;, &#x430; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; &#x434;&#x43E;&#x447;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x445;&#x43E;&#x442;&#x44C; &#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x43E;, &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x43F;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x44E; &#x441;&#x43E; <a href="components.html#&#x420;&#x430;&#x441;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435;-&#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x430;-&#x441;&#x43B;&#x43E;&#x442;&#x430;&#x43C;&#x438;">&#x441;&#x43B;&#x43E;&#x442;&#x430;&#x43C;&#x438; Vue</a> &#x43D;&#x435; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x432;&#x44B;&#x438;&#x433;&#x440;&#x44B;&#x448;&#x43D;&#x43E;.</p>
<p>&#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435; &#x447;&#x442;&#x43E; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x440;&#x430;&#x437;&#x43D;&#x438;&#x446;&#x430; &#x432; &#x444;&#x438;&#x43B;&#x43E;&#x441;&#x43E;&#x444;&#x441;&#x43A;&#x438;&#x445; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x430;&#x445; &#x43A; API, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x43C; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E;, &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x438;&#x44F;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x438; <a href="https://gist.github.com/chrisvfritz/9e5f2d6826af00fcbace7be8f6dccb89" target="_blank" rel="noopener">&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x430; todo</a>. &#x41A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E; &#x436;&#x435;, &#x44D;&#x442;&#x43E; &#x2014; &#x441;&#x443;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x439; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;, &#x43D;&#x43E; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x43C; API Vue &#x43A;&#x430;&#x436;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x449;&#x435; &#x438; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;.</p>
<h2 id="Polymer"><a href="#Polymer" class="headerlink" title="Polymer"></a>Polymer</h2><p>Polymer &#x2014; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;, &#x441;&#x43F;&#x43E;&#x43D;&#x441;&#x438;&#x440;&#x443;&#x435;&#x43C;&#x44B;&#x439; Google. &#x412; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x43E;&#x43D; &#x442;&#x43E;&#x436;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x443;&#x436;&#x438;&#x43B; &#x438;&#x441;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x43A;&#x43E;&#x43C; &#x432;&#x434;&#x43E;&#x445;&#x43D;&#x43E;&#x432;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; Vue. &#x41A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; Vue &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x431;&#x43B;&#x438;&#x437;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x441; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x43C;&#x438; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; Polymer. &#x421;&#x442;&#x438;&#x43B;&#x44C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x441; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;&#x43C; &#x43E;&#x431;&#x43E;&#x438;&#x445; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x43E;&#x432; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x445;&#x43E;&#x436;. &#x421;&#x430;&#x43C;&#x430;&#x44F; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x440;&#x430;&#x437;&#x43D;&#x438;&#x446;&#x430; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x438;&#x442; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; Polymer &#x431;&#x430;&#x437;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x445; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44F;&#x445; Web Components &#x438; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x435;&#x441;&#x44C;&#x43C;&#x430; &#x43D;&#x435;&#x442;&#x440;&#x438;&#x432;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x438;&#x444;&#x438;&#x43B;&#x43E;&#x432; (&#x441; &#x43F;&#x43E;&#x442;&#x435;&#x440;&#x435;&#x439; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x431;&#x435;&#x437; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; &#x44D;&#x442;&#x438;&#x445; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439;). Vue, &#x43D;&#x430;&#x43F;&#x440;&#x43E;&#x442;&#x438;&#x432;, &#x431;&#x435;&#x437; &#x43A;&#x430;&#x43A;&#x438;&#x445;-&#x43B;&#x438;&#x431;&#x43E; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x438;&#x43B;&#x438; &#x43F;&#x43E;&#x43B;&#x438;&#x444;&#x438;&#x43B;&#x43E;&#x432; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x432;&#x43E; &#x432;&#x441;&#x435;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;, &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44F; &#x441; IE9.</p>
<p>&#x412; Polymer, &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x438; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x438;&#x43B;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443; &#x441;&#x432;&#x44F;&#x437;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x434;&#x43B;&#x44F; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x43C;&#x438; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;&#x445; Polymer &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x431;&#x443;&#x43B;&#x435;&#x432;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x446;&#x430;&#x43D;&#x438;&#x435; &#x438; &#x43E;&#x434;&#x438;&#x43D;&#x43E;&#x447;&#x43D;&#x44B;&#x435; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x44B; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432;. &#x420;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x432;&#x44B;&#x447;&#x438;&#x441;&#x43B;&#x44F;&#x435;&#x43C;&#x44B;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432; &#x2014; &#x442;&#x43E;&#x436;&#x435; &#x43D;&#x435; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x433;&#x438;&#x431;&#x43A;&#x430;&#x44F;.</p>
<h2 id="Riot"><a href="#Riot" class="headerlink" title="Riot"></a>Riot</h2><p>Riot 3.0 &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x443;&#x44E; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;, &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x44E;&#x449;&#x443;&#x44E;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x445; (&#x432; Riot &#x43D;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x445; &#xAB;&#x442;&#x435;&#x433;&#x430;&#x43C;&#x438;&#xBB;), &#x441; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x438;&#x441;&#x442;&#x438;&#x447;&#x43D;&#x44B;&#x43C; &#x438; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x43E; &#x43E;&#x440;&#x433;&#x430;&#x43D;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; API. &#x412;&#x435;&#x440;&#x43E;&#x44F;&#x442;&#x43D;&#x43E;, Riot &#x438; Vue &#x432;&#x43E; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x43C; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x445; &#x444;&#x438;&#x43B;&#x43E;&#x441;&#x43E;&#x444;&#x441;&#x43A;&#x438;&#x445; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x430;&#x445;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;, &#x43D;&#x435;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x44F; &#x43D;&#x430; &#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x439; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x43F;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x44E; &#x441; Riot, Vue &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;:</p>
<ul>
<li>&#x41B;&#x443;&#x447;&#x448;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;. <a href="https://github.com/vuejs/vuejs.org/issues/346" target="_blank" rel="noopener">&#x41D;&#x435;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x44F; &#x43D;&#x430; &#x437;&#x430;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x435;</a> &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; Virtual DOM, &#x432; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; Riot &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442; dirty checking, &#x438; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x441;&#x442;&#x440;&#x430;&#x434;&#x430;&#x435;&#x442; &#x43E;&#x442; &#x442;&#x435;&#x445; &#x436;&#x435; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;, &#x447;&#x442;&#x43E; &#x438; AngularJS.</li>
<li>&#x41F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x430; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x437;&#x440;&#x435;&#x43B;&#x43E;&#x433;&#x43E; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x44F;. Vue &#x43E;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; <a href="https://github.com/vuejs/vue-loader" target="_blank" rel="noopener">Webpack</a>, <a href="https://github.com/vuejs/vueify" target="_blank" rel="noopener">Browserify</a> &#x438; <a href="https://github.com/vuejs/systemjs-plugin-vue" target="_blank" rel="noopener">SystemJS</a>, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; Riot &#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430;&#x445; &#x438;&#x43D;&#x442;&#x435;&#x433;&#x440;&#x430;&#x446;&#x438;&#x438; &#x441; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x43C;&#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;.</li>
</ul>

    
    
      <div class="guide-links">
        
        
          <span>&#x2190; <a href="/v2/guide/migration-vuex.html">&#x41C;&#x438;&#x433;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x441; Vuex 0.6.x &#x43D;&#x430; 1.0</a></span>
        
        
        
          <span style="float: right;"><a href="/v2/guide/join.html">&#x41F;&#x440;&#x438;&#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x44F;&#x439;&#x442;&#x435;&#x441;&#x44C; &#x43A; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443; Vue.js!</a> &#x2192;</span>
        
      </div>
    
    <div class="footer">
        <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
<div class="bsa-cpc"></div>
<script>
  (function(){
    if(typeof _bsa !== 'undefined' && _bsa) {
    _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
      target: '.bsa-cpc',
      align: 'horizontal',
      disable_css: 'true'
    });
      }
  })();
</script>

      &#x41E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x451; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;?
      <a href="https://github.com/translation-gang/ru.vuejs.org/blob/master/src/v2/guide/comparison.md" target="_blank">
        &#x41E;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43D;&#x430; GitHub!
      </a>
    </div>

</body>
</html>