<!DOCTYPE html>
<html lang="en" id="wrapper">
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Установка</title>

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <link href="./style.css" rel="stylesheet" type="text/css">

    <!-- версия для разработки, отображает полезные предупреждения в консоли -->
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>

    <!-- production-версия, оптимизированная для размера и скорости -->
    <!--    <script src="https://cdn.jsdelivr.net/npm/vue"></script>-->

</head>
<body id="main">
<p>Спаршено с: <a href="https://ru.vuejs.org/v2/guide/installation.html">https://ru.vuejs.org/v2/guide/installation.html</a></p>

    
      
        

      
    
    
      <h1>&#x423;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x430;</h1>
    
    
      <h3 id="&#x41F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x435;-&#x43E;-&#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;"><a href="#&#x41F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x435;-&#x43E;-&#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;" class="headerlink" title="&#x41F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x435; &#x43E; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;"></a>&#x41F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x435; &#x43E; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;</h3><p>Vue <strong>&#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;</strong> IE8 &#x438; &#x43D;&#x438;&#x436;&#x435;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; ECMAScript 5, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435;&#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x44D;&#x43C;&#x443;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432; IE8. &#x412; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;, &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x432;&#x441;&#x435; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x44B;, <a href="https://caniuse.com/#feat=es5" target="_blank" rel="noopener">&#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x44B;&#x435; &#x441; ECMAScript 5</a>.</p>
<h3 id="&#x418;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44F;-&#x43E;-&#x440;&#x435;&#x43B;&#x438;&#x437;&#x430;&#x445;"><a href="#&#x418;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44F;-&#x43E;-&#x440;&#x435;&#x43B;&#x438;&#x437;&#x430;&#x445;" class="headerlink" title="&#x418;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44F; &#x43E; &#x440;&#x435;&#x43B;&#x438;&#x437;&#x430;&#x445;"></a>&#x418;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44F; &#x43E; &#x440;&#x435;&#x43B;&#x438;&#x437;&#x430;&#x445;</h3><p>&#x412;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x435;&#x433;&#x43E; &#x440;&#x435;&#x43B;&#x438;&#x437;&#x430;: 2.6.10</p>
<p>&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x430;&#x44F; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44F; &#x43E;&#x431; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F;&#x445; &#x432; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x43D;&#x430; <a href="https://github.com/vuejs/vue/releases" target="_blank" rel="noopener">GitHub</a>.</p>
<h2 id="&#x418;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;-&#x438;-Vue"><a href="#&#x418;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;-&#x438;-Vue" class="headerlink" title="&#x418;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430; &#x438; Vue"></a>&#x418;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430; &#x438; Vue</h2><p>&#x41F;&#x440;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; Vue &#x43C;&#x44B; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x435;&#x43C; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C; <a href="https://github.com/vuejs/vue-devtools#vue-devtools" target="_blank" rel="noopener">Vue Devtools</a> &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435;, &#x434;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x433;&#x43E; &#x443;&#x434;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x430; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43E;&#x43A; &#x438; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x438; &#x432;&#x430;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; Vue.</p>
<h2 id="&#x41F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;-&#x447;&#x435;&#x440;&#x435;&#x437;-lt-script-gt"><a href="#&#x41F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;-&#x447;&#x435;&#x440;&#x435;&#x437;-lt-script-gt" class="headerlink" title="&#x41F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; &lt;script&gt;"></a>&#x41F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; <code>&lt;script&gt;</code></h2><p>&#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43A;&#x430;&#x447;&#x430;&#x439;&#x442;&#x435; JS-&#x444;&#x430;&#x439;&#x43B; &#x438; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x435; &#x435;&#x433;&#x43E; &#x442;&#x435;&#x433;&#x43E;&#x43C; <code>&lt;script&gt;</code> &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435;. &#x411;&#x443;&#x434;&#x435;&#x442; &#x437;&#x430;&#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x430;&#x44F; <code>Vue</code>.</p>
<p class="tip">&#x41D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; &#x43C;&#x438;&#x43D;&#x438;&#x444;&#x438;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x443;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x432;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;, &#x438;&#x43D;&#x430;&#x447;&#x435; &#x432;&#x44B; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x43E; &#x442;&#x438;&#x43F;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x430;&#x445;!</p>

<div id="downloads"><br>  <a class="button" href="/js/vue.js" download>&#x412;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;</a><span class="light info">&#x421;  &#x43F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x443;&#x434;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x438; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x438;</span><br><br>  <a class="button" href="/js/vue.min.js" download>&#x412;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x434;&#x43B;&#x44F; production</a><span class="light info">&#x411;&#x435;&#x437; &#x43F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x439;, 33.30&#x41A;&#x411; min+gzip</span><br></div>

<h3 id="CDN"><a href="#CDN" class="headerlink" title="CDN"></a>CDN</h3><p>&#x414;&#x43B;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x432; &#x438;&#x43B;&#x438; &#x432; &#x446;&#x435;&#x43B;&#x44F;&#x445; &#x43E;&#x431;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x44E;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;https://cdn.jsdelivr.net/npm/vue&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span></code></pre>
<p>&#x414;&#x43B;&#x44F; production, &#x43C;&#x44B; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x435;&#x43C; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x443;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x443;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x438;&#x437;&#x431;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x43E;&#x43C;&#x43E;&#x43A; &#x43F;&#x440;&#x438; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x435; &#x43D;&#x43E;&#x432;&#x44B;&#x445; &#x432;&#x435;&#x440;&#x441;&#x438;&#x439;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;https://cdn.jsdelivr.net/npm/vue@2.6.10/dist/vue.js&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span></code></pre>
<p>&#x415;&#x441;&#x43B;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x435; ES-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x438;, &#x442;&#x430;&#x43A;&#x436;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x438; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x430;&#x44F; &#x441; ES-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;&#x43C;&#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430;:</p>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;module&quot;</span>&gt;</span><span class="javascript">
  <span class="hljs-keyword">import</span> Vue <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;https://cdn.jsdelivr.net/npm/vue@2.6.10/dist/vue.esm.browser.js&apos;</span>
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span></code></pre>
<p>&#x418;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x434; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; NPM-&#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x43F;&#x43E; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x435; <a href="https://cdn.jsdelivr.net/npm/vue/" target="_blank" rel="noopener">cdn.jsdelivr.net/npm/vue</a>.</p>
<p>Vue &#x442;&#x430;&#x43A;&#x436;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x43D;&#x430; <a href="https://unpkg.com/vue@2.6.10/dist/vue.js" target="_blank" rel="noopener">unpkg</a> &#x438; <a href="https://cdnjs.cloudflare.com/ajax/libs/vue/2.6.10/vue.js" target="_blank" rel="noopener">cdnjs</a> (cdnjs &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x438;&#x437;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x441; NPM &#x441; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x437;&#x430;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x43E;&#x439;, &#x438;&#x437;-&#x437;&#x430; &#x447;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x44F;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x435; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x441;&#x440;&#x430;&#x437;&#x443;).</p>
<p>&#x41E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x440;&#x43E; <a href="#&#x41E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x438;&#x435;-&#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445;-&#x441;&#x431;&#x43E;&#x440;&#x43E;&#x43A;">&#x43E;&#x442;&#x43B;&#x438;&#x447;&#x438;&#x44F; &#x432; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430;&#x445; Vue</a> &#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; <strong>&#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x434;&#x43B;&#x44F; production</strong> &#x43D;&#x430; &#x441;&#x432;&#x43E;&#x451;&#x43C; &#x43E;&#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x430;&#x439;&#x442;&#x435;, &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x432; <code>vue.js</code> &#x43D;&#x430; <code>vue.min.js</code>. &#x42D;&#x442;&#x43E; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x438;, &#x430; &#x43D;&#x435; &#x434;&#x43B;&#x44F; &#x443;&#x434;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;.</p>
<h2 id="NPM"><a href="#NPM" class="headerlink" title="NPM"></a>NPM</h2><p>&#x420;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; NPM &#x43F;&#x440;&#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x438; &#x43A;&#x440;&#x443;&#x43F;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x43D;&#x430; Vue. &#x42D;&#x442;&#x43E;&#x442; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x432; &#x43F;&#x430;&#x440;&#x435; &#x441; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;, &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x43A;&#x430;&#x43A; <a href="https://webpack.js.org/" target="_blank" rel="noopener">Webpack</a> &#x438; <a href="http://browserify.org/" target="_blank" rel="noopener">Browserify</a>. &#x412;&#x43E; Vue &#x442;&#x430;&#x43A;&#x436;&#x435; &#x435;&#x441;&#x442;&#x44C; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x44B;&#x435; &#x441; &#x43D;&#x438;&#x43C;&#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x434;&#x43B;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; <a href="single-file-components.html">&#x43E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;</a>.</p>
<pre><code class="hljs bash"><span class="hljs-comment"># &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x44F;&#x44F; &#x441;&#x442;&#x430;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F;</span>
$ npm install vue</code></pre>
<h2 id="&#x418;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;-&#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x439;-&#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438;-CLI"><a href="#&#x418;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;-&#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x439;-&#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438;-CLI" class="headerlink" title="&#x418;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; (CLI)"></a>&#x418;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; (CLI)</h2><p>App.js &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; <a href="https://github.com/vuejs/vue-cli" target="_blank" rel="noopener">&#x43E;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; (CLI)</a> &#x434;&#x43B;&#x44F; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x43A;&#x430;&#x440;&#x43A;&#x430;&#x441;&#x430; &#x430;&#x43C;&#x431;&#x438;&#x446;&#x438;&#x43E;&#x437;&#x43D;&#x44B;&#x445; &#x43E;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;. &#x41F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442; &#x432;&#x441;&#x451; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x435; &#x434;&#x43B;&#x44F; &#x43E;&#x440;&#x433;&#x430;&#x43D;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;. &#x412;&#x441;&#x435;&#x433;&#x43E; &#x437;&#x430; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43C;&#x438;&#x43D;&#x443;&#x442; &#x432;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x449;&#x443;&#x44E; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x44E; &#x441; &#x433;&#x43E;&#x440;&#x44F;&#x447;&#x435;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x43E;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439;, &#x43B;&#x438;&#x43D;&#x442;&#x438;&#x43D;&#x433;&#x43E;&#x43C; &#x43A;&#x43E;&#x434;&#x430; &#x43F;&#x440;&#x438; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x438; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x435;&#x439; production-&#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;. &#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x435;&#x435; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x437;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x432; <a href="https://cli.vuejs.org/ru/" target="_blank" rel="noopener">&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438; Vue CLI</a>.</p>
<p class="tip">CLI &#x2014; &#x44D;&#x442;&#x43E; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445;, &#x43A;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; &#x441; Node.js &#x438; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x43C;&#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x43D;&#x43E;&#x432;&#x438;&#x447;&#x43E;&#x43A; &#x432;&#x43E; Vue &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x445; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434;&#x430;, &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x435;&#x43C; &#x441;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; <a href="./">&#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x43E;</a>, &#x43D;&#x435; &#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x449;&#x435;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;, &#x430; &#x443;&#x436;&#x435; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x440;&#x430;&#x437;&#x431;&#x438;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441; CLI.</p>

<div class="vue-mastery"><a href="https://www.vuemastery.com/courses/real-world-vue-js/vue-cli" target="_blank" rel="noopener" title="Vue CLI">&#x41F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x44F;&#x44E;&#x449;&#x435;&#x435; &#x432;&#x438;&#x434;&#x435;&#x43E; &#x43D;&#x430; Vue Mastery</a></div>

<h2 id="&#x41E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x438;&#x435;-&#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445;-&#x441;&#x431;&#x43E;&#x440;&#x43E;&#x43A;"><a href="#&#x41E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x438;&#x435;-&#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445;-&#x441;&#x431;&#x43E;&#x440;&#x43E;&#x43A;" class="headerlink" title="&#x41E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x441;&#x431;&#x43E;&#x440;&#x43E;&#x43A;"></a>&#x41E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x441;&#x431;&#x43E;&#x440;&#x43E;&#x43A;</h2><p>&#x412; <a href="https://cdn.jsdelivr.net/npm/vue/dist/" target="_blank" rel="noopener">&#x43F;&#x430;&#x43F;&#x43A;&#x435; <code>dist/</code> NPM-&#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430;</a> &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x445; &#x441;&#x431;&#x43E;&#x440;&#x43E;&#x43A; App.js. &#x412;&#x43E;&#x442; &#x43A;&#x440;&#x430;&#x442;&#x43A;&#x438;&#x439; &#x43E;&#x431;&#x437;&#x43E;&#x440; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x438;&#x439; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x43D;&#x438;&#x43C;&#x438;:</p>
<table>
<thead>
<tr>
<th></th>
<th>UMD</th>
<th>CommonJS</th>
<th>ES Module (&#x434;&#x43B;&#x44F; &#x441;&#x431;&#x43E;&#x440;&#x449;&#x438;&#x43A;&#x43E;&#x432;)</th>
<th>ES Module (&#x434;&#x43B;&#x44F; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x432;)</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>&#x41F;&#x43E;&#x43B;&#x43D;&#x430;&#x44F;</strong></td>
<td>vue.js</td>
<td>vue.common.js</td>
<td>vue.esm.js</td>
<td>vue.esm.browser.js</td>
</tr>
<tr>
<td><strong>Runtime-only</strong></td>
<td>vue.runtime.js</td>
<td>vue.runtime.common.js</td>
<td>vue.runtime.esm.js</td>
<td>-</td>
</tr>
<tr>
<td><strong>&#x41F;&#x43E;&#x43B;&#x43D;&#x430;&#x44F; (production)</strong></td>
<td>vue.min.js</td>
<td>-</td>
<td>-</td>
<td>vue.esm.browser.min.js</td>
</tr>
<tr>
<td><strong>Runtime-only (production)</strong></td>
<td>vue.runtime.min.js</td>
<td>-</td>
<td>-</td>
<td>-</td>
</tr>
</tbody>
</table>
<h3 id="&#x422;&#x435;&#x440;&#x43C;&#x438;&#x43D;&#x44B;"><a href="#&#x422;&#x435;&#x440;&#x43C;&#x438;&#x43D;&#x44B;" class="headerlink" title="&#x422;&#x435;&#x440;&#x43C;&#x438;&#x43D;&#x44B;"></a>&#x422;&#x435;&#x440;&#x43C;&#x438;&#x43D;&#x44B;</h3><ul>
<li><p><strong>&#x41F;&#x43E;&#x43B;&#x43D;&#x430;&#x44F;</strong>: &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; runtime &#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;.</p>
</li>
<li><p><strong>&#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440;</strong>: &#x43A;&#x43E;&#x434;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43E;&#x442;&#x432;&#x435;&#x447;&#x430;&#x435;&#x442; &#x437;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x44E; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x44B;&#x445; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432; &#x432; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; JavaScript.</p>
</li>
<li><p><strong>Runtime</strong>: &#x43A;&#x43E;&#x434;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43E;&#x442;&#x432;&#x435;&#x447;&#x430;&#x435;&#x442; &#x437;&#x430; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x432; Vue, &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x443; &#x438; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; DOM &#x438; &#x442;.&#x434;. &#x41F;&#x43E; &#x441;&#x443;&#x442;&#x438;, &#x44D;&#x442;&#x43E; &#x432;&#x441;&#x451;, &#x43A;&#x440;&#x43E;&#x43C;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440;&#x430;.</p>
</li>
<li><p><strong><a href="https://github.com/umdjs/umd" target="_blank" rel="noopener">UMD</a></strong>: &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; UMD &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x440;&#x430;&#x437;&#x443; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435;, &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44F; &#x442;&#x435;&#x433;&#x43E;&#x43C; <code>&lt;script&gt;</code>. &#x41F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; &#x432; jsDelivr CDN &#x438;&#x437; <a href="https://cdn.jsdelivr.net/npm/vue" target="_blank" rel="noopener">https://cdn.jsdelivr.net/npm/vue</a> &#x431;&#x443;&#x434;&#x435;&#x442; UMD-&#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430; Runtime + &#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440; (<code>vue.js</code>).</p>
</li>
<li><p><strong><a href="http://wiki.commonjs.org/wiki/Modules/1.1" target="_blank" rel="noopener">CommonJS</a></strong>: &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; CommonJS &#x43F;&#x440;&#x435;&#x434;&#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44B; &#x434;&#x43B;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441;&#x43E; &#x441;&#x442;&#x430;&#x440;&#x44B;&#x43C;&#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;, &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x43A;&#x430;&#x43A; <a href="http://browserify.org/" target="_blank" rel="noopener">Browserify</a> &#x438;&#x43B;&#x438; <a href="https://webpack.github.io" target="_blank" rel="noopener">Webpack 1</a>. &#x41F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; &#x434;&#x43B;&#x44F; &#x43D;&#x438;&#x445; (<code>pkg.main</code>) &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430; Runtime-only CommonJS (<code>vue.runtime.common.js</code>).</p>
</li>
<li><p><strong><a href="http://exploringjs.com/es6/ch_modules.html" target="_blank" rel="noopener">ES-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x438;</a></strong>: &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44F; &#x441; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; 2.6, Vue &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x434;&#x432;&#x435; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; ES-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439; (ESM):</p>
<ul>
<li><p>ESM &#x434;&#x43B;&#x44F; &#x441;&#x431;&#x43E;&#x440;&#x449;&#x438;&#x43A;&#x43E;&#x432;: &#x43F;&#x440;&#x435;&#x434;&#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x441; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x43C;&#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;, &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x43A;&#x430;&#x43A; <a href="https://webpack.js.org" target="_blank" rel="noopener">webpack 2</a> &#x438;&#x43B;&#x438; <a href="https://rollupjs.org/" target="_blank" rel="noopener">Rollup</a>. &#x424;&#x43E;&#x440;&#x43C;&#x430;&#x442; ESM &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43D; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437;&#x430;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x441;&#x431;&#x43E;&#x440;&#x449;&#x438;&#x43A;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430;&#x43C;&#x438; &#xAB;tree-shaking&#xBB; &#x438; &#x443;&#x434;&#x430;&#x43B;&#x438;&#x442;&#x44C; &#x43D;&#x435;&#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x439; &#x43A;&#x43E;&#x434; &#x438;&#x437; &#x444;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;. &#x424;&#x430;&#x439;&#x43B; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x438;&#x445; &#x441;&#x431;&#x43E;&#x440;&#x449;&#x438;&#x43A;&#x43E;&#x432; (<code>pkg.module</code>) &#x2014; &#x44D;&#x442;&#x43E; Runtime-only &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430; &#x434;&#x43B;&#x44F; ES-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439; (<code>vue.runtime.esm.js</code>).</p>
</li>
<li><p>ESM &#x434;&#x43B;&#x44F; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x432; (&#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; 2.6.0+): &#x43F;&#x440;&#x435;&#x434;&#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x438;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x430; &#x432; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x447;&#x435;&#x440;&#x435;&#x437; <code>&lt;script type=&quot;module&quot;&gt;</code>.</p>
</li>
</ul>
</li>
</ul>
<h3 id="Runtime-&#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440;-vs-Runtime-only"><a href="#Runtime-&#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440;-vs-Runtime-only" class="headerlink" title="Runtime + &#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440; vs. Runtime-only"></a>Runtime + &#x41A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440; vs. Runtime-only</h3><p>&#x415;&#x441;&#x43B;&#x438; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x43D;&#x430; &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442;&#x435; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x442;&#x435; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x443; &#x432; &#x43E;&#x43F;&#x446;&#x438;&#x44E; <code>template</code> &#x438;&#x43B;&#x438; &#x43C;&#x43E;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442;&#x435; &#x43A; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; DOM, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; &#x435;&#x433;&#x43E; HTML &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;), &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440;, &#x430; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x43F;&#x43E;&#x43B;&#x43D;&#x430;&#x44F; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430;:</p>
<pre><code class="hljs js"><span class="hljs-comment">// &#x44D;&#x442;&#x43E; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440;&#x430; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;</span>
<span class="hljs-keyword">new</span> Vue({
  <span class="hljs-attr">template</span>: <span class="hljs-string">&apos;&lt;div&gt;{{ hi }}&lt;/div&gt;&apos;</span>
})

<span class="hljs-comment">// &#x44D;&#x442;&#x43E; &#x43D;&#x435;&#x442;</span>
<span class="hljs-keyword">new</span> Vue({
  render (h) {
    <span class="hljs-keyword">return</span> h(<span class="hljs-string">&apos;div&apos;</span>, <span class="hljs-keyword">this</span>.hi)
  }
})</code></pre>
<p>&#x41F;&#x440;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; <code>vue-loader</code> &#x438;&#x43B;&#x438; <code>vueify</code> &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; <code>*.vue</code> &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; &#x431;&#x443;&#x434;&#x443;&#x442; &#x441;&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x44B; &#x432; JavaScript &#x435;&#x449;&#x451; &#x43D;&#x430; &#x44D;&#x442;&#x430;&#x43F;&#x435; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440; &#x432; &#x438;&#x442;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x439; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x435; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; runtime-only.</p>
<p>&#x422;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; runtime-only &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x43D;&#x430; 30% &#x43B;&#x435;&#x433;&#x447;&#x435;, &#x432; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x441; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x43C;&#x438;, &#x432;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x445; &#x432;&#x441;&#x44F;&#x43A;&#x438;&#x439; &#x440;&#x430;&#x437;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x44D;&#x442;&#x43E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x432;&#x441;&#x451; &#x440;&#x430;&#x432;&#x43D;&#x43E; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x43D;&#x443;&#x44E; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x443;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x44C; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;&#x43D;&#x438;&#x43C; &#x432; &#x441;&#x431;&#x43E;&#x440;&#x449;&#x438;&#x43A;&#x435;:</p>
<h4 id="Webpack"><a href="#Webpack" class="headerlink" title="Webpack"></a>Webpack</h4><pre><code class="hljs js"><span class="hljs-built_in">module</span>.exports = {
  <span class="hljs-comment">// ...</span>
  resolve: {
    <span class="hljs-attr">alias</span>: {
      <span class="hljs-string">&apos;vue$&apos;</span>: <span class="hljs-string">&apos;vue/dist/vue.esm.js&apos;</span> <span class="hljs-comment">// &apos;vue/dist/vue.common.js&apos; &#x434;&#x43B;&#x44F; webpack 1</span>
    }
  }
}</code></pre>
<h4 id="Rollup"><a href="#Rollup" class="headerlink" title="Rollup"></a>Rollup</h4><pre><code class="hljs js"><span class="hljs-keyword">const</span> alias = <span class="hljs-built_in">require</span>(<span class="hljs-string">&apos;rollup-plugin-alias&apos;</span>)

rollup({
  <span class="hljs-comment">// ...</span>
  plugins: [
    alias({
      <span class="hljs-string">&apos;vue&apos;</span>: <span class="hljs-built_in">require</span>.resolve(<span class="hljs-string">&apos;vue/dist/vue.esm.js&apos;</span>)
    })
  ]
})</code></pre>
<h4 id="Browserify"><a href="#Browserify" class="headerlink" title="Browserify"></a>Browserify</h4><p>&#x414;&#x43E;&#x431;&#x430;&#x432;&#x44C;&#x442;&#x435; &#x432; <code>package.json</code> &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430;:</p>
<pre><code class="hljs js">{
  <span class="hljs-comment">// ...</span>
  <span class="hljs-string">&quot;browser&quot;</span>: {
    <span class="hljs-string">&quot;vue&quot;</span>: <span class="hljs-string">&quot;vue/dist/vue.common.js&quot;</span>
  }
}</code></pre>
<h4 id="Parcel"><a href="#Parcel" class="headerlink" title="Parcel"></a>Parcel</h4><p>&#x414;&#x43E;&#x431;&#x430;&#x432;&#x44C;&#x442;&#x435; &#x432; <code>package.json</code> &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430;:</p>
<pre><code class="hljs js">{
  <span class="hljs-comment">// ...</span>
  <span class="hljs-string">&quot;alias&quot;</span>: {
    <span class="hljs-string">&quot;vue&quot;</span> : <span class="hljs-string">&quot;./node_modules/vue/dist/vue.common.js&quot;</span>
  }
}</code></pre>
<h3 id="&#x420;&#x435;&#x436;&#x438;&#x43C;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;-vs-&#x440;&#x435;&#x436;&#x438;&#x43C;-production"><a href="#&#x420;&#x435;&#x436;&#x438;&#x43C;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;-vs-&#x440;&#x435;&#x436;&#x438;&#x43C;-production" class="headerlink" title="&#x420;&#x435;&#x436;&#x438;&#x43C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; vs. &#x440;&#x435;&#x436;&#x438;&#x43C; production"></a>&#x420;&#x435;&#x436;&#x438;&#x43C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; vs. &#x440;&#x435;&#x436;&#x438;&#x43C; production</h3><p>&#x420;&#x435;&#x436;&#x438;&#x43C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;/production &#x436;&#x451;&#x441;&#x442;&#x43A;&#x43E; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D; &#x432; UMD-&#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430;&#x445;: &#x43D;&#x435;&#x441;&#x436;&#x430;&#x442;&#x44B;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x438; &#x43C;&#x438;&#x43D;&#x438;&#x444;&#x438;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x434;&#x43B;&#x44F; production.</p>
<p>&#x421;&#x431;&#x43E;&#x440;&#x43A;&#x438; CommonJS &#x438; ES Module &#x43F;&#x440;&#x435;&#x434;&#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44B; &#x434;&#x43B;&#x44F; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x44B; &#x43D;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x43C; &#x43C;&#x438;&#x43D;&#x438;&#x444;&#x438;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x432;&#x435;&#x440;&#x441;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43D;&#x438;&#x445;. &#x412;&#x44B; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B; &#x437;&#x430; &#x43C;&#x438;&#x43D;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44E; &#x438;&#x442;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x439; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;.</p>
<p>&#x421;&#x431;&#x43E;&#x440;&#x43A;&#x438; CommonJS &#x438; ES Module &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x438; &#x43D;&#x430; <code>process.env.NODE_ENV</code> &#x434;&#x43B;&#x44F; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x430;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x43E;&#x43D;&#x438; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x442;&#x44C;&#x441;&#x44F;. &#x412;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x438;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x440;&#x435;&#x436;&#x438;&#x43C;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; Vue &#x431;&#x443;&#x434;&#x435;&#x442; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x44C;&#x441;&#x44F;. &#x417;&#x430;&#x43C;&#x435;&#x43D;&#x430; <code>process.env.NODE_ENV</code> &#x43D;&#x430; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x44B;&#x439; &#x43B;&#x438;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43C;&#x438;&#x43D;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43A;&#x430;&#x43A; UglifyJS, &#x443;&#x434;&#x430;&#x43B;&#x44F;&#x442;&#x44C; &#x446;&#x435;&#x43B;&#x44B;&#x435; &#x431;&#x43B;&#x43E;&#x43A;&#x438; &#x43A;&#x43E;&#x434;&#x430;, &#x43F;&#x440;&#x435;&#x434;&#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;, &#x443;&#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x430;&#x44F; &#x438;&#x442;&#x43E;&#x433;&#x43E;&#x432;&#x44B;&#x439; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x444;&#x430;&#x439;&#x43B;&#x430;.</p>
<h4 id="Webpack-1"><a href="#Webpack-1" class="headerlink" title="Webpack"></a>Webpack</h4><p>&#x421; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; Webpack 4+ &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x43F;&#x446;&#x438;&#x44E; <code>mode</code>:</p>
<pre><code class="hljs js"><span class="hljs-built_in">module</span>.exports = {
  <span class="hljs-attr">mode</span>: <span class="hljs-string">&apos;production&apos;</span>
}</code></pre>
<p>&#x41D;&#x43E; &#x432; Webpack 3 &#x438; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x440;&#x430;&#x43D;&#x43D;&#x438;&#x445; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F;&#x445; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; <a href="https://webpack.js.org/plugins/define-plugin/" target="_blank" rel="noopener">DefinePlugin</a>:</p>
<pre><code class="hljs js"><span class="hljs-keyword">var</span> webpack = <span class="hljs-built_in">require</span>(<span class="hljs-string">&apos;webpack&apos;</span>)

<span class="hljs-built_in">module</span>.exports = {
  <span class="hljs-comment">// ...</span>
  plugins: [
    <span class="hljs-comment">// ...</span>
    <span class="hljs-keyword">new</span> webpack.DefinePlugin({
      <span class="hljs-string">&apos;process.env&apos;</span>: {
        <span class="hljs-attr">NODE_ENV</span>: <span class="hljs-built_in">JSON</span>.stringify(<span class="hljs-string">&apos;production&apos;</span>)
      }
    })
  ]
}</code></pre>
<h4 id="Rollup-1"><a href="#Rollup-1" class="headerlink" title="Rollup"></a>Rollup</h4><p>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; <a href="https://github.com/rollup/rollup-plugin-replace" target="_blank" rel="noopener">rollup-plugin-replace</a>:</p>
<pre><code class="hljs js"><span class="hljs-keyword">const</span> replace = <span class="hljs-built_in">require</span>(<span class="hljs-string">&apos;rollup-plugin-replace&apos;</span>)

rollup({
  <span class="hljs-comment">// ...</span>
  plugins: [
    replace({
      <span class="hljs-string">&apos;process.env.NODE_ENV&apos;</span>: <span class="hljs-built_in">JSON</span>.stringify(<span class="hljs-string">&apos;production&apos;</span>)
    })
  ]
}).then(...)</code></pre>
<h4 id="Browserify-1"><a href="#Browserify-1" class="headerlink" title="Browserify"></a>Browserify</h4><p>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x435; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x442;&#x440;&#x430;&#x43D;&#x441;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E; <a href="https://github.com/hughsk/envify" target="_blank" rel="noopener">envify</a> &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x448;&#x435;&#x439; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;.</p>
<pre><code class="hljs bash">NODE_ENV=production browserify -g envify -e main.js | uglifyjs -c -m &gt; build.js</code></pre>
<p>&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x435;&#x435; &#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; <a href="deployment.html">&#x440;&#x430;&#x437;&#x432;&#x451;&#x440;&#x442;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43D;&#x430; production</a>.</p>
<h3 id="CSP-&#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F;"><a href="#CSP-&#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F;" class="headerlink" title="CSP-&#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F;"></a>CSP-&#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F;</h3><p>&#x41D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x442;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x430;&#x43A; Google Chrome Apps, &#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x442; &#x441;&#x43E;&#x431;&#x43B;&#x44E;&#x434;&#x435;&#x43D;&#x438;&#x44F; Content Security Policy (CSP), &#x437;&#x430;&#x43F;&#x440;&#x435;&#x449;&#x430;&#x44E;&#x449;&#x435;&#x439; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438; <code>new Function()</code> &#x434;&#x43B;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439;. &#x41F;&#x43E;&#x43B;&#x43D;&#x430;&#x44F; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;, &#x438; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x435;&#x43F;&#x440;&#x438;&#x433;&#x43E;&#x434;&#x43D;&#x430; &#x43A; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44E; &#x432; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x445;.</p>
<p>&#x421; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x44B;, runtime-&#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x44B; &#x441; CSP. &#x415;&#x441;&#x43B;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x445; &#x441; <a href="https://github.com/vuejs-templates/webpack-simple" target="_blank" rel="noopener">Webpack &#x438; vue-loader</a> &#x438;&#x43B;&#x438; <a href="https://github.com/vuejs-templates/browserify-simple" target="_blank" rel="noopener">Browserify &#x438; vueify</a>, &#x442;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x44B; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x44D;&#x442;&#x430;&#x43F;&#x435; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x432; <code>render</code>-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x442; &#x432; CSP-&#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x445;.</p>
<h2 id="&#x421;&#x431;&#x43E;&#x440;&#x43A;&#x430;-dev-&#x432;&#x435;&#x440;&#x441;&#x438;&#x438;"><a href="#&#x421;&#x431;&#x43E;&#x440;&#x43A;&#x430;-dev-&#x432;&#x435;&#x440;&#x441;&#x438;&#x438;" class="headerlink" title="&#x421;&#x431;&#x43E;&#x440;&#x43A;&#x430; dev-&#x432;&#x435;&#x440;&#x441;&#x438;&#x438;"></a>&#x421;&#x431;&#x43E;&#x440;&#x43A;&#x430; dev-&#x432;&#x435;&#x440;&#x441;&#x438;&#x438;</h2><p><strong>&#x412;&#x430;&#x436;&#x43D;&#x43E;&#x435; &#x437;&#x430;&#x43C;&#x435;&#x447;&#x430;&#x43D;&#x438;&#x435;</strong>: &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x432; <code>/dist</code> &#x43D;&#x430; GitHub &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x438; &#x440;&#x435;&#x43B;&#x438;&#x437;&#x430;&#x445;. &#x427;&#x442;&#x43E;&#x431;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x438;&#x437; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x445; &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x438;&#x43A;&#x43E;&#x432; &#x441; GitHub, &#x441;&#x43E;&#x431;&#x435;&#x440;&#x438;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442; &#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;:</p>
<pre><code class="hljs bash">git <span class="hljs-built_in">clone</span> https://github.com/vuejs/vue.git node_modules/vue
<span class="hljs-built_in">cd</span> node_modules/vue
npm install
npm run build</code></pre>
<h2 id="Bower"><a href="#Bower" class="headerlink" title="Bower"></a>Bower</h2><p>&#x422;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; UMD-&#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x44B; &#x432; Bower.</p>
<pre><code class="hljs bash"><span class="hljs-comment"># &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x44F;&#x44F; &#x441;&#x442;&#x430;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F;</span>
$ bower install vue</code></pre>
<h2 id="&#x417;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43A;&#x438;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439;-AMD"><a href="#&#x417;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43A;&#x438;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439;-AMD" class="headerlink" title="&#x417;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43A;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439; AMD"></a>&#x417;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43A;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439; AMD</h2><p>&#x412;&#x441;&#x435; UMD-&#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x430;&#x43F;&#x440;&#x44F;&#x43C;&#x443;&#x44E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x44B; &#x43A;&#x430;&#x43A; AMD-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x438;.</p>

    
    
      <div class="guide-links">
        
        
        
        
          <span style="float: right;"><a href="/v2/guide/index.html">&#x412;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;</a> &#x2192;</span>
        
      </div>
    
    <div class="footer">
        <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
<div class="bsa-cpc"></div>
<script>
  (function(){
    if(typeof _bsa !== 'undefined' && _bsa) {
    _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
      target: '.bsa-cpc',
      align: 'horizontal',
      disable_css: 'true'
    });
      }
  })();
</script>

      &#x41E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x451; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;?
      <a href="https://github.com/translation-gang/ru.vuejs.org/blob/master/src/v2/guide/installation.md" target="_blank">
        &#x41E;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43D;&#x430; GitHub!
      </a>
    </div>

</body>
</html>