<!DOCTYPE html>
<html lang="en" id="wrapper">
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Фильтры</title>

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <link href="./style.css" rel="stylesheet" type="text/css">

    <!-- версия для разработки, отображает полезные предупреждения в консоли -->
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>

    <!-- production-версия, оптимизированная для размера и скорости -->
    <!--    <script src="https://cdn.jsdelivr.net/npm/vue"></script>-->

</head>
<body id="main">
<p>Спаршено с: <a href="https://ru.vuejs.org/v2/guide/filters.html">https://ru.vuejs.org/v2/guide/filters.html</a></p>

    
      
        

      
    
    
      <h1>&#x424;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x44B;</h1>
    
    
      <p>&#x414;&#x43B;&#x44F; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x451;&#x43D;&#x43D;&#x44B;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; &#x432;&#x43E; Vue &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x44B;. &#x41E;&#x43D;&#x438; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x44F;&#x442; &#x441;&#x432;&#x43E;&#x451; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x434;&#x432;&#x443;&#x445; &#x43C;&#x435;&#x441;&#x442;&#x430;&#x445;: <strong>&#x432; mustache-&#x438;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x43E;&#x43B;&#x44F;&#x446;&#x438;&#x44F;&#x445; &#x438; &#x432; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x445; <code>v-bind</code></strong> (&#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x435;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; 2.1.0+). &#x424;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x432; &#x43A;&#x43E;&#x43D;&#x446;&#x435; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; JavaScript &#x438; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x432;&#x435;&#x440;&#x442;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x447;&#x435;&#x440;&#x442;&#x43E;&#x439;:</p>
<pre><code class="hljs html"><span class="hljs-comment">&lt;!-- mustache --&gt;</span>
{{ message | capitalize }}

<span class="hljs-comment">&lt;!-- v-bind --&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">div</span> <span class="hljs-attr">v-bind:id</span>=<span class="hljs-string">&quot;rawId | formatId&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span></code></pre>
<p>&#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x44B; &#x432; &#x43E;&#x43F;&#x446;&#x438;&#x44F;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;:</p>
<pre><code class="hljs js">filters: {
  <span class="hljs-attr">capitalize</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">value</span>) </span>{
    <span class="hljs-keyword">if</span> (!value) <span class="hljs-keyword">return</span> <span class="hljs-string">&apos;&apos;</span>
    value = value.toString()
    <span class="hljs-keyword">return</span> value.charAt(<span class="hljs-number">0</span>).toUpperCase() + value.slice(<span class="hljs-number">1</span>)
  }
}</code></pre>
<p>&#x438;&#x43B;&#x438; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435;&#x43C; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; Vue:</p>
<pre><code class="hljs js">Vue.filter(<span class="hljs-string">&apos;capitalize&apos;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">value</span>) </span>{
  <span class="hljs-keyword">if</span> (!value) <span class="hljs-keyword">return</span> <span class="hljs-string">&apos;&apos;</span>
  value = value.toString()
  <span class="hljs-keyword">return</span> value.charAt(<span class="hljs-number">0</span>).toUpperCase() + value.slice(<span class="hljs-number">1</span>)
})

<span class="hljs-keyword">new</span> Vue({
  <span class="hljs-comment">// ...</span>
})</code></pre>
<p>&#x41A;&#x43E;&#x433;&#x434;&#x430; &#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x430; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x436;&#x435; &#x438;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; &#x438; &#x443; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E;, &#x442;&#x43E; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x43E;&#x440;&#x438;&#x442;&#x435;&#x442;&#x43D;&#x435;&#x435;.</p>
<p>&#x41D;&#x438;&#x436;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x451;&#x43D; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43D;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x430; <code>capitalize</code>:</p>

<div id="example_1" class="demo">
  <input type="text" v-model="message">
  <p>{{ message | capitalize }}</p>
</div>
<script>
  new Vue({
    el: '#example_1',
    data: function () {
      return {
        message: 'john'
      }
    },
    filters: {
      capitalize: function (value) {
        if (!value) return ''
        value = value.toString()
        return value.charAt(0).toUpperCase() + value.slice(1)
      }
    }
  })
</script>

<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x430; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; (&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x435;&#x439; &#x446;&#x435;&#x43F;&#x43E;&#x447;&#x43A;&#x438;) &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;. &#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x430; <code>capitalize</code> &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; <code>message</code> &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;.</p>
<p>&#x424;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x44B; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43E;&#x431;&#x44A;&#x435;&#x434;&#x438;&#x43D;&#x44F;&#x442;&#x44C; &#x432; &#x446;&#x435;&#x43F;&#x43E;&#x447;&#x43A;&#x438;:</p>
<pre><code class="hljs html">{{ message | filterA | filterB }}</code></pre>
<p>&#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; <code>filterA</code>, &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x439; &#x441; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C;, &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; <code>message</code>, &#x430; &#x437;&#x430;&#x442;&#x435;&#x43C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; <code>filterB</code> &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44B;&#x437;&#x432;&#x430;&#x43D;&#x430; &#x441; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; <code>filterA</code>, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x432; <code>filterB</code>.</p>
<p>&#x424;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x44B; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; JavaScript-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;&#x43C;&#x438;, &#x438; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x44C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x44B;:</p>
<pre><code class="hljs html">{{ message | filterA(&apos;arg1&apos;, arg2) }}</code></pre>
<p>&#x412; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; <code>filterA</code> &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; &#x441; &#x442;&#x440;&#x435;&#x43C;&#x44F; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; <code>message</code> &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x430; <code>&apos;arg1&apos;</code> &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x430; &#x432; <code>filterA</code> &#x432;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C;, &#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; <code>arg2</code> &#x2014; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x438;&#x43C;.</p>

    
    
      <div class="guide-links">
        
        
          <span>&#x2190; <a href="/v2/guide/plugins.html">&#x41F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x44B;</a></span>
        
        
        
          <span style="float: right;"><a href="/v2/guide/single-file-components.html">&#x41E;&#x434;&#x43D;&#x43E;&#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;</a> &#x2192;</span>
        
      </div>
    
    <div class="footer">
        <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
<div class="bsa-cpc"></div>
<script>
  (function(){
    if(typeof _bsa !== 'undefined' && _bsa) {
    _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
      target: '.bsa-cpc',
      align: 'horizontal',
      disable_css: 'true'
    });
      }
  })();
</script>

      &#x41E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x451; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;?
      <a href="https://github.com/translation-gang/ru.vuejs.org/blob/master/src/v2/guide/filters.md" target="_blank">
        &#x41E;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43D;&#x430; GitHub!
      </a>
    </div>

</body>
</html>