<!DOCTYPE html>
<html lang="en" id="wrapper">
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Экземпляр Vue</title>

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
    <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <link href="./style.css" rel="stylesheet" type="text/css">

    <!-- версия для разработки, отображает полезные предупреждения в консоли -->
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>

    <!-- production-версия, оптимизированная для размера и скорости -->
    <!--    <script src="https://cdn.jsdelivr.net/npm/vue"></script>-->

</head>
<body id="main">
<p>Спаршено с: <a href="https://ru.vuejs.org/v2/guide/instance.html">https://ru.vuejs.org/v2/guide/instance.html</a></p>

    
      
        

      
    
    
      <h1>&#x42D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; Vue</h1>
    
    
      <h2 id="&#x421;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435;-&#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;-Vue"><a href="#&#x421;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435;-&#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;-Vue" class="headerlink" title="&#x421;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; Vue"></a>&#x421;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; Vue</h2><p>&#x41A;&#x430;&#x436;&#x434;&#x43E;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; <strong>&#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; Vue</strong> &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; <code>Vue</code>:</p>
<pre><code class="hljs js"><span class="hljs-keyword">var</span> vm = <span class="hljs-keyword">new</span> Vue({
  <span class="hljs-comment">// &#x43E;&#x43F;&#x446;&#x438;&#x438;</span>
})</code></pre>
<p>&#x425;&#x43E;&#x442;&#x44C; Vue &#x438; &#x43D;&#x435; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x443;&#x435;&#x442; <a href="https://ru.wikipedia.org/wiki/Model-View-ViewModel" target="_blank" rel="noopener">&#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D; MVVM</a> &#x432; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x439; &#x43C;&#x435;&#x440;&#x435;, &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x430; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x432;&#x43E;&#x440;&#x43A;&#x430; &#x438;&#x43C; &#x432;&#x43E; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x43C; &#x432;&#x434;&#x43E;&#x445;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x430;. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x443;&#x44E; &#x441; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; Vue &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x443;&#x44E;&#x442; <code>vm</code> (&#x441;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x451;&#x43D;&#x43D;&#x43E; &#x43E;&#x442; ViewModel).</p>
<p>&#x41F;&#x440;&#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x438; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; Vue &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x44C; <strong>&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x43E;&#x43F;&#x446;&#x438;&#x439;</strong>. &#x411;&#x43E;&#x43B;&#x44C;&#x448;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x430; &#x43F;&#x43E;&#x441;&#x432;&#x44F;&#x449;&#x435;&#x43D;&#x430; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44E;, &#x43A;&#x430;&#x43A; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x438; &#x43E;&#x43F;&#x446;&#x438;&#x438; &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x438;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x436;&#x435;&#x43B;&#x430;&#x435;&#x43C;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F;. &#x41F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43E;&#x43F;&#x446;&#x438;&#x439; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x432; <a href="../api/#&#x41E;&#x43F;&#x446;&#x438;&#x438;-&#x2014;-&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435;">&#x441;&#x43F;&#x440;&#x430;&#x432;&#x43E;&#x447;&#x43D;&#x438;&#x43A;&#x435; API</a>.</p>
<p>&#x41F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; Vue &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x438;&#x442; &#x438;&#x437; <strong>&#x43A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x43E;&#x433;&#x43E; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; Vue</strong>, &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43C;&#x43E;&#x433;&#x43E; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <code>new Vue</code>, &#x43E;&#x43F;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x440;&#x433;&#x430;&#x43D;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x432; &#x434;&#x435;&#x440;&#x435;&#x432;&#x43E; &#x432;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x445;, &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x434;&#x435;&#x440;&#x435;&#x432;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; TODO-&#x441;&#x43F;&#x438;&#x441;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x435;&#x442;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="hljs undefined">&#x41A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x43E;&#x439; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;
&#x2514;&#x2500; TodoList
   &#x251C;&#x2500; TodoItem
   &#x2502;  &#x251C;&#x2500; DeleteTodoButton
   &#x2502;  &#x2514;&#x2500; EditTodoButton
   &#x2514;&#x2500; TodoListFooter
      &#x251C;&#x2500; ClearTodosButton
      &#x2514;&#x2500; TodoListStatistics</code></pre>
<p>&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x435;&#x435; &#x43E; <a href="components.html">&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;</a> &#x43C;&#x44B; &#x43F;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43C; &#x43F;&#x43E;&#x437;&#x434;&#x43D;&#x435;&#x435;. &#x410; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x437;&#x430;&#x43F;&#x43E;&#x43C;&#x43D;&#x438;&#x442;&#x435;, &#x447;&#x442;&#x43E; &#x432;&#x441;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; Vue &#x442;&#x430;&#x43A;&#x436;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;&#x43C;&#x438; Vue &#x438; &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x44E;&#x442; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x436;&#x435; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x43E;&#x43F;&#x446;&#x438;&#x439; (&#x437;&#x430; &#x438;&#x441;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x445; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x43E;&#x433;&#x43E;).</p>
<h2 id="&#x414;&#x430;&#x43D;&#x43D;&#x44B;&#x435;-&#x438;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B;"><a href="#&#x414;&#x430;&#x43D;&#x43D;&#x44B;&#x435;-&#x438;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B;" class="headerlink" title="&#x414;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B;"></a>&#x414;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B;</h2><p>&#x41A;&#x43E;&#x433;&#x434;&#x430; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; Vue &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;, &#x43E;&#x43D; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x432;&#x441;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;, &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x432; &#x43E;&#x43F;&#x446;&#x438;&#x438; <code>data</code>, &#x432; <strong>&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x438;</strong> Vue. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#xAB;&#x440;&#x435;&#x430;&#x433;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#xBB; &#x43D;&#x430; &#x438;&#x445; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F;, &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x44F;&#x441;&#x44C; &#x432; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; &#x43D;&#x43E;&#x432;&#x44B;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438;.</p>
<pre><code class="hljs js"><span class="hljs-comment">// &#x41D;&#x430;&#x448; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442; data</span>
<span class="hljs-keyword">var</span> data = { <span class="hljs-attr">a</span>: <span class="hljs-number">1</span> }

<span class="hljs-comment">// &#x41E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; Vue</span>
<span class="hljs-keyword">var</span> vm = <span class="hljs-keyword">new</span> Vue({
  <span class="hljs-attr">data</span>: data
})

<span class="hljs-comment">// &#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x438;&#x437; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;</span>
<span class="hljs-comment">// &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442; &#x442;&#x43E; &#x436;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x438;&#x437; &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x445; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;</span>
vm.a === data.a <span class="hljs-comment">// =&gt; true</span>

<span class="hljs-comment">// &#x418;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;</span>
<span class="hljs-comment">// &#x432;&#x43B;&#x438;&#x44F;&#x435;&#x442; &#x43D;&#x430; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435;</span>
vm.a = <span class="hljs-number">2</span>
data.a <span class="hljs-comment">// =&gt; 2</span>

<span class="hljs-comment">// ... &#x438; &#x43D;&#x430;&#x43E;&#x431;&#x43E;&#x440;&#x43E;&#x442;</span>
data.a = <span class="hljs-number">3</span>
vm.a <span class="hljs-comment">// =&gt; 3</span></code></pre>
<p>&#x41A;&#x43E;&#x433;&#x434;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x44F;&#x44E;&#x442;&#x441;&#x44F;, &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x43E;. &#x41D;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;, &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x432; <code>data</code> &#x431;&#x443;&#x434;&#x443;&#x442; <strong>&#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C;&#x438;</strong>, &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43D;&#x438; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x438; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;. &#x42D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x435;&#x441;&#x43B;&#x438; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x43E;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p>
<pre><code class="hljs js">vm.b = <span class="hljs-string">&apos;hi&apos;</span></code></pre>
<p>&#x422;&#x43E; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x432; <code>b</code> &#x43D;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x438;&#x445; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x437;&#x43D;&#x430;&#x435;&#x442;&#x435;, &#x447;&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x43D;&#x430;&#x434;&#x43E;&#x431;&#x438;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x437;&#x436;&#x435;, &#x43D;&#x43E; &#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x43D;&#x43E; &#x43F;&#x443;&#x441;&#x442;&#x43E;&#x435; &#x438;&#x43B;&#x438; &#x43D;&#x435;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x435;&#x435;, &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p>
<pre><code class="hljs js">data: {
  <span class="hljs-attr">newTodoText</span>: <span class="hljs-string">&apos;&apos;</span>,
  <span class="hljs-attr">visitCount</span>: <span class="hljs-number">0</span>,
  <span class="hljs-attr">hideCompletedTodos</span>: <span class="hljs-literal">false</span>,
  <span class="hljs-attr">todos</span>: [],
  <span class="hljs-attr">error</span>: <span class="hljs-literal">null</span>
}</code></pre>
<p>&#x415;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x438;&#x441;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x437;&#x434;&#x435;&#x441;&#x44C; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; <code>Object.freeze()</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x442;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;, &#x447;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x435;&#x442; &#x43D;&#x435;&#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; <em>&#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C;</em> &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43E;&#x439; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x438;.</p>
<pre><code class="hljs js"><span class="hljs-keyword">var</span> obj = {
  <span class="hljs-attr">foo</span>: <span class="hljs-string">&apos;bar&apos;</span>
}

<span class="hljs-built_in">Object</span>.freeze(obj)

<span class="hljs-keyword">new</span> Vue({
  <span class="hljs-attr">el</span>: <span class="hljs-string">&apos;#app&apos;</span>,
  <span class="hljs-attr">data</span>: obj
})</code></pre>
<pre><code class="hljs html"><span class="hljs-tag">&lt;<span class="hljs-name">div</span> <span class="hljs-attr">id</span>=<span class="hljs-string">&quot;app&quot;</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>{{ foo }}<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
  <span class="hljs-comment">&lt;!-- &#x43C;&#x44B; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C; `foo`! --&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">button</span> <span class="hljs-attr">v-on:click</span>=<span class="hljs-string">&quot;foo = &apos;baz&apos;&quot;</span>&gt;</span>&#x418;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C;<span class="hljs-tag">&lt;/<span class="hljs-name">button</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">div</span>&gt;</span></code></pre>
<p>&#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x430; <code>data</code>, &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x44B; Vue &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442; &#x440;&#x44F;&#x434; &#x441;&#x43B;&#x443;&#x436;&#x435;&#x431;&#x43D;&#x44B;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432; &#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;. &#x418;&#x445; &#x438;&#x43C;&#x435;&#x43D;&#x430; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x441; &#x43F;&#x440;&#x435;&#x444;&#x438;&#x43A;&#x441;&#x430; <code>$</code>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x442; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p>
<pre><code class="hljs js"><span class="hljs-keyword">var</span> data = { <span class="hljs-attr">a</span>: <span class="hljs-number">1</span> }
<span class="hljs-keyword">var</span> vm = <span class="hljs-keyword">new</span> Vue({
  <span class="hljs-attr">el</span>: <span class="hljs-string">&apos;#example&apos;</span>,
  <span class="hljs-attr">data</span>: data
})

vm.$data === data <span class="hljs-comment">// =&gt; true</span>
vm.$el === <span class="hljs-built_in">document</span>.getElementById(<span class="hljs-string">&apos;example&apos;</span>) <span class="hljs-comment">// =&gt; true</span>

<span class="hljs-comment">// $watch &#x2014; &#x44D;&#x442;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;</span>
vm.$watch(<span class="hljs-string">&apos;a&apos;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">newValue, oldValue</span>) </span>{
  <span class="hljs-comment">// &#x42D;&#x442;&#x43E;&#x442; &#x43A;&#x43E;&#x43B;&#x43B;&#x431;&#x44D;&#x43A; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44B;&#x437;&#x432;&#x430;&#x43D;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x441;&#x44F; `vm.a`</span>
})</code></pre>
<p>&#x421; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x43C; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x43E;&#x43C; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432; &#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; Vue &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; <a href="../api/#&#x421;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;-&#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;">&#x441;&#x43F;&#x440;&#x430;&#x432;&#x43E;&#x447;&#x43D;&#x438;&#x43A;&#x435; API</a>.</p>
<h2 id="&#x425;&#x443;&#x43A;&#x438;-&#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;-&#x446;&#x438;&#x43A;&#x43B;&#x430;-&#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;"><a href="#&#x425;&#x443;&#x43A;&#x438;-&#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;-&#x446;&#x438;&#x43A;&#x43B;&#x430;-&#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;" class="headerlink" title="&#x425;&#x443;&#x43A;&#x438; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;"></a>&#x425;&#x443;&#x43A;&#x438; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;</h2><div class="vueschool"><a href="https://vueschool.io/lessons/understanding-the-vuejs-lifecycle-hooks?friend=vuejs" target="_blank" rel="noopener" title="Free App.js Lifecycle Hooks Lesson">&#x41F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x442;&#x435; &#x431;&#x435;&#x441;&#x43F;&#x43B;&#x430;&#x442;&#x43D;&#x44B;&#x439; &#x443;&#x440;&#x43E;&#x43A; &#x43D;&#x430; Vue School</a></div>

<p>&#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; Vue &#x43F;&#x440;&#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x438; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x448;&#x430;&#x433;&#x43E;&#x432; &#x438;&#x43D;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x2014; &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43D;&#x430;&#x441;&#x442;&#x440;&#x430;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x435;&#x43D;&#x438;&#x435; &#x437;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438;, &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x443;&#x435;&#x442; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;, &#x43C;&#x43E;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x432; DOM, &#x43E;&#x431;&#x43D;&#x43E;&#x432;&#x43B;&#x44F;&#x435;&#x442; DOM &#x43F;&#x440;&#x438; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;. &#x41C;&#x435;&#x436;&#x434;&#x443; &#x44D;&#x442;&#x438;&#x43C;&#x438; &#x448;&#x430;&#x433;&#x430;&#x43C;&#x438; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;, &#x43D;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; <strong>&#x445;&#x443;&#x43A;&#x430;&#x43C;&#x438; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430;</strong>, &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x439; &#x43A;&#x43E;&#x434; &#x43D;&#x430; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x44B;&#x445; &#x44D;&#x442;&#x430;&#x43F;&#x430;&#x445;.</p>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x445;&#x443;&#x43A; <a href="../api/#created"><code>created</code></a> &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x434;&#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;:</p>
<pre><code class="hljs js"><span class="hljs-keyword">new</span> Vue({
  <span class="hljs-attr">data</span>: {
    <span class="hljs-attr">a</span>: <span class="hljs-number">1</span>
  },
  <span class="hljs-attr">created</span>: <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
    <span class="hljs-comment">// `this` &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; vm</span>
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; a: &apos;</span> + <span class="hljs-keyword">this</span>.a)
  }
})
<span class="hljs-comment">// =&gt; &quot;&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; a: 1&quot;</span></code></pre>
<p>&#x421;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x442; &#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x445;&#x443;&#x43A;&#x438;, &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x43D;&#x430; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x441;&#x442;&#x430;&#x434;&#x438;&#x44F;&#x445; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; <a href="../api/#mounted"><code>mounted</code></a>, <a href="../api/#updated"><code>updated</code></a> &#x438; <a href="../api/#destroyed"><code>destroyed</code></a>. &#x412;&#x441;&#x435; &#x445;&#x443;&#x43A;&#x438; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x441; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x43D;&#x43E;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x439; <code>this</code>, &#x441;&#x441;&#x44B;&#x43B;&#x430;&#x44E;&#x449;&#x435;&#x439;&#x441;&#x44F; &#x43D;&#x430; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x449;&#x438;&#x439; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; Vue.</p>
<p class="tip">&#x41D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; <a href="https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Functions/Arrow_functions" target="_blank" rel="noopener">&#x441;&#x442;&#x440;&#x435;&#x43B;&#x43E;&#x447;&#x43D;&#x44B;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;</a> &#x432; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;&#x445; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; &#x438; &#x432; &#x43A;&#x43E;&#x43B;&#x43B;&#x431;&#x44D;&#x43A;&#x430;&#x445;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; <code>created: () =&gt; console.log(this.a)</code> &#x438;&#x43B;&#x438; <code>vm.$watch(&apos;a&apos;, newVal =&gt; this.myMethod())</code>. &#x422;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x441;&#x442;&#x440;&#x435;&#x43B;&#x43E;&#x447;&#x43D;&#x44B;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x43D;&#x435; &#x438;&#x43C;&#x435;&#x44E;&#x442; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; <code>this</code>, &#x442;&#x43E; <code>this</code> &#x432; &#x43A;&#x43E;&#x434;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x43B;&#x44E;&#x431;&#x430;&#x44F; &#x434;&#x440;&#x443;&#x433;&#x430;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x438; &#x435;&#x451; &#x43F;&#x43E;&#x438;&#x441;&#x43A; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44F;&#x445; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x432;&#x44B;&#x448;&#x435; &#x434;&#x43E; &#x442;&#x435;&#x445; &#x43F;&#x43E;&#x440; &#x43F;&#x43E;&#x43A;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x430;, &#x447;&#x430;&#x441;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x44F; &#x43A; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x430;&#x43C;, &#x43A;&#x430;&#x43A; <code>Uncaught TypeError: Cannot read property of undefined</code> &#x438;&#x43B;&#x438; <code>Uncaught TypeError: this.myMethod is not a function</code>.</p>

<h2 id="&#x414;&#x438;&#x430;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430;-&#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;-&#x446;&#x438;&#x43A;&#x43B;&#x430;"><a href="#&#x414;&#x438;&#x430;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430;-&#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;-&#x446;&#x438;&#x43A;&#x43B;&#x430;" class="headerlink" title="&#x414;&#x438;&#x430;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430;"></a>&#x414;&#x438;&#x430;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430;</h2><p>&#x41D;&#x438;&#x436;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x430; &#x434;&#x438;&#x430;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x430; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;. &#x41D;&#x435;&#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x44C; &#x435;&#x451; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441;, &#x43D;&#x43E; &#x43F;&#x43E; &#x43C;&#x435;&#x440;&#x435; &#x438;&#x437;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x438; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x43A;&#x438; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x43A; &#x43D;&#x435;&#x439; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x431;&#x440;&#x430;&#x449;&#x430;&#x442;&#x44C;&#x441;&#x44F;.</p>
<p><img src="/images/lifecycle.png" alt="&#x416;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x446;&#x438;&#x43A;&#x43B; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; Vue"></p>

    
    
      <div class="guide-links">
        
        
          <span>&#x2190; <a href="/v2/guide/index.html">&#x412;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;</a></span>
        
        
        
          <span style="float: right;"><a href="/v2/guide/syntax.html">&#x421;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432;</a> &#x2192;</span>
        
      </div>
    
    <div class="footer">
        <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
<div class="bsa-cpc"></div>
<script>
  (function(){
    if(typeof _bsa !== 'undefined' && _bsa) {
    _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
      target: '.bsa-cpc',
      align: 'horizontal',
      disable_css: 'true'
    });
      }
  })();
</script>

      &#x41E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x432;&#x43E;&#x451; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;?
      <a href="https://github.com/translation-gang/ru.vuejs.org/blob/master/src/v2/guide/instance.md" target="_blank">
        &#x41E;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x44D;&#x442;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443; &#x43D;&#x430; GitHub!
      </a>
    </div>

</body>
</html>